garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: DMAnAIRQ
#define DMAnAIRQ DMAnAIRQ
DMAnAIRQ                                 equ 0056h
// bitfield definitions
DMAnAIRQ_AIRQ_POSN                       equ 0000h
DMAnAIRQ_AIRQ_POSITION                   equ 0000h
DMAnAIRQ_AIRQ_SIZE                       equ 0008h
DMAnAIRQ_AIRQ_LENGTH                     equ 0008h
DMAnAIRQ_AIRQ_MASK                       equ 00FFh
DMAnAIRQ_AIRQ0_POSN                      equ 0000h
DMAnAIRQ_AIRQ0_POSITION                  equ 0000h
DMAnAIRQ_AIRQ0_SIZE                      equ 0001h
DMAnAIRQ_AIRQ0_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ0_MASK                      equ 0001h
DMAnAIRQ_AIRQ1_POSN                      equ 0001h
DMAnAIRQ_AIRQ1_POSITION                  equ 0001h
DMAnAIRQ_AIRQ1_SIZE                      equ 0001h
DMAnAIRQ_AIRQ1_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ1_MASK                      equ 0002h
DMAnAIRQ_AIRQ2_POSN                      equ 0002h
DMAnAIRQ_AIRQ2_POSITION                  equ 0002h
DMAnAIRQ_AIRQ2_SIZE                      equ 0001h
DMAnAIRQ_AIRQ2_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ2_MASK                      equ 0004h
DMAnAIRQ_AIRQ3_POSN                      equ 0003h
DMAnAIRQ_AIRQ3_POSITION                  equ 0003h
DMAnAIRQ_AIRQ3_SIZE                      equ 0001h
DMAnAIRQ_AIRQ3_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ3_MASK                      equ 0008h
DMAnAIRQ_AIRQ4_POSN                      equ 0004h
DMAnAIRQ_AIRQ4_POSITION                  equ 0004h
DMAnAIRQ_AIRQ4_SIZE                      equ 0001h
DMAnAIRQ_AIRQ4_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ4_MASK                      equ 0010h
DMAnAIRQ_AIRQ5_POSN                      equ 0005h
DMAnAIRQ_AIRQ5_POSITION                  equ 0005h
DMAnAIRQ_AIRQ5_SIZE                      equ 0001h
DMAnAIRQ_AIRQ5_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ5_MASK                      equ 0020h
DMAnAIRQ_AIRQ6_POSN                      equ 0006h
DMAnAIRQ_AIRQ6_POSITION                  equ 0006h
DMAnAIRQ_AIRQ6_SIZE                      equ 0001h
DMAnAIRQ_AIRQ6_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ6_MASK                      equ 0040h
DMAnAIRQ_AIRQ7_POSN                      equ 0007h
DMAnAIRQ_AIRQ7_POSITION                  equ 0007h
DMAnAIRQ_AIRQ7_SIZE                      equ 0001h
DMAnAIRQ_AIRQ7_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ7_MASK                      equ 0080h

// Register: DMAnSIRQ
#define DMAnSIRQ DMAnSIRQ
DMAnSIRQ                                 equ 0057h
// bitfield definitions
DMAnSIRQ_SIRQ_POSN                       equ 0000h
DMAnSIRQ_SIRQ_POSITION                   equ 0000h
DMAnSIRQ_SIRQ_SIZE                       equ 0008h
DMAnSIRQ_SIRQ_LENGTH                     equ 0008h
DMAnSIRQ_SIRQ_MASK                       equ 00FFh
DMAnSIRQ_SIRQ0_POSN                      equ 0000h
DMAnSIRQ_SIRQ0_POSITION                  equ 0000h
DMAnSIRQ_SIRQ0_SIZE                      equ 0001h
DMAnSIRQ_SIRQ0_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ0_MASK                      equ 0001h
DMAnSIRQ_SIRQ1_POSN                      equ 0001h
DMAnSIRQ_SIRQ1_POSITION                  equ 0001h
DMAnSIRQ_SIRQ1_SIZE                      equ 0001h
DMAnSIRQ_SIRQ1_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ1_MASK                      equ 0002h
DMAnSIRQ_SIRQ2_POSN                      equ 0002h
DMAnSIRQ_SIRQ2_POSITION                  equ 0002h
DMAnSIRQ_SIRQ2_SIZE                      equ 0001h
DMAnSIRQ_SIRQ2_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ2_MASK                      equ 0004h
DMAnSIRQ_SIRQ3_POSN                      equ 0003h
DMAnSIRQ_SIRQ3_POSITION                  equ 0003h
DMAnSIRQ_SIRQ3_SIZE                      equ 0001h
DMAnSIRQ_SIRQ3_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ3_MASK                      equ 0008h
DMAnSIRQ_SIRQ4_POSN                      equ 0004h
DMAnSIRQ_SIRQ4_POSITION                  equ 0004h
DMAnSIRQ_SIRQ4_SIZE                      equ 0001h
DMAnSIRQ_SIRQ4_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ4_MASK                      equ 0010h
DMAnSIRQ_SIRQ5_POSN                      equ 0005h
DMAnSIRQ_SIRQ5_POSITION                  equ 0005h
DMAnSIRQ_SIRQ5_SIZE                      equ 0001h
DMAnSIRQ_SIRQ5_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ5_MASK                      equ 0020h
DMAnSIRQ_SIRQ6_POSN                      equ 0006h
DMAnSIRQ_SIRQ6_POSITION                  equ 0006h
DMAnSIRQ_SIRQ6_SIZE                      equ 0001h
DMAnSIRQ_SIRQ6_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ6_MASK                      equ 0040h
DMAnSIRQ_SIRQ7_POSN                      equ 0007h
DMAnSIRQ_SIRQ7_POSITION                  equ 0007h
DMAnSIRQ_SIRQ7_SIZE                      equ 0001h
DMAnSIRQ_SIRQ7_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ7_MASK                      equ 0080h

// Register: NVMCON0
#define NVMCON0 NVMCON0
NVMCON0                                  equ 0058h
// bitfield definitions
NVMCON0_GO_POSN                          equ 0000h
NVMCON0_GO_POSITION                      equ 0000h
NVMCON0_GO_SIZE                          equ 0001h
NVMCON0_GO_LENGTH                        equ 0001h
NVMCON0_GO_MASK                          equ 0001h
NVMCON0_NOT_DONE_POSN                    equ 0000h
NVMCON0_NOT_DONE_POSITION                equ 0000h
NVMCON0_NOT_DONE_SIZE                    equ 0001h
NVMCON0_NOT_DONE_LENGTH                  equ 0001h
NVMCON0_NOT_DONE_MASK                    equ 0001h
NVMCON0_nDONE_POSN                       equ 0000h
NVMCON0_nDONE_POSITION                   equ 0000h
NVMCON0_nDONE_SIZE                       equ 0001h
NVMCON0_nDONE_LENGTH                     equ 0001h
NVMCON0_nDONE_MASK                       equ 0001h
NVMCON0_NVMGO_POSN                       equ 0000h
NVMCON0_NVMGO_POSITION                   equ 0000h
NVMCON0_NVMGO_SIZE                       equ 0001h
NVMCON0_NVMGO_LENGTH                     equ 0001h
NVMCON0_NVMGO_MASK                       equ 0001h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 0059h
// bitfield definitions
NVMCON1_CMD_POSN                         equ 0000h
NVMCON1_CMD_POSITION                     equ 0000h
NVMCON1_CMD_SIZE                         equ 0003h
NVMCON1_CMD_LENGTH                       equ 0003h
NVMCON1_CMD_MASK                         equ 0007h
NVMCON1_WRERR_POSN                       equ 0007h
NVMCON1_WRERR_POSITION                   equ 0007h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0080h
NVMCON1_NVMCMD_POSN                      equ 0000h
NVMCON1_NVMCMD_POSITION                  equ 0000h
NVMCON1_NVMCMD_SIZE                      equ 0003h
NVMCON1_NVMCMD_LENGTH                    equ 0003h
NVMCON1_NVMCMD_MASK                      equ 0007h

// Register: NVMLOCK
#define NVMLOCK NVMLOCK
NVMLOCK                                  equ 005Ah
// bitfield definitions
NVMLOCK_LOCK_POSN                        equ 0000h
NVMLOCK_LOCK_POSITION                    equ 0000h
NVMLOCK_LOCK_SIZE                        equ 0008h
NVMLOCK_LOCK_LENGTH                      equ 0008h
NVMLOCK_LOCK_MASK                        equ 00FFh
NVMLOCK_NVMLOCK_POSN                     equ 0000h
NVMLOCK_NVMLOCK_POSITION                 equ 0000h
NVMLOCK_NVMLOCK_SIZE                     equ 0008h
NVMLOCK_NVMLOCK_LENGTH                   equ 0008h
NVMLOCK_NVMLOCK_MASK                     equ 00FFh

// Register: NVMADR
#define NVMADR NVMADR
NVMADR                                   equ 005Bh

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 005Bh
// bitfield definitions
NVMADRL_NVMADRL_POSN                     equ 0000h
NVMADRL_NVMADRL_POSITION                 equ 0000h
NVMADRL_NVMADRL_SIZE                     equ 0008h
NVMADRL_NVMADRL_LENGTH                   equ 0008h
NVMADRL_NVMADRL_MASK                     equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

