garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: NVMADRH
#define NVMADRH NVMADRH
NVMADRH                                  equ 005Ch
// bitfield definitions
NVMADRH_NVMADRH_POSN                     equ 0000h
NVMADRH_NVMADRH_POSITION                 equ 0000h
NVMADRH_NVMADRH_SIZE                     equ 0008h
NVMADRH_NVMADRH_LENGTH                   equ 0008h
NVMADRH_NVMADRH_MASK                     equ 00FFh
NVMADRH_NVMADR8_POSN                     equ 0000h
NVMADRH_NVMADR8_POSITION                 equ 0000h
NVMADRH_NVMADR8_SIZE                     equ 0001h
NVMADRH_NVMADR8_LENGTH                   equ 0001h
NVMADRH_NVMADR8_MASK                     equ 0001h
NVMADRH_NVMADR9_POSN                     equ 0001h
NVMADRH_NVMADR9_POSITION                 equ 0001h
NVMADRH_NVMADR9_SIZE                     equ 0001h
NVMADRH_NVMADR9_LENGTH                   equ 0001h
NVMADRH_NVMADR9_MASK                     equ 0002h
NVMADRH_NVMADR10_POSN                    equ 0002h
NVMADRH_NVMADR10_POSITION                equ 0002h
NVMADRH_NVMADR10_SIZE                    equ 0001h
NVMADRH_NVMADR10_LENGTH                  equ 0001h
NVMADRH_NVMADR10_MASK                    equ 0004h
NVMADRH_NVMADR11_POSN                    equ 0003h
NVMADRH_NVMADR11_POSITION                equ 0003h
NVMADRH_NVMADR11_SIZE                    equ 0001h
NVMADRH_NVMADR11_LENGTH                  equ 0001h
NVMADRH_NVMADR11_MASK                    equ 0008h
NVMADRH_NVMADR12_POSN                    equ 0004h
NVMADRH_NVMADR12_POSITION                equ 0004h
NVMADRH_NVMADR12_SIZE                    equ 0001h
NVMADRH_NVMADR12_LENGTH                  equ 0001h
NVMADRH_NVMADR12_MASK                    equ 0010h
NVMADRH_NVMADR13_POSN                    equ 0005h
NVMADRH_NVMADR13_POSITION                equ 0005h
NVMADRH_NVMADR13_SIZE                    equ 0001h
NVMADRH_NVMADR13_LENGTH                  equ 0001h
NVMADRH_NVMADR13_MASK                    equ 0020h
NVMADRH_NVMADR14_POSN                    equ 0006h
NVMADRH_NVMADR14_POSITION                equ 0006h
NVMADRH_NVMADR14_SIZE                    equ 0001h
NVMADRH_NVMADR14_LENGTH                  equ 0001h
NVMADRH_NVMADR14_MASK                    equ 0040h
NVMADRH_NVMADR15_POSN                    equ 0007h
NVMADRH_NVMADR15_POSITION                equ 0007h
NVMADRH_NVMADR15_SIZE                    equ 0001h
NVMADRH_NVMADR15_LENGTH                  equ 0001h
NVMADRH_NVMADR15_MASK                    equ 0080h

// Register: NVMADRU
#define NVMADRU NVMADRU
NVMADRU                                  equ 005Dh
// bitfield definitions
NVMADRU_NVMADRU_POSN                     equ 0000h
NVMADRU_NVMADRU_POSITION                 equ 0000h
NVMADRU_NVMADRU_SIZE                     equ 0006h
NVMADRU_NVMADRU_LENGTH                   equ 0006h
NVMADRU_NVMADRU_MASK                     equ 003Fh
NVMADRU_NVMADR16_POSN                    equ 0000h
NVMADRU_NVMADR16_POSITION                equ 0000h
NVMADRU_NVMADR16_SIZE                    equ 0001h
NVMADRU_NVMADR16_LENGTH                  equ 0001h
NVMADRU_NVMADR16_MASK                    equ 0001h
NVMADRU_NVMADR17_POSN                    equ 0001h
NVMADRU_NVMADR17_POSITION                equ 0001h
NVMADRU_NVMADR17_SIZE                    equ 0001h
NVMADRU_NVMADR17_LENGTH                  equ 0001h
NVMADRU_NVMADR17_MASK                    equ 0002h
NVMADRU_NVMADR18_POSN                    equ 0002h
NVMADRU_NVMADR18_POSITION                equ 0002h
NVMADRU_NVMADR18_SIZE                    equ 0001h
NVMADRU_NVMADR18_LENGTH                  equ 0001h
NVMADRU_NVMADR18_MASK                    equ 0004h
NVMADRU_NVMADR19_POSN                    equ 0003h
NVMADRU_NVMADR19_POSITION                equ 0003h
NVMADRU_NVMADR19_SIZE                    equ 0001h
NVMADRU_NVMADR19_LENGTH                  equ 0001h
NVMADRU_NVMADR19_MASK                    equ 0008h
NVMADRU_NVMADR20_POSN                    equ 0004h
NVMADRU_NVMADR20_POSITION                equ 0004h
NVMADRU_NVMADR20_SIZE                    equ 0001h
NVMADRU_NVMADR20_LENGTH                  equ 0001h
NVMADRU_NVMADR20_MASK                    equ 0010h
NVMADRU_NVMADR21_POSN                    equ 0005h
NVMADRU_NVMADR21_POSITION                equ 0005h
NVMADRU_NVMADR21_SIZE                    equ 0001h
NVMADRU_NVMADR21_LENGTH                  equ 0001h
NVMADRU_NVMADR21_MASK                    equ 0020h

// Register: NVMDAT
#define NVMDAT NVMDAT
NVMDAT                                   equ 005Eh

// Register: NVMDATL
#define NVMDATL NVMDATL
NVMDATL                                  equ 005Eh
// bitfield definitions
NVMDATL_NVMDATL_POSN                     equ 0000h
NVMDATL_NVMDATL_POSITION                 equ 0000h
NVMDATL_NVMDATL_SIZE                     equ 0008h
NVMDATL_NVMDATL_LENGTH                   equ 0008h
NVMDATL_NVMDATL_MASK                     equ 00FFh
NVMDATL_NVMDAT0_POSN                     equ 0000h
NVMDATL_NVMDAT0_POSITION                 equ 0000h
NVMDATL_NVMDAT0_SIZE                     equ 0001h
NVMDATL_NVMDAT0_LENGTH                   equ 0001h
NVMDATL_NVMDAT0_MASK                     equ 0001h
NVMDATL_NVMDAT1_POSN                     equ 0001h
NVMDATL_NVMDAT1_POSITION                 equ 0001h
NVMDATL_NVMDAT1_SIZE                     equ 0001h
NVMDATL_NVMDAT1_LENGTH                   equ 0001h
NVMDATL_NVMDAT1_MASK                     equ 0002h
NVMDATL_NVMDAT2_POSN                     equ 0002h
NVMDATL_NVMDAT2_POSITION                 equ 0002h
NVMDATL_NVMDAT2_SIZE                     equ 0001h
NVMDATL_NVMDAT2_LENGTH                   equ 0001h
NVMDATL_NVMDAT2_MASK                     equ 0004h
NVMDATL_NVMDAT3_POSN                     equ 0003h
NVMDATL_NVMDAT3_POSITION                 equ 0003h
NVMDATL_NVMDAT3_SIZE                     equ 0001h
NVMDATL_NVMDAT3_LENGTH                   equ 0001h
NVMDATL_NVMDAT3_MASK                     equ 0008h
NVMDATL_NVMDAT4_POSN                     equ 0004h
NVMDATL_NVMDAT4_POSITION                 equ 0004h
NVMDATL_NVMDAT4_SIZE                     equ 0001h
NVMDATL_NVMDAT4_LENGTH                   equ 0001h
NVMDATL_NVMDAT4_MASK                     equ 0010h
NVMDATL_NVMDAT5_POSN                     equ 0005h
NVMDATL_NVMDAT5_POSITION                 equ 0005h
NVMDATL_NVMDAT5_SIZE                     equ 0001h
NVMDATL_NVMDAT5_LENGTH                   equ 0001h
NVMDATL_NVMDAT5_MASK                     equ 0020h
NVMDATL_NVMDAT6_POSN                     equ 0006h
NVMDATL_NVMDAT6_POSITION                 equ 0006h
NVMDATL_NVMDAT6_SIZE                     equ 0001h
NVMDATL_NVMDAT6_LENGTH                   equ 0001h
NVMDATL_NVMDAT6_MASK                     equ 0040h
NVMDATL_NVMDAT7_POSN                     equ 0007h
NVMDATL_NVMDAT7_POSITION                 equ 0007h
NVMDATL_NVMDAT7_SIZE                     equ 0001h
NVMDATL_NVMDAT7_LENGTH                   equ 0001h
NVMDATL_NVMDAT7_MASK                     equ 0080h

// Register: NVMDATH
#define NVMDATH NVMDATH
NVMDATH                                  equ 005Fh
// bitfield definitions
NVMDATH_NVMDATH_POSN                     equ 0000h
NVMDATH_NVMDATH_POSITION                 equ 0000h
NVMDATH_NVMDATH_SIZE                     equ 0008h
NVMDATH_NVMDATH_LENGTH                   equ 0008h
NVMDATH_NVMDATH_MASK                     equ 00FFh
NVMDATH_NVMDAT8_POSN                     equ 0000h
NVMDATH_NVMDAT8_POSITION                 equ 0000h
NVMDATH_NVMDAT8_SIZE                     equ 0001h
NVMDATH_NVMDAT8_LENGTH                   equ 0001h
NVMDATH_NVMDAT8_MASK                     equ 0001h
NVMDATH_NVMDAT9_POSN                     equ 0001h
NVMDATH_NVMDAT9_POSITION                 equ 0001h
NVMDATH_NVMDAT9_SIZE                     equ 0001h
NVMDATH_NVMDAT9_LENGTH                   equ 0001h
NVMDATH_NVMDAT9_MASK                     equ 0002h
NVMDATH_NVMDAT10_POSN                    equ 0002h
NVMDATH_NVMDAT10_POSITION                equ 0002h
NVMDATH_NVMDAT10_SIZE                    equ 0001h
NVMDATH_NVMDAT10_LENGTH                  equ 0001h
NVMDATH_NVMDAT10_MASK                    equ 0004h
NVMDATH_NVMDAT11_POSN                    equ 0003h
NVMDATH_NVMDAT11_POSITION                equ 0003h
NVMDATH_NVMDAT11_SIZE                    equ 0001h
NVMDATH_NVMDAT11_LENGTH                  equ 0001h
NVMDATH_NVMDAT11_MASK                    equ 0008h
NVMDATH_NVMDAT12_POSN                    equ 0004h
NVMDATH_NVMDAT12_POSITION                equ 0004h
NVMDATH_NVMDAT12_SIZE                    equ 0001h
NVMDATH_NVMDAT12_LENGTH                  equ 0001h
NVMDATH_NVMDAT12_MASK                    equ 0010h
NVMDATH_NVMDAT13_POSN                    equ 0005h
NVMDATH_NVMDAT13_POSITION                equ 0005h
NVMDATH_NVMDAT13_SIZE                    equ 0001h
NVMDATH_NVMDAT13_LENGTH                  equ 0001h
NVMDATH_NVMDAT13_MASK                    equ 0020h
NVMDATH_NVMDAT14_POSN                    equ 0006h
NVMDATH_NVMDAT14_POSITION                equ 0006h
NVMDATH_NVMDAT14_SIZE                    equ 0001h
NVMDATH_NVMDAT14_LENGTH                  equ 0001h
NVMDATH_NVMDAT14_MASK                    equ 0040h
NVMDATH_NVMDAT15_POSN                    equ 0007h
NVMDATH_NVMDAT15_POSITION                equ 0007h
NVMDATH_NVMDAT15_SIZE                    equ 0001h
NVMDATH_NVMDAT15_LENGTH                  equ 0001h
NVMDATH_NVMDAT15_MASK                    equ 0080h

