garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: SCANHADR
#define SCANHADR SCANHADR
SCANHADR                                 equ 006Eh

// Register: SCANHADRL
#define SCANHADRL SCANHADRL
SCANHADRL                                equ 006Eh
// bitfield definitions
SCANHADRL_HADR_POSN                      equ 0000h
SCANHADRL_HADR_POSITION                  equ 0000h
SCANHADRL_HADR_SIZE                      equ 0008h
SCANHADRL_HADR_LENGTH                    equ 0008h
SCANHADRL_HADR_MASK                      equ 00FFh
SCANHADRL_HADR0_POSN                     equ 0000h
SCANHADRL_HADR0_POSITION                 equ 0000h
SCANHADRL_HADR0_SIZE                     equ 0001h
SCANHADRL_HADR0_LENGTH                   equ 0001h
SCANHADRL_HADR0_MASK                     equ 0001h
SCANHADRL_HADR1_POSN                     equ 0001h
SCANHADRL_HADR1_POSITION                 equ 0001h
SCANHADRL_HADR1_SIZE                     equ 0001h
SCANHADRL_HADR1_LENGTH                   equ 0001h
SCANHADRL_HADR1_MASK                     equ 0002h
SCANHADRL_HADR2_POSN                     equ 0002h
SCANHADRL_HADR2_POSITION                 equ 0002h
SCANHADRL_HADR2_SIZE                     equ 0001h
SCANHADRL_HADR2_LENGTH                   equ 0001h
SCANHADRL_HADR2_MASK                     equ 0004h
SCANHADRL_HADR3_POSN                     equ 0003h
SCANHADRL_HADR3_POSITION                 equ 0003h
SCANHADRL_HADR3_SIZE                     equ 0001h
SCANHADRL_HADR3_LENGTH                   equ 0001h
SCANHADRL_HADR3_MASK                     equ 0008h
SCANHADRL_HADR4_POSN                     equ 0004h
SCANHADRL_HADR4_POSITION                 equ 0004h
SCANHADRL_HADR4_SIZE                     equ 0001h
SCANHADRL_HADR4_LENGTH                   equ 0001h
SCANHADRL_HADR4_MASK                     equ 0010h
SCANHADRL_HADR5_POSN                     equ 0005h
SCANHADRL_HADR5_POSITION                 equ 0005h
SCANHADRL_HADR5_SIZE                     equ 0001h
SCANHADRL_HADR5_LENGTH                   equ 0001h
SCANHADRL_HADR5_MASK                     equ 0020h
SCANHADRL_HADR6_POSN                     equ 0006h
SCANHADRL_HADR6_POSITION                 equ 0006h
SCANHADRL_HADR6_SIZE                     equ 0001h
SCANHADRL_HADR6_LENGTH                   equ 0001h
SCANHADRL_HADR6_MASK                     equ 0040h
SCANHADRL_HADR7_POSN                     equ 0007h
SCANHADRL_HADR7_POSITION                 equ 0007h
SCANHADRL_HADR7_SIZE                     equ 0001h
SCANHADRL_HADR7_LENGTH                   equ 0001h
SCANHADRL_HADR7_MASK                     equ 0080h
SCANHADRL_SCANHADR_POSN                  equ 0000h
SCANHADRL_SCANHADR_POSITION              equ 0000h
SCANHADRL_SCANHADR_SIZE                  equ 0008h
SCANHADRL_SCANHADR_LENGTH                equ 0008h
SCANHADRL_SCANHADR_MASK                  equ 00FFh
SCANHADRL_SCANHADR0_POSN                 equ 0000h
SCANHADRL_SCANHADR0_POSITION             equ 0000h
SCANHADRL_SCANHADR0_SIZE                 equ 0001h
SCANHADRL_SCANHADR0_LENGTH               equ 0001h
SCANHADRL_SCANHADR0_MASK                 equ 0001h
SCANHADRL_SCANHADR1_POSN                 equ 0001h
SCANHADRL_SCANHADR1_POSITION             equ 0001h
SCANHADRL_SCANHADR1_SIZE                 equ 0001h
SCANHADRL_SCANHADR1_LENGTH               equ 0001h
SCANHADRL_SCANHADR1_MASK                 equ 0002h
SCANHADRL_SCANHADR2_POSN                 equ 0002h
SCANHADRL_SCANHADR2_POSITION             equ 0002h
SCANHADRL_SCANHADR2_SIZE                 equ 0001h
SCANHADRL_SCANHADR2_LENGTH               equ 0001h
SCANHADRL_SCANHADR2_MASK                 equ 0004h
SCANHADRL_SCANHADR3_POSN                 equ 0003h
SCANHADRL_SCANHADR3_POSITION             equ 0003h
SCANHADRL_SCANHADR3_SIZE                 equ 0001h
SCANHADRL_SCANHADR3_LENGTH               equ 0001h
SCANHADRL_SCANHADR3_MASK                 equ 0008h
SCANHADRL_SCANHADR4_POSN                 equ 0004h
SCANHADRL_SCANHADR4_POSITION             equ 0004h
SCANHADRL_SCANHADR4_SIZE                 equ 0001h
SCANHADRL_SCANHADR4_LENGTH               equ 0001h
SCANHADRL_SCANHADR4_MASK                 equ 0010h
SCANHADRL_SCANHADR5_POSN                 equ 0005h
SCANHADRL_SCANHADR5_POSITION             equ 0005h
SCANHADRL_SCANHADR5_SIZE                 equ 0001h
SCANHADRL_SCANHADR5_LENGTH               equ 0001h
SCANHADRL_SCANHADR5_MASK                 equ 0020h
SCANHADRL_SCANHADR6_POSN                 equ 0006h
SCANHADRL_SCANHADR6_POSITION             equ 0006h
SCANHADRL_SCANHADR6_SIZE                 equ 0001h
SCANHADRL_SCANHADR6_LENGTH               equ 0001h
SCANHADRL_SCANHADR6_MASK                 equ 0040h
SCANHADRL_SCANHADR7_POSN                 equ 0007h
SCANHADRL_SCANHADR7_POSITION             equ 0007h
SCANHADRL_SCANHADR7_SIZE                 equ 0001h
SCANHADRL_SCANHADR7_LENGTH               equ 0001h
SCANHADRL_SCANHADR7_MASK                 equ 0080h

// Register: SCANHADRH
#define SCANHADRH SCANHADRH
SCANHADRH                                equ 006Fh
// bitfield definitions
SCANHADRH_HADR_POSN                      equ 0000h
SCANHADRH_HADR_POSITION                  equ 0000h
SCANHADRH_HADR_SIZE                      equ 0008h
SCANHADRH_HADR_LENGTH                    equ 0008h
SCANHADRH_HADR_MASK                      equ 00FFh
SCANHADRH_HADR8_POSN                     equ 0000h
SCANHADRH_HADR8_POSITION                 equ 0000h
SCANHADRH_HADR8_SIZE                     equ 0001h
SCANHADRH_HADR8_LENGTH                   equ 0001h
SCANHADRH_HADR8_MASK                     equ 0001h
SCANHADRH_HADR9_POSN                     equ 0001h
SCANHADRH_HADR9_POSITION                 equ 0001h
SCANHADRH_HADR9_SIZE                     equ 0001h
SCANHADRH_HADR9_LENGTH                   equ 0001h
SCANHADRH_HADR9_MASK                     equ 0002h
SCANHADRH_HADR10_POSN                    equ 0002h
SCANHADRH_HADR10_POSITION                equ 0002h
SCANHADRH_HADR10_SIZE                    equ 0001h
SCANHADRH_HADR10_LENGTH                  equ 0001h
SCANHADRH_HADR10_MASK                    equ 0004h
SCANHADRH_HADR11_POSN                    equ 0003h
SCANHADRH_HADR11_POSITION                equ 0003h
SCANHADRH_HADR11_SIZE                    equ 0001h
SCANHADRH_HADR11_LENGTH                  equ 0001h
SCANHADRH_HADR11_MASK                    equ 0008h
SCANHADRH_HADR12_POSN                    equ 0004h
SCANHADRH_HADR12_POSITION                equ 0004h
SCANHADRH_HADR12_SIZE                    equ 0001h
SCANHADRH_HADR12_LENGTH                  equ 0001h
SCANHADRH_HADR12_MASK                    equ 0010h
SCANHADRH_HADR13_POSN                    equ 0005h
SCANHADRH_HADR13_POSITION                equ 0005h
SCANHADRH_HADR13_SIZE                    equ 0001h
SCANHADRH_HADR13_LENGTH                  equ 0001h
SCANHADRH_HADR13_MASK                    equ 0020h
SCANHADRH_HADR14_POSN                    equ 0006h
SCANHADRH_HADR14_POSITION                equ 0006h
SCANHADRH_HADR14_SIZE                    equ 0001h
SCANHADRH_HADR14_LENGTH                  equ 0001h
SCANHADRH_HADR14_MASK                    equ 0040h
SCANHADRH_HADR15_POSN                    equ 0007h
SCANHADRH_HADR15_POSITION                equ 0007h
SCANHADRH_HADR15_SIZE                    equ 0001h
SCANHADRH_HADR15_LENGTH                  equ 0001h
SCANHADRH_HADR15_MASK                    equ 0080h
SCANHADRH_SCANHADR_POSN                  equ 0000h
SCANHADRH_SCANHADR_POSITION              equ 0000h
SCANHADRH_SCANHADR_SIZE                  equ 0008h
SCANHADRH_SCANHADR_LENGTH                equ 0008h
SCANHADRH_SCANHADR_MASK                  equ 00FFh
SCANHADRH_SCANHADR8_POSN                 equ 0000h
SCANHADRH_SCANHADR8_POSITION             equ 0000h
SCANHADRH_SCANHADR8_SIZE                 equ 0001h
SCANHADRH_SCANHADR8_LENGTH               equ 0001h
SCANHADRH_SCANHADR8_MASK                 equ 0001h
SCANHADRH_SCANHADR9_POSN                 equ 0001h
SCANHADRH_SCANHADR9_POSITION             equ 0001h
SCANHADRH_SCANHADR9_SIZE                 equ 0001h
SCANHADRH_SCANHADR9_LENGTH               equ 0001h
SCANHADRH_SCANHADR9_MASK                 equ 0002h
SCANHADRH_SCANHADR10_POSN                equ 0002h
SCANHADRH_SCANHADR10_POSITION            equ 0002h
SCANHADRH_SCANHADR10_SIZE                equ 0001h
SCANHADRH_SCANHADR10_LENGTH              equ 0001h
SCANHADRH_SCANHADR10_MASK                equ 0004h
SCANHADRH_SCANHADR11_POSN                equ 0003h
SCANHADRH_SCANHADR11_POSITION            equ 0003h
SCANHADRH_SCANHADR11_SIZE                equ 0001h
SCANHADRH_SCANHADR11_LENGTH              equ 0001h
SCANHADRH_SCANHADR11_MASK                equ 0008h
SCANHADRH_SCANHADR12_POSN                equ 0004h
SCANHADRH_SCANHADR12_POSITION            equ 0004h
SCANHADRH_SCANHADR12_SIZE                equ 0001h
SCANHADRH_SCANHADR12_LENGTH              equ 0001h
SCANHADRH_SCANHADR12_MASK                equ 0010h
SCANHADRH_SCANHADR13_POSN                equ 0005h
SCANHADRH_SCANHADR13_POSITION            equ 0005h
SCANHADRH_SCANHADR13_SIZE                equ 0001h
SCANHADRH_SCANHADR13_LENGTH              equ 0001h
SCANHADRH_SCANHADR13_MASK                equ 0020h
SCANHADRH_SCANHADR14_POSN                equ 0006h
SCANHADRH_SCANHADR14_POSITION            equ 0006h
SCANHADRH_SCANHADR14_SIZE                equ 0001h
SCANHADRH_SCANHADR14_LENGTH              equ 0001h
SCANHADRH_SCANHADR14_MASK                equ 0040h
SCANHADRH_SCANHADR15_POSN                equ 0007h
SCANHADRH_SCANHADR15_POSITION            equ 0007h
SCANHADRH_SCANHADR15_SIZE                equ 0001h
SCANHADRH_SCANHADR15_LENGTH              equ 0001h
SCANHADRH_SCANHADR15_MASK                equ 0080h

// Register: SCANHADRU
#define SCANHADRU SCANHADRU
SCANHADRU                                equ 0070h
// bitfield definitions
SCANHADRU_HADR_POSN                      equ 0000h
SCANHADRU_HADR_POSITION                  equ 0000h
SCANHADRU_HADR_SIZE                      equ 0006h
SCANHADRU_HADR_LENGTH                    equ 0006h
SCANHADRU_HADR_MASK                      equ 003Fh
SCANHADRU_HADR16_POSN                    equ 0000h
SCANHADRU_HADR16_POSITION                equ 0000h
SCANHADRU_HADR16_SIZE                    equ 0001h
SCANHADRU_HADR16_LENGTH                  equ 0001h
SCANHADRU_HADR16_MASK                    equ 0001h
SCANHADRU_HADR17_POSN                    equ 0001h
SCANHADRU_HADR17_POSITION                equ 0001h
SCANHADRU_HADR17_SIZE                    equ 0001h
SCANHADRU_HADR17_LENGTH                  equ 0001h
SCANHADRU_HADR17_MASK                    equ 0002h
SCANHADRU_HADR18_POSN                    equ 0002h
SCANHADRU_HADR18_POSITION                equ 0002h
SCANHADRU_HADR18_SIZE                    equ 0001h
SCANHADRU_HADR18_LENGTH                  equ 0001h
SCANHADRU_HADR18_MASK                    equ 0004h
SCANHADRU_HADR19_POSN                    equ 0003h
SCANHADRU_HADR19_POSITION                equ 0003h
SCANHADRU_HADR19_SIZE                    equ 0001h
SCANHADRU_HADR19_LENGTH                  equ 0001h
SCANHADRU_HADR19_MASK                    equ 0008h
SCANHADRU_HADR20_POSN                    equ 0004h
SCANHADRU_HADR20_POSITION                equ 0004h
SCANHADRU_HADR20_SIZE                    equ 0001h
SCANHADRU_HADR20_LENGTH                  equ 0001h
SCANHADRU_HADR20_MASK                    equ 0010h
SCANHADRU_HADR21_POSN                    equ 0005h
SCANHADRU_HADR21_POSITION                equ 0005h
SCANHADRU_HADR21_SIZE                    equ 0001h
SCANHADRU_HADR21_LENGTH                  equ 0001h
SCANHADRU_HADR21_MASK                    equ 0020h
SCANHADRU_SCANHADR_POSN                  equ 0000h
SCANHADRU_SCANHADR_POSITION              equ 0000h
SCANHADRU_SCANHADR_SIZE                  equ 0006h
SCANHADRU_SCANHADR_LENGTH                equ 0006h
SCANHADRU_SCANHADR_MASK                  equ 003Fh
SCANHADRU_SCANHADR16_POSN                equ 0000h
SCANHADRU_SCANHADR16_POSITION            equ 0000h
SCANHADRU_SCANHADR16_SIZE                equ 0001h
SCANHADRU_SCANHADR16_LENGTH              equ 0001h
SCANHADRU_SCANHADR16_MASK                equ 0001h
SCANHADRU_SCANHADR17_POSN                equ 0001h
SCANHADRU_SCANHADR17_POSITION            equ 0001h
SCANHADRU_SCANHADR17_SIZE                equ 0001h
SCANHADRU_SCANHADR17_LENGTH              equ 0001h
SCANHADRU_SCANHADR17_MASK                equ 0002h
SCANHADRU_SCANHADR18_POSN                equ 0002h
SCANHADRU_SCANHADR18_POSITION            equ 0002h
SCANHADRU_SCANHADR18_SIZE                equ 0001h
SCANHADRU_SCANHADR18_LENGTH              equ 0001h
SCANHADRU_SCANHADR18_MASK                equ 0004h
SCANHADRU_SCANHADR19_POSN                equ 0003h
SCANHADRU_SCANHADR19_POSITION            equ 0003h
SCANHADRU_SCANHADR19_SIZE                equ 0001h
SCANHADRU_SCANHADR19_LENGTH              equ 0001h
SCANHADRU_SCANHADR19_MASK                equ 0008h
SCANHADRU_SCANHADR20_POSN                equ 0004h
SCANHADRU_SCANHADR20_POSITION            equ 0004h
SCANHADRU_SCANHADR20_SIZE                equ 0001h
SCANHADRU_SCANHADR20_LENGTH              equ 0001h
SCANHADRU_SCANHADR20_MASK                equ 0010h
SCANHADRU_SCANHADR21_POSN                equ 0005h
SCANHADRU_SCANHADR21_POSITION            equ 0005h
SCANHADRU_SCANHADR21_SIZE                equ 0001h
SCANHADRU_SCANHADR21_LENGTH              equ 0001h
SCANHADRU_SCANHADR21_MASK                equ 0020h

// Register: SCANCON0
#define SCANCON0 SCANCON0
SCANCON0                                 equ 0071h
// bitfield definitions
SCANCON0_BUSY_POSN                       equ 0000h
SCANCON0_BUSY_POSITION                   equ 0000h
SCANCON0_BUSY_SIZE                       equ 0001h
SCANCON0_BUSY_LENGTH                     equ 0001h
SCANCON0_BUSY_MASK                       equ 0001h
SCANCON0_BURSTMD_POSN                    equ 0001h
SCANCON0_BURSTMD_POSITION                equ 0001h
SCANCON0_BURSTMD_SIZE                    equ 0001h
SCANCON0_BURSTMD_LENGTH                  equ 0001h
SCANCON0_BURSTMD_MASK                    equ 0002h
SCANCON0_MREG_POSN                       equ 0002h
SCANCON0_MREG_POSITION                   equ 0002h
SCANCON0_MREG_SIZE                       equ 0001h
SCANCON0_MREG_LENGTH                     equ 0001h
SCANCON0_MREG_MASK                       equ 0004h
SCANCON0_SGO_POSN                        equ 0005h
SCANCON0_SGO_POSITION                    equ 0005h
SCANCON0_SGO_SIZE                        equ 0001h
SCANCON0_SGO_LENGTH                      equ 0001h
SCANCON0_SGO_MASK                        equ 0020h
SCANCON0_TRIGEN_POSN                     equ 0006h
SCANCON0_TRIGEN_POSITION                 equ 0006h
SCANCON0_TRIGEN_SIZE                     equ 0001h
SCANCON0_TRIGEN_LENGTH                   equ 0001h
SCANCON0_TRIGEN_MASK                     equ 0040h
SCANCON0_EN_POSN                         equ 0007h
SCANCON0_EN_POSITION                     equ 0007h
SCANCON0_EN_SIZE                         equ 0001h
SCANCON0_EN_LENGTH                       equ 0001h
SCANCON0_EN_MASK                         equ 0080h
SCANCON0_SCANEN_POSN                     equ 0007h
SCANCON0_SCANEN_POSITION                 equ 0007h
SCANCON0_SCANEN_SIZE                     equ 0001h
SCANCON0_SCANEN_LENGTH                   equ 0001h
SCANCON0_SCANEN_MASK                     equ 0080h

