garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: I3C1PID4
#define I3C1PID4 I3C1PID4
I3C1PID4                                 equ 00A6h
// bitfield definitions
I3C1PID4_PID32_POSN                      equ 0000h
I3C1PID4_PID32_POSITION                  equ 0000h
I3C1PID4_PID32_SIZE                      equ 0001h
I3C1PID4_PID32_LENGTH                    equ 0001h
I3C1PID4_PID32_MASK                      equ 0001h
I3C1PID4_PID33_POSN                      equ 0001h
I3C1PID4_PID33_POSITION                  equ 0001h
I3C1PID4_PID33_SIZE                      equ 0001h
I3C1PID4_PID33_LENGTH                    equ 0001h
I3C1PID4_PID33_MASK                      equ 0002h
I3C1PID4_PID34_POSN                      equ 0002h
I3C1PID4_PID34_POSITION                  equ 0002h
I3C1PID4_PID34_SIZE                      equ 0001h
I3C1PID4_PID34_LENGTH                    equ 0001h
I3C1PID4_PID34_MASK                      equ 0004h
I3C1PID4_PID35_POSN                      equ 0003h
I3C1PID4_PID35_POSITION                  equ 0003h
I3C1PID4_PID35_SIZE                      equ 0001h
I3C1PID4_PID35_LENGTH                    equ 0001h
I3C1PID4_PID35_MASK                      equ 0008h
I3C1PID4_PID36_POSN                      equ 0004h
I3C1PID4_PID36_POSITION                  equ 0004h
I3C1PID4_PID36_SIZE                      equ 0001h
I3C1PID4_PID36_LENGTH                    equ 0001h
I3C1PID4_PID36_MASK                      equ 0010h
I3C1PID4_PID37_POSN                      equ 0005h
I3C1PID4_PID37_POSITION                  equ 0005h
I3C1PID4_PID37_SIZE                      equ 0001h
I3C1PID4_PID37_LENGTH                    equ 0001h
I3C1PID4_PID37_MASK                      equ 0020h
I3C1PID4_PID38_POSN                      equ 0006h
I3C1PID4_PID38_POSITION                  equ 0006h
I3C1PID4_PID38_SIZE                      equ 0001h
I3C1PID4_PID38_LENGTH                    equ 0001h
I3C1PID4_PID38_MASK                      equ 0040h
I3C1PID4_PID39_POSN                      equ 0007h
I3C1PID4_PID39_POSITION                  equ 0007h
I3C1PID4_PID39_SIZE                      equ 0001h
I3C1PID4_PID39_LENGTH                    equ 0001h
I3C1PID4_PID39_MASK                      equ 0080h
I3C1PID4_PID_39_33_POSN                  equ 0001h
I3C1PID4_PID_39_33_POSITION              equ 0001h
I3C1PID4_PID_39_33_SIZE                  equ 0007h
I3C1PID4_PID_39_33_LENGTH                equ 0007h
I3C1PID4_PID_39_33_MASK                  equ 00FEh

// Register: I3C1PID5
#define I3C1PID5 I3C1PID5
I3C1PID5                                 equ 00A7h
// bitfield definitions
I3C1PID5_PID40_POSN                      equ 0000h
I3C1PID5_PID40_POSITION                  equ 0000h
I3C1PID5_PID40_SIZE                      equ 0001h
I3C1PID5_PID40_LENGTH                    equ 0001h
I3C1PID5_PID40_MASK                      equ 0001h
I3C1PID5_PID41_POSN                      equ 0001h
I3C1PID5_PID41_POSITION                  equ 0001h
I3C1PID5_PID41_SIZE                      equ 0001h
I3C1PID5_PID41_LENGTH                    equ 0001h
I3C1PID5_PID41_MASK                      equ 0002h
I3C1PID5_PID42_POSN                      equ 0002h
I3C1PID5_PID42_POSITION                  equ 0002h
I3C1PID5_PID42_SIZE                      equ 0001h
I3C1PID5_PID42_LENGTH                    equ 0001h
I3C1PID5_PID42_MASK                      equ 0004h
I3C1PID5_PID43_POSN                      equ 0003h
I3C1PID5_PID43_POSITION                  equ 0003h
I3C1PID5_PID43_SIZE                      equ 0001h
I3C1PID5_PID43_LENGTH                    equ 0001h
I3C1PID5_PID43_MASK                      equ 0008h
I3C1PID5_PID44_POSN                      equ 0004h
I3C1PID5_PID44_POSITION                  equ 0004h
I3C1PID5_PID44_SIZE                      equ 0001h
I3C1PID5_PID44_LENGTH                    equ 0001h
I3C1PID5_PID44_MASK                      equ 0010h
I3C1PID5_PID45_POSN                      equ 0005h
I3C1PID5_PID45_POSITION                  equ 0005h
I3C1PID5_PID45_SIZE                      equ 0001h
I3C1PID5_PID45_LENGTH                    equ 0001h
I3C1PID5_PID45_MASK                      equ 0020h
I3C1PID5_PID46_POSN                      equ 0006h
I3C1PID5_PID46_POSITION                  equ 0006h
I3C1PID5_PID46_SIZE                      equ 0001h
I3C1PID5_PID46_LENGTH                    equ 0001h
I3C1PID5_PID46_MASK                      equ 0040h
I3C1PID5_PID47_POSN                      equ 0007h
I3C1PID5_PID47_POSITION                  equ 0007h
I3C1PID5_PID47_SIZE                      equ 0001h
I3C1PID5_PID47_LENGTH                    equ 0001h
I3C1PID5_PID47_MASK                      equ 0080h
I3C1PID5_PID_47_40_POSN                  equ 0000h
I3C1PID5_PID_47_40_POSITION              equ 0000h
I3C1PID5_PID_47_40_SIZE                  equ 0008h
I3C1PID5_PID_47_40_LENGTH                equ 0008h
I3C1PID5_PID_47_40_MASK                  equ 00FFh

// Register: I3C1BCR
#define I3C1BCR I3C1BCR
I3C1BCR                                  equ 00A8h
// bitfield definitions
I3C1BCR_BCR0_POSN                        equ 0000h
I3C1BCR_BCR0_POSITION                    equ 0000h
I3C1BCR_BCR0_SIZE                        equ 0001h
I3C1BCR_BCR0_LENGTH                      equ 0001h
I3C1BCR_BCR0_MASK                        equ 0001h
I3C1BCR_BCR1_POSN                        equ 0001h
I3C1BCR_BCR1_POSITION                    equ 0001h
I3C1BCR_BCR1_SIZE                        equ 0001h
I3C1BCR_BCR1_LENGTH                      equ 0001h
I3C1BCR_BCR1_MASK                        equ 0002h
I3C1BCR_BCR2_POSN                        equ 0002h
I3C1BCR_BCR2_POSITION                    equ 0002h
I3C1BCR_BCR2_SIZE                        equ 0001h
I3C1BCR_BCR2_LENGTH                      equ 0001h
I3C1BCR_BCR2_MASK                        equ 0004h
I3C1BCR_BCR3_POSN                        equ 0003h
I3C1BCR_BCR3_POSITION                    equ 0003h
I3C1BCR_BCR3_SIZE                        equ 0001h
I3C1BCR_BCR3_LENGTH                      equ 0001h
I3C1BCR_BCR3_MASK                        equ 0008h
I3C1BCR_BCR4_POSN                        equ 0004h
I3C1BCR_BCR4_POSITION                    equ 0004h
I3C1BCR_BCR4_SIZE                        equ 0001h
I3C1BCR_BCR4_LENGTH                      equ 0001h
I3C1BCR_BCR4_MASK                        equ 0010h
I3C1BCR_BCR5_POSN                        equ 0005h
I3C1BCR_BCR5_POSITION                    equ 0005h
I3C1BCR_BCR5_SIZE                        equ 0001h
I3C1BCR_BCR5_LENGTH                      equ 0001h
I3C1BCR_BCR5_MASK                        equ 0020h
I3C1BCR_BCR6_POSN                        equ 0006h
I3C1BCR_BCR6_POSITION                    equ 0006h
I3C1BCR_BCR6_SIZE                        equ 0001h
I3C1BCR_BCR6_LENGTH                      equ 0001h
I3C1BCR_BCR6_MASK                        equ 0040h
I3C1BCR_BCR7_POSN                        equ 0007h
I3C1BCR_BCR7_POSITION                    equ 0007h
I3C1BCR_BCR7_SIZE                        equ 0001h
I3C1BCR_BCR7_LENGTH                      equ 0001h
I3C1BCR_BCR7_MASK                        equ 0080h
I3C1BCR_BCR_7_6_POSN                     equ 0006h
I3C1BCR_BCR_7_6_POSITION                 equ 0006h
I3C1BCR_BCR_7_6_SIZE                     equ 0002h
I3C1BCR_BCR_7_6_LENGTH                   equ 0002h
I3C1BCR_BCR_7_6_MASK                     equ 00C0h

