garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: I3C2TXB
#define I3C2TXB I3C2TXB
I3C2TXB                                  equ 00B9h
// bitfield definitions
I3C2TXB_TXB_POSN                         equ 0000h
I3C2TXB_TXB_POSITION                     equ 0000h
I3C2TXB_TXB_SIZE                         equ 0008h
I3C2TXB_TXB_LENGTH                       equ 0008h
I3C2TXB_TXB_MASK                         equ 00FFh

// Register: I3C2STAT0
#define I3C2STAT0 I3C2STAT0
I3C2STAT0                                equ 00BAh
// bitfield definitions
I3C2STAT0_RNW_POSN                       equ 0000h
I3C2STAT0_RNW_POSITION                   equ 0000h
I3C2STAT0_RNW_SIZE                       equ 0002h
I3C2STAT0_RNW_LENGTH                     equ 0002h
I3C2STAT0_RNW_MASK                       equ 0003h
I3C2STAT0_RXBF_POSN                      equ 0002h
I3C2STAT0_RXBF_POSITION                  equ 0002h
I3C2STAT0_RXBF_SIZE                      equ 0001h
I3C2STAT0_RXBF_LENGTH                    equ 0001h
I3C2STAT0_RXBF_MASK                      equ 0004h
I3C2STAT0_TXBE_POSN                      equ 0003h
I3C2STAT0_TXBE_POSITION                  equ 0003h
I3C2STAT0_TXBE_SIZE                      equ 0001h
I3C2STAT0_TXBE_LENGTH                    equ 0001h
I3C2STAT0_TXBE_MASK                      equ 0008h
I3C2STAT0_RSTDET_POSN                    equ 0004h
I3C2STAT0_RSTDET_POSITION                equ 0004h
I3C2STAT0_RSTDET_SIZE                    equ 0001h
I3C2STAT0_RSTDET_LENGTH                  equ 0001h
I3C2STAT0_RSTDET_MASK                    equ 0010h
I3C2STAT0_OPMD_POSN                      equ 0005h
I3C2STAT0_OPMD_POSITION                  equ 0005h
I3C2STAT0_OPMD_SIZE                      equ 0002h
I3C2STAT0_OPMD_LENGTH                    equ 0002h
I3C2STAT0_OPMD_MASK                      equ 0060h
I3C2STAT0_BFREE_POSN                     equ 0007h
I3C2STAT0_BFREE_POSITION                 equ 0007h
I3C2STAT0_BFREE_SIZE                     equ 0001h
I3C2STAT0_BFREE_LENGTH                   equ 0001h
I3C2STAT0_BFREE_MASK                     equ 0080h

// Register: I3C2STAT1
#define I3C2STAT1 I3C2STAT1
I3C2STAT1                                equ 00BBh
// bitfield definitions
I3C2STAT1_TXFNE_POSN                     equ 0000h
I3C2STAT1_TXFNE_POSITION                 equ 0000h
I3C2STAT1_TXFNE_SIZE                     equ 0001h
I3C2STAT1_TXFNE_LENGTH                   equ 0001h
I3C2STAT1_TXFNE_MASK                     equ 0001h

// Register: I3C2BSTAT
#define I3C2BSTAT I3C2BSTAT
I3C2BSTAT                                equ 00BCh
// bitfield definitions
I3C2BSTAT_TE0ERR_POSN                    equ 0000h
I3C2BSTAT_TE0ERR_POSITION                equ 0000h
I3C2BSTAT_TE0ERR_SIZE                    equ 0001h
I3C2BSTAT_TE0ERR_LENGTH                  equ 0001h
I3C2BSTAT_TE0ERR_MASK                    equ 0001h
I3C2BSTAT_TE1ERR_POSN                    equ 0001h
I3C2BSTAT_TE1ERR_POSITION                equ 0001h
I3C2BSTAT_TE1ERR_SIZE                    equ 0001h
I3C2BSTAT_TE1ERR_LENGTH                  equ 0001h
I3C2BSTAT_TE1ERR_MASK                    equ 0002h
I3C2BSTAT_TE2ERR_POSN                    equ 0002h
I3C2BSTAT_TE2ERR_POSITION                equ 0002h
I3C2BSTAT_TE2ERR_SIZE                    equ 0001h
I3C2BSTAT_TE2ERR_LENGTH                  equ 0001h
I3C2BSTAT_TE2ERR_MASK                    equ 0004h
I3C2BSTAT_TE3ERR_POSN                    equ 0003h
I3C2BSTAT_TE3ERR_POSITION                equ 0003h
I3C2BSTAT_TE3ERR_SIZE                    equ 0001h
I3C2BSTAT_TE3ERR_LENGTH                  equ 0001h
I3C2BSTAT_TE3ERR_MASK                    equ 0008h
I3C2BSTAT_TE4ERR_POSN                    equ 0004h
I3C2BSTAT_TE4ERR_POSITION                equ 0004h
I3C2BSTAT_TE4ERR_SIZE                    equ 0001h
I3C2BSTAT_TE4ERR_LENGTH                  equ 0001h
I3C2BSTAT_TE4ERR_MASK                    equ 0010h
I3C2BSTAT_TE5ERR_POSN                    equ 0005h
I3C2BSTAT_TE5ERR_POSITION                equ 0005h
I3C2BSTAT_TE5ERR_SIZE                    equ 0001h
I3C2BSTAT_TE5ERR_LENGTH                  equ 0001h
I3C2BSTAT_TE5ERR_MASK                    equ 0020h
I3C2BSTAT_TE6ERR_POSN                    equ 0006h
I3C2BSTAT_TE6ERR_POSITION                equ 0006h
I3C2BSTAT_TE6ERR_SIZE                    equ 0001h
I3C2BSTAT_TE6ERR_LENGTH                  equ 0001h
I3C2BSTAT_TE6ERR_MASK                    equ 0040h

// Register: I3C2PIR0
#define I3C2PIR0 I3C2PIR0
I3C2PIR0                                 equ 00BDh
// bitfield definitions
I3C2PIR0_SCCCIF_POSN                     equ 0000h
I3C2PIR0_SCCCIF_POSITION                 equ 0000h
I3C2PIR0_SCCCIF_SIZE                     equ 0001h
I3C2PIR0_SCCCIF_LENGTH                   equ 0001h
I3C2PIR0_SCCCIF_MASK                     equ 0001h
I3C2PIR0_BTFIF_POSN                      equ 0001h
I3C2PIR0_BTFIF_POSITION                  equ 0001h
I3C2PIR0_BTFIF_SIZE                      equ 0001h
I3C2PIR0_BTFIF_LENGTH                    equ 0001h
I3C2PIR0_BTFIF_MASK                      equ 0002h
I3C2PIR0_DADRIF_POSN                     equ 0002h
I3C2PIR0_DADRIF_POSITION                 equ 0002h
I3C2PIR0_DADRIF_SIZE                     equ 0001h
I3C2PIR0_DADRIF_LENGTH                   equ 0001h
I3C2PIR0_DADRIF_MASK                     equ 0004h
I3C2PIR0_SADRIF_POSN                     equ 0003h
I3C2PIR0_SADRIF_POSITION                 equ 0003h
I3C2PIR0_SADRIF_SIZE                     equ 0001h
I3C2PIR0_SADRIF_LENGTH                   equ 0001h
I3C2PIR0_SADRIF_MASK                     equ 0008h
I3C2PIR0_I2CACKIF_POSN                   equ 0004h
I3C2PIR0_I2CACKIF_POSITION               equ 0004h
I3C2PIR0_I2CACKIF_SIZE                   equ 0001h
I3C2PIR0_I2CACKIF_LENGTH                 equ 0001h
I3C2PIR0_I2CACKIF_MASK                   equ 0010h
I3C2PIR0_RSCIF_POSN                      equ 0005h
I3C2PIR0_RSCIF_POSITION                  equ 0005h
I3C2PIR0_RSCIF_SIZE                      equ 0001h
I3C2PIR0_RSCIF_LENGTH                    equ 0001h
I3C2PIR0_RSCIF_MASK                      equ 0020h
I3C2PIR0_PCIF_POSN                       equ 0006h
I3C2PIR0_PCIF_POSITION                   equ 0006h
I3C2PIR0_PCIF_SIZE                       equ 0001h
I3C2PIR0_PCIF_LENGTH                     equ 0001h
I3C2PIR0_PCIF_MASK                       equ 0040h
I3C2PIR0_SCIF_POSN                       equ 0007h
I3C2PIR0_SCIF_POSITION                   equ 0007h
I3C2PIR0_SCIF_SIZE                       equ 0001h
I3C2PIR0_SCIF_LENGTH                     equ 0001h
I3C2PIR0_SCIF_MASK                       equ 0080h

