garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: I3C2ERRIE1
#define I3C2ERRIE1 I3C2ERRIE1
I3C2ERRIE1                               equ 00C4h
// bitfield definitions
I3C2ERRIE1_RXREIE_POSN                   equ 0000h
I3C2ERRIE1_RXREIE_POSITION               equ 0000h
I3C2ERRIE1_RXREIE_SIZE                   equ 0001h
I3C2ERRIE1_RXREIE_LENGTH                 equ 0001h
I3C2ERRIE1_RXREIE_MASK                   equ 0001h
I3C2ERRIE1_TXWEIE_POSN                   equ 0001h
I3C2ERRIE1_TXWEIE_POSITION               equ 0001h
I3C2ERRIE1_TXWEIE_SIZE                   equ 0001h
I3C2ERRIE1_TXWEIE_LENGTH                 equ 0001h
I3C2ERRIE1_TXWEIE_MASK                   equ 0002h
I3C2ERRIE1_MWLOEIE_POSN                  equ 0002h
I3C2ERRIE1_MWLOEIE_POSITION              equ 0002h
I3C2ERRIE1_MWLOEIE_SIZE                  equ 0001h
I3C2ERRIE1_MWLOEIE_LENGTH                equ 0001h
I3C2ERRIE1_MWLOEIE_MASK                  equ 0004h
I3C2ERRIE1_ABEIE_POSN                    equ 0003h
I3C2ERRIE1_ABEIE_POSITION                equ 0003h
I3C2ERRIE1_ABEIE_SIZE                    equ 0001h
I3C2ERRIE1_ABEIE_LENGTH                  equ 0001h
I3C2ERRIE1_ABEIE_MASK                    equ 0008h

// Register: I3C2BIDL
#define I3C2BIDL I3C2BIDL
I3C2BIDL                                 equ 00C5h

// Register: I3C2BIDLL
#define I3C2BIDLL I3C2BIDLL
I3C2BIDLL                                equ 00C5h
// bitfield definitions
I3C2BIDLL_BIDLL_POSN                     equ 0000h
I3C2BIDLL_BIDLL_POSITION                 equ 0000h
I3C2BIDLL_BIDLL_SIZE                     equ 0008h
I3C2BIDLL_BIDLL_LENGTH                   equ 0008h
I3C2BIDLL_BIDLL_MASK                     equ 00FFh

// Register: I3C2BIDLH
#define I3C2BIDLH I3C2BIDLH
I3C2BIDLH                                equ 00C6h
// bitfield definitions
I3C2BIDLH_BIDLH_POSN                     equ 0000h
I3C2BIDLH_BIDLH_POSITION                 equ 0000h
I3C2BIDLH_BIDLH_SIZE                     equ 0008h
I3C2BIDLH_BIDLH_LENGTH                   equ 0008h
I3C2BIDLH_BIDLH_MASK                     equ 00FFh

// Register: I3C2BAVL
#define I3C2BAVL I3C2BAVL
I3C2BAVL                                 equ 00C7h
// bitfield definitions
I3C2BAVL_BAVL_POSN                       equ 0000h
I3C2BAVL_BAVL_POSITION                   equ 0000h
I3C2BAVL_BAVL_SIZE                       equ 0008h
I3C2BAVL_BAVL_LENGTH                     equ 0008h
I3C2BAVL_BAVL_MASK                       equ 00FFh

// Register: I3C2BTO
#define I3C2BTO I3C2BTO
I3C2BTO                                  equ 00C8h

// Register: I3C2BTOL
#define I3C2BTOL I3C2BTOL
I3C2BTOL                                 equ 00C8h
// bitfield definitions
I3C2BTOL_BTOL_POSN                       equ 0000h
I3C2BTOL_BTOL_POSITION                   equ 0000h
I3C2BTOL_BTOL_SIZE                       equ 0008h
I3C2BTOL_BTOL_LENGTH                     equ 0008h
I3C2BTOL_BTOL_MASK                       equ 00FFh

// Register: I3C2BTOH
#define I3C2BTOH I3C2BTOH
I3C2BTOH                                 equ 00C9h
// bitfield definitions
I3C2BTOH_BTOH_POSN                       equ 0000h
I3C2BTOH_BTOH_POSITION                   equ 0000h
I3C2BTOH_BTOH_SIZE                       equ 0008h
I3C2BTOH_BTOH_LENGTH                     equ 0008h
I3C2BTOH_BTOH_MASK                       equ 00FFh

// Register: I3C2IBIMDB
#define I3C2IBIMDB I3C2IBIMDB
I3C2IBIMDB                               equ 00CAh
// bitfield definitions
I3C2IBIMDB_IBIMDB_POSN                   equ 0000h
I3C2IBIMDB_IBIMDB_POSITION               equ 0000h
I3C2IBIMDB_IBIMDB_SIZE                   equ 0008h
I3C2IBIMDB_IBIMDB_LENGTH                 equ 0008h
I3C2IBIMDB_IBIMDB_MASK                   equ 00FFh
I3C2IBIMDB_IBIMDB_4_0_POSN               equ 0000h
I3C2IBIMDB_IBIMDB_4_0_POSITION           equ 0000h
I3C2IBIMDB_IBIMDB_4_0_SIZE               equ 0005h
I3C2IBIMDB_IBIMDB_4_0_LENGTH             equ 0005h
I3C2IBIMDB_IBIMDB_4_0_MASK               equ 001Fh
I3C2IBIMDB_IBIMDB_7_5_POSN               equ 0005h
I3C2IBIMDB_IBIMDB_7_5_POSITION           equ 0005h
I3C2IBIMDB_IBIMDB_7_5_SIZE               equ 0003h
I3C2IBIMDB_IBIMDB_7_5_LENGTH             equ 0003h
I3C2IBIMDB_IBIMDB_7_5_MASK               equ 00E0h

// Register: I3C2RETRY
#define I3C2RETRY I3C2RETRY
I3C2RETRY                                equ 00CBh
// bitfield definitions
I3C2RETRY_RETRY_POSN                     equ 0000h
I3C2RETRY_RETRY_POSITION                 equ 0000h
I3C2RETRY_RETRY_SIZE                     equ 0008h
I3C2RETRY_RETRY_LENGTH                   equ 0008h
I3C2RETRY_RETRY_MASK                     equ 00FFh

// Register: I3C2FEAT
#define I3C2FEAT I3C2FEAT
I3C2FEAT                                 equ 00CCh
// bitfield definitions
I3C2FEAT_HJCAP_POSN                      equ 0000h
I3C2FEAT_HJCAP_POSITION                  equ 0000h
I3C2FEAT_HJCAP_SIZE                      equ 0001h
I3C2FEAT_HJCAP_LENGTH                    equ 0001h
I3C2FEAT_HJCAP_MASK                      equ 0001h
I3C2FEAT_HDRCAP_POSN                     equ 0001h
I3C2FEAT_HDRCAP_POSITION                 equ 0001h
I3C2FEAT_HDRCAP_SIZE                     equ 0001h
I3C2FEAT_HDRCAP_LENGTH                   equ 0001h
I3C2FEAT_HDRCAP_MASK                     equ 0002h

// Register: I3C2SADR
#define I3C2SADR I3C2SADR
I3C2SADR                                 equ 00CDh
// bitfield definitions
I3C2SADR_SADR_POSN                       equ 0000h
I3C2SADR_SADR_POSITION                   equ 0000h
I3C2SADR_SADR_SIZE                       equ 0007h
I3C2SADR_SADR_LENGTH                     equ 0007h
I3C2SADR_SADR_MASK                       equ 007Fh

// Register: I3C2DADR
#define I3C2DADR I3C2DADR
I3C2DADR                                 equ 00CEh
// bitfield definitions
I3C2DADR_DADR_POSN                       equ 0000h
I3C2DADR_DADR_POSITION                   equ 0000h
I3C2DADR_DADR_SIZE                       equ 0007h
I3C2DADR_DADR_LENGTH                     equ 0007h
I3C2DADR_DADR_MASK                       equ 007Fh

// Register: I3C2EC
#define I3C2EC I3C2EC
I3C2EC                                   equ 00CFh
// bitfield definitions
I3C2EC_IBIEN_POSN                        equ 0000h
I3C2EC_IBIEN_POSITION                    equ 0000h
I3C2EC_IBIEN_SIZE                        equ 0001h
I3C2EC_IBIEN_LENGTH                      equ 0001h
I3C2EC_IBIEN_MASK                        equ 0001h
I3C2EC_CREN_POSN                         equ 0001h
I3C2EC_CREN_POSITION                     equ 0001h
I3C2EC_CREN_SIZE                         equ 0001h
I3C2EC_CREN_LENGTH                       equ 0001h
I3C2EC_CREN_MASK                         equ 0002h
I3C2EC_EC2_POSN                          equ 0002h
I3C2EC_EC2_POSITION                      equ 0002h
I3C2EC_EC2_SIZE                          equ 0001h
I3C2EC_EC2_LENGTH                        equ 0001h
I3C2EC_EC2_MASK                          equ 0004h
I3C2EC_HJEN_POSN                         equ 0003h
I3C2EC_HJEN_POSITION                     equ 0003h
I3C2EC_HJEN_SIZE                         equ 0001h
I3C2EC_HJEN_LENGTH                       equ 0001h
I3C2EC_HJEN_MASK                         equ 0008h
I3C2EC_EC_7_4_POSN                       equ 0004h
I3C2EC_EC_7_4_POSITION                   equ 0004h
I3C2EC_EC_7_4_SIZE                       equ 0004h
I3C2EC_EC_7_4_LENGTH                     equ 0004h
I3C2EC_EC_7_4_MASK                       equ 00F0h

// Register: I3C2MWL
#define I3C2MWL I3C2MWL
I3C2MWL                                  equ 00D0h

// Register: I3C2MWLL
#define I3C2MWLL I3C2MWLL
I3C2MWLL                                 equ 00D0h
// bitfield definitions
I3C2MWLL_MWLL_POSN                       equ 0000h
I3C2MWLL_MWLL_POSITION                   equ 0000h
I3C2MWLL_MWLL_SIZE                       equ 0008h
I3C2MWLL_MWLL_LENGTH                     equ 0008h
I3C2MWLL_MWLL_MASK                       equ 00FFh

// Register: I3C2MWLH
#define I3C2MWLH I3C2MWLH
I3C2MWLH                                 equ 00D1h
// bitfield definitions
I3C2MWLH_MWLH_POSN                       equ 0000h
I3C2MWLH_MWLH_POSITION                   equ 0000h
I3C2MWLH_MWLH_SIZE                       equ 0008h
I3C2MWLH_MWLH_LENGTH                     equ 0008h
I3C2MWLH_MWLH_MASK                       equ 00FFh

// Register: I3C2MRL
#define I3C2MRL I3C2MRL
I3C2MRL                                  equ 00D2h

// Register: I3C2MRLL
#define I3C2MRLL I3C2MRLL
I3C2MRLL                                 equ 00D2h
// bitfield definitions
I3C2MRLL_MRLL_POSN                       equ 0000h
I3C2MRLL_MRLL_POSITION                   equ 0000h
I3C2MRLL_MRLL_SIZE                       equ 0008h
I3C2MRLL_MRLL_LENGTH                     equ 0008h
I3C2MRLL_MRLL_MASK                       equ 00FFh

