garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: TU16BHLT
#define TU16BHLT TU16BHLT
TU16BHLT                                 equ 013Ch
// bitfield definitions
TU16BHLT_STOP_POSN                       equ 0000h
TU16BHLT_STOP_POSITION                   equ 0000h
TU16BHLT_STOP_SIZE                       equ 0002h
TU16BHLT_STOP_LENGTH                     equ 0002h
TU16BHLT_STOP_MASK                       equ 0003h
TU16BHLT_RESET_POSN                      equ 0002h
TU16BHLT_RESET_POSITION                  equ 0002h
TU16BHLT_RESET_SIZE                      equ 0002h
TU16BHLT_RESET_LENGTH                    equ 0002h
TU16BHLT_RESET_MASK                      equ 000Ch
TU16BHLT_START_POSN                      equ 0004h
TU16BHLT_START_POSITION                  equ 0004h
TU16BHLT_START_SIZE                      equ 0002h
TU16BHLT_START_LENGTH                    equ 0002h
TU16BHLT_START_MASK                      equ 0030h
TU16BHLT_CSYNC_POSN                      equ 0006h
TU16BHLT_CSYNC_POSITION                  equ 0006h
TU16BHLT_CSYNC_SIZE                      equ 0001h
TU16BHLT_CSYNC_LENGTH                    equ 0001h
TU16BHLT_CSYNC_MASK                      equ 0040h
TU16BHLT_EPOL_POSN                       equ 0007h
TU16BHLT_EPOL_POSITION                   equ 0007h
TU16BHLT_EPOL_SIZE                       equ 0001h
TU16BHLT_EPOL_LENGTH                     equ 0001h
TU16BHLT_EPOL_MASK                       equ 0080h
TU16BHLT_STOP0_POSN                      equ 0000h
TU16BHLT_STOP0_POSITION                  equ 0000h
TU16BHLT_STOP0_SIZE                      equ 0001h
TU16BHLT_STOP0_LENGTH                    equ 0001h
TU16BHLT_STOP0_MASK                      equ 0001h
TU16BHLT_STOP1_POSN                      equ 0001h
TU16BHLT_STOP1_POSITION                  equ 0001h
TU16BHLT_STOP1_SIZE                      equ 0001h
TU16BHLT_STOP1_LENGTH                    equ 0001h
TU16BHLT_STOP1_MASK                      equ 0002h
TU16BHLT_RESET0_POSN                     equ 0002h
TU16BHLT_RESET0_POSITION                 equ 0002h
TU16BHLT_RESET0_SIZE                     equ 0001h
TU16BHLT_RESET0_LENGTH                   equ 0001h
TU16BHLT_RESET0_MASK                     equ 0004h
TU16BHLT_RESET1_POSN                     equ 0003h
TU16BHLT_RESET1_POSITION                 equ 0003h
TU16BHLT_RESET1_SIZE                     equ 0001h
TU16BHLT_RESET1_LENGTH                   equ 0001h
TU16BHLT_RESET1_MASK                     equ 0008h
TU16BHLT_START0_POSN                     equ 0004h
TU16BHLT_START0_POSITION                 equ 0004h
TU16BHLT_START0_SIZE                     equ 0001h
TU16BHLT_START0_LENGTH                   equ 0001h
TU16BHLT_START0_MASK                     equ 0010h
TU16BHLT_START1_POSN                     equ 0005h
TU16BHLT_START1_POSITION                 equ 0005h
TU16BHLT_START1_SIZE                     equ 0001h
TU16BHLT_START1_LENGTH                   equ 0001h
TU16BHLT_START1_MASK                     equ 0020h
TU16BHLT_TU16BSTOP_POSN                  equ 0000h
TU16BHLT_TU16BSTOP_POSITION              equ 0000h
TU16BHLT_TU16BSTOP_SIZE                  equ 0002h
TU16BHLT_TU16BSTOP_LENGTH                equ 0002h
TU16BHLT_TU16BSTOP_MASK                  equ 0003h
TU16BHLT_TU16BRESET_POSN                 equ 0002h
TU16BHLT_TU16BRESET_POSITION             equ 0002h
TU16BHLT_TU16BRESET_SIZE                 equ 0002h
TU16BHLT_TU16BRESET_LENGTH               equ 0002h
TU16BHLT_TU16BRESET_MASK                 equ 000Ch
TU16BHLT_TU16BSTART_POSN                 equ 0004h
TU16BHLT_TU16BSTART_POSITION             equ 0004h
TU16BHLT_TU16BSTART_SIZE                 equ 0002h
TU16BHLT_TU16BSTART_LENGTH               equ 0002h
TU16BHLT_TU16BSTART_MASK                 equ 0030h
TU16BHLT_TU16BCSYNC_POSN                 equ 0006h
TU16BHLT_TU16BCSYNC_POSITION             equ 0006h
TU16BHLT_TU16BCSYNC_SIZE                 equ 0001h
TU16BHLT_TU16BCSYNC_LENGTH               equ 0001h
TU16BHLT_TU16BCSYNC_MASK                 equ 0040h
TU16BHLT_TU16BEPOL_POSN                  equ 0007h
TU16BHLT_TU16BEPOL_POSITION              equ 0007h
TU16BHLT_TU16BEPOL_SIZE                  equ 0001h
TU16BHLT_TU16BEPOL_LENGTH                equ 0001h
TU16BHLT_TU16BEPOL_MASK                  equ 0080h
TU16BHLT_TU16BSTOP0_POSN                 equ 0000h
TU16BHLT_TU16BSTOP0_POSITION             equ 0000h
TU16BHLT_TU16BSTOP0_SIZE                 equ 0001h
TU16BHLT_TU16BSTOP0_LENGTH               equ 0001h
TU16BHLT_TU16BSTOP0_MASK                 equ 0001h
TU16BHLT_TU16BSTOP1_POSN                 equ 0001h
TU16BHLT_TU16BSTOP1_POSITION             equ 0001h
TU16BHLT_TU16BSTOP1_SIZE                 equ 0001h
TU16BHLT_TU16BSTOP1_LENGTH               equ 0001h
TU16BHLT_TU16BSTOP1_MASK                 equ 0002h
TU16BHLT_TU16BRESET0_POSN                equ 0002h
TU16BHLT_TU16BRESET0_POSITION            equ 0002h
TU16BHLT_TU16BRESET0_SIZE                equ 0001h
TU16BHLT_TU16BRESET0_LENGTH              equ 0001h
TU16BHLT_TU16BRESET0_MASK                equ 0004h
TU16BHLT_TU16BRESET1_POSN                equ 0003h
TU16BHLT_TU16BRESET1_POSITION            equ 0003h
TU16BHLT_TU16BRESET1_SIZE                equ 0001h
TU16BHLT_TU16BRESET1_LENGTH              equ 0001h
TU16BHLT_TU16BRESET1_MASK                equ 0008h
TU16BHLT_TU16BSTART0_POSN                equ 0004h
TU16BHLT_TU16BSTART0_POSITION            equ 0004h
TU16BHLT_TU16BSTART0_SIZE                equ 0001h
TU16BHLT_TU16BSTART0_LENGTH              equ 0001h
TU16BHLT_TU16BSTART0_MASK                equ 0010h
TU16BHLT_TU16BSTART1_POSN                equ 0005h
TU16BHLT_TU16BSTART1_POSITION            equ 0005h
TU16BHLT_TU16BSTART1_SIZE                equ 0001h
TU16BHLT_TU16BSTART1_LENGTH              equ 0001h
TU16BHLT_TU16BSTART1_MASK                equ 0020h

// Register: TU16BPS
#define TU16BPS TU16BPS
TU16BPS                                  equ 013Dh
// bitfield definitions
TU16BPS_PS_POSN                          equ 0000h
TU16BPS_PS_POSITION                      equ 0000h
TU16BPS_PS_SIZE                          equ 0008h
TU16BPS_PS_LENGTH                        equ 0008h
TU16BPS_PS_MASK                          equ 00FFh
TU16BPS_PS0_POSN                         equ 0000h
TU16BPS_PS0_POSITION                     equ 0000h
TU16BPS_PS0_SIZE                         equ 0001h
TU16BPS_PS0_LENGTH                       equ 0001h
TU16BPS_PS0_MASK                         equ 0001h
TU16BPS_PS1_POSN                         equ 0001h
TU16BPS_PS1_POSITION                     equ 0001h
TU16BPS_PS1_SIZE                         equ 0001h
TU16BPS_PS1_LENGTH                       equ 0001h
TU16BPS_PS1_MASK                         equ 0002h
TU16BPS_PS2_POSN                         equ 0002h
TU16BPS_PS2_POSITION                     equ 0002h
TU16BPS_PS2_SIZE                         equ 0001h
TU16BPS_PS2_LENGTH                       equ 0001h
TU16BPS_PS2_MASK                         equ 0004h
TU16BPS_PS3_POSN                         equ 0003h
TU16BPS_PS3_POSITION                     equ 0003h
TU16BPS_PS3_SIZE                         equ 0001h
TU16BPS_PS3_LENGTH                       equ 0001h
TU16BPS_PS3_MASK                         equ 0008h
TU16BPS_PS4_POSN                         equ 0004h
TU16BPS_PS4_POSITION                     equ 0004h
TU16BPS_PS4_SIZE                         equ 0001h
TU16BPS_PS4_LENGTH                       equ 0001h
TU16BPS_PS4_MASK                         equ 0010h
TU16BPS_PS5_POSN                         equ 0005h
TU16BPS_PS5_POSITION                     equ 0005h
TU16BPS_PS5_SIZE                         equ 0001h
TU16BPS_PS5_LENGTH                       equ 0001h
TU16BPS_PS5_MASK                         equ 0020h
TU16BPS_PS6_POSN                         equ 0006h
TU16BPS_PS6_POSITION                     equ 0006h
TU16BPS_PS6_SIZE                         equ 0001h
TU16BPS_PS6_LENGTH                       equ 0001h
TU16BPS_PS6_MASK                         equ 0040h
TU16BPS_PS7_POSN                         equ 0007h
TU16BPS_PS7_POSITION                     equ 0007h
TU16BPS_PS7_SIZE                         equ 0001h
TU16BPS_PS7_LENGTH                       equ 0001h
TU16BPS_PS7_MASK                         equ 0080h
TU16BPS_TU16BPS0_POSN                    equ 0000h
TU16BPS_TU16BPS0_POSITION                equ 0000h
TU16BPS_TU16BPS0_SIZE                    equ 0001h
TU16BPS_TU16BPS0_LENGTH                  equ 0001h
TU16BPS_TU16BPS0_MASK                    equ 0001h
TU16BPS_TU16BPS1_POSN                    equ 0001h
TU16BPS_TU16BPS1_POSITION                equ 0001h
TU16BPS_TU16BPS1_SIZE                    equ 0001h
TU16BPS_TU16BPS1_LENGTH                  equ 0001h
TU16BPS_TU16BPS1_MASK                    equ 0002h
TU16BPS_TU16BPS2_POSN                    equ 0002h
TU16BPS_TU16BPS2_POSITION                equ 0002h
TU16BPS_TU16BPS2_SIZE                    equ 0001h
TU16BPS_TU16BPS2_LENGTH                  equ 0001h
TU16BPS_TU16BPS2_MASK                    equ 0004h
TU16BPS_TU16BPS3_POSN                    equ 0003h
TU16BPS_TU16BPS3_POSITION                equ 0003h
TU16BPS_TU16BPS3_SIZE                    equ 0001h
TU16BPS_TU16BPS3_LENGTH                  equ 0001h
TU16BPS_TU16BPS3_MASK                    equ 0008h
TU16BPS_TU16BPS4_POSN                    equ 0004h
TU16BPS_TU16BPS4_POSITION                equ 0004h
TU16BPS_TU16BPS4_SIZE                    equ 0001h
TU16BPS_TU16BPS4_LENGTH                  equ 0001h
TU16BPS_TU16BPS4_MASK                    equ 0010h
TU16BPS_TU16BPS5_POSN                    equ 0005h
TU16BPS_TU16BPS5_POSITION                equ 0005h
TU16BPS_TU16BPS5_SIZE                    equ 0001h
TU16BPS_TU16BPS5_LENGTH                  equ 0001h
TU16BPS_TU16BPS5_MASK                    equ 0020h
TU16BPS_TU16BPS6_POSN                    equ 0006h
TU16BPS_TU16BPS6_POSITION                equ 0006h
TU16BPS_TU16BPS6_SIZE                    equ 0001h
TU16BPS_TU16BPS6_LENGTH                  equ 0001h
TU16BPS_TU16BPS6_MASK                    equ 0040h
TU16BPS_TU16BPS7_POSN                    equ 0007h
TU16BPS_TU16BPS7_POSITION                equ 0007h
TU16BPS_TU16BPS7_SIZE                    equ 0001h
TU16BPS_TU16BPS7_LENGTH                  equ 0001h
TU16BPS_TU16BPS7_MASK                    equ 0080h
TU16BPS_TU16BPS_POSN                     equ 0000h
TU16BPS_TU16BPS_POSITION                 equ 0000h
TU16BPS_TU16BPS_SIZE                     equ 0008h
TU16BPS_TU16BPS_LENGTH                   equ 0008h
TU16BPS_TU16BPS_MASK                     equ 00FFh

