garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: TU16BTMRT
#define TU16BTMRT TU16BTMRT
TU16BTMRT                                equ 0141h
// bitfield definitions
TU16BTMRT_TMRT_POSN                      equ 0000h
TU16BTMRT_TMRT_POSITION                  equ 0000h
TU16BTMRT_TMRT_SIZE                      equ 0008h
TU16BTMRT_TMRT_LENGTH                    equ 0008h
TU16BTMRT_TMRT_MASK                      equ 00FFh
TU16BTMRT_TMRT0_POSN                     equ 0000h
TU16BTMRT_TMRT0_POSITION                 equ 0000h
TU16BTMRT_TMRT0_SIZE                     equ 0001h
TU16BTMRT_TMRT0_LENGTH                   equ 0001h
TU16BTMRT_TMRT0_MASK                     equ 0001h
TU16BTMRT_TMRT1_POSN                     equ 0001h
TU16BTMRT_TMRT1_POSITION                 equ 0001h
TU16BTMRT_TMRT1_SIZE                     equ 0001h
TU16BTMRT_TMRT1_LENGTH                   equ 0001h
TU16BTMRT_TMRT1_MASK                     equ 0002h
TU16BTMRT_TMRT2_POSN                     equ 0002h
TU16BTMRT_TMRT2_POSITION                 equ 0002h
TU16BTMRT_TMRT2_SIZE                     equ 0001h
TU16BTMRT_TMRT2_LENGTH                   equ 0001h
TU16BTMRT_TMRT2_MASK                     equ 0004h
TU16BTMRT_TMRT3_POSN                     equ 0003h
TU16BTMRT_TMRT3_POSITION                 equ 0003h
TU16BTMRT_TMRT3_SIZE                     equ 0001h
TU16BTMRT_TMRT3_LENGTH                   equ 0001h
TU16BTMRT_TMRT3_MASK                     equ 0008h
TU16BTMRT_TMRT4_POSN                     equ 0004h
TU16BTMRT_TMRT4_POSITION                 equ 0004h
TU16BTMRT_TMRT4_SIZE                     equ 0001h
TU16BTMRT_TMRT4_LENGTH                   equ 0001h
TU16BTMRT_TMRT4_MASK                     equ 0010h
TU16BTMRT_TMRT5_POSN                     equ 0005h
TU16BTMRT_TMRT5_POSITION                 equ 0005h
TU16BTMRT_TMRT5_SIZE                     equ 0001h
TU16BTMRT_TMRT5_LENGTH                   equ 0001h
TU16BTMRT_TMRT5_MASK                     equ 0020h
TU16BTMRT_TMRT6_POSN                     equ 0006h
TU16BTMRT_TMRT6_POSITION                 equ 0006h
TU16BTMRT_TMRT6_SIZE                     equ 0001h
TU16BTMRT_TMRT6_LENGTH                   equ 0001h
TU16BTMRT_TMRT6_MASK                     equ 0040h
TU16BTMRT_TMRT7_POSN                     equ 0007h
TU16BTMRT_TMRT7_POSITION                 equ 0007h
TU16BTMRT_TMRT7_SIZE                     equ 0001h
TU16BTMRT_TMRT7_LENGTH                   equ 0001h
TU16BTMRT_TMRT7_MASK                     equ 0080h
TU16BTMRT_TU16BTMRT0_POSN                equ 0000h
TU16BTMRT_TU16BTMRT0_POSITION            equ 0000h
TU16BTMRT_TU16BTMRT0_SIZE                equ 0001h
TU16BTMRT_TU16BTMRT0_LENGTH              equ 0001h
TU16BTMRT_TU16BTMRT0_MASK                equ 0001h
TU16BTMRT_TU16BTMRT1_POSN                equ 0001h
TU16BTMRT_TU16BTMRT1_POSITION            equ 0001h
TU16BTMRT_TU16BTMRT1_SIZE                equ 0001h
TU16BTMRT_TU16BTMRT1_LENGTH              equ 0001h
TU16BTMRT_TU16BTMRT1_MASK                equ 0002h
TU16BTMRT_TU16BTMRT2_POSN                equ 0002h
TU16BTMRT_TU16BTMRT2_POSITION            equ 0002h
TU16BTMRT_TU16BTMRT2_SIZE                equ 0001h
TU16BTMRT_TU16BTMRT2_LENGTH              equ 0001h
TU16BTMRT_TU16BTMRT2_MASK                equ 0004h
TU16BTMRT_TU16BTMRT3_POSN                equ 0003h
TU16BTMRT_TU16BTMRT3_POSITION            equ 0003h
TU16BTMRT_TU16BTMRT3_SIZE                equ 0001h
TU16BTMRT_TU16BTMRT3_LENGTH              equ 0001h
TU16BTMRT_TU16BTMRT3_MASK                equ 0008h
TU16BTMRT_TU16BTMRT4_POSN                equ 0004h
TU16BTMRT_TU16BTMRT4_POSITION            equ 0004h
TU16BTMRT_TU16BTMRT4_SIZE                equ 0001h
TU16BTMRT_TU16BTMRT4_LENGTH              equ 0001h
TU16BTMRT_TU16BTMRT4_MASK                equ 0010h
TU16BTMRT_TU16BTMRT5_POSN                equ 0005h
TU16BTMRT_TU16BTMRT5_POSITION            equ 0005h
TU16BTMRT_TU16BTMRT5_SIZE                equ 0001h
TU16BTMRT_TU16BTMRT5_LENGTH              equ 0001h
TU16BTMRT_TU16BTMRT5_MASK                equ 0020h
TU16BTMRT_TU16BTMRT6_POSN                equ 0006h
TU16BTMRT_TU16BTMRT6_POSITION            equ 0006h
TU16BTMRT_TU16BTMRT6_SIZE                equ 0001h
TU16BTMRT_TU16BTMRT6_LENGTH              equ 0001h
TU16BTMRT_TU16BTMRT6_MASK                equ 0040h
TU16BTMRT_TU16BTMRT7_POSN                equ 0007h
TU16BTMRT_TU16BTMRT7_POSITION            equ 0007h
TU16BTMRT_TU16BTMRT7_SIZE                equ 0001h
TU16BTMRT_TU16BTMRT7_LENGTH              equ 0001h
TU16BTMRT_TU16BTMRT7_MASK                equ 0080h
TU16BTMRT_TU16BTMR24_POSN                equ 0000h
TU16BTMRT_TU16BTMR24_POSITION            equ 0000h
TU16BTMRT_TU16BTMR24_SIZE                equ 0001h
TU16BTMRT_TU16BTMR24_LENGTH              equ 0001h
TU16BTMRT_TU16BTMR24_MASK                equ 0001h
TU16BTMRT_TU16BTMR25_POSN                equ 0001h
TU16BTMRT_TU16BTMR25_POSITION            equ 0001h
TU16BTMRT_TU16BTMR25_SIZE                equ 0001h
TU16BTMRT_TU16BTMR25_LENGTH              equ 0001h
TU16BTMRT_TU16BTMR25_MASK                equ 0002h
TU16BTMRT_TU16BTMR26_POSN                equ 0002h
TU16BTMRT_TU16BTMR26_POSITION            equ 0002h
TU16BTMRT_TU16BTMR26_SIZE                equ 0001h
TU16BTMRT_TU16BTMR26_LENGTH              equ 0001h
TU16BTMRT_TU16BTMR26_MASK                equ 0004h
TU16BTMRT_TU16BTMR27_POSN                equ 0003h
TU16BTMRT_TU16BTMR27_POSITION            equ 0003h
TU16BTMRT_TU16BTMR27_SIZE                equ 0001h
TU16BTMRT_TU16BTMR27_LENGTH              equ 0001h
TU16BTMRT_TU16BTMR27_MASK                equ 0008h
TU16BTMRT_TU16BTMR28_POSN                equ 0004h
TU16BTMRT_TU16BTMR28_POSITION            equ 0004h
TU16BTMRT_TU16BTMR28_SIZE                equ 0001h
TU16BTMRT_TU16BTMR28_LENGTH              equ 0001h
TU16BTMRT_TU16BTMR28_MASK                equ 0010h
TU16BTMRT_TU16BTMR29_POSN                equ 0005h
TU16BTMRT_TU16BTMR29_POSITION            equ 0005h
TU16BTMRT_TU16BTMR29_SIZE                equ 0001h
TU16BTMRT_TU16BTMR29_LENGTH              equ 0001h
TU16BTMRT_TU16BTMR29_MASK                equ 0020h
TU16BTMRT_TU16BTMR30_POSN                equ 0006h
TU16BTMRT_TU16BTMR30_POSITION            equ 0006h
TU16BTMRT_TU16BTMR30_SIZE                equ 0001h
TU16BTMRT_TU16BTMR30_LENGTH              equ 0001h
TU16BTMRT_TU16BTMR30_MASK                equ 0040h
TU16BTMRT_TU16BTMR31_POSN                equ 0007h
TU16BTMRT_TU16BTMR31_POSITION            equ 0007h
TU16BTMRT_TU16BTMR31_SIZE                equ 0001h
TU16BTMRT_TU16BTMR31_LENGTH              equ 0001h
TU16BTMRT_TU16BTMR31_MASK                equ 0080h

// Register: TU16BCRT
#define TU16BCRT TU16BCRT
TU16BCRT                                 equ 0141h
// bitfield definitions
TU16BCRT_CRT_POSN                        equ 0000h
TU16BCRT_CRT_POSITION                    equ 0000h
TU16BCRT_CRT_SIZE                        equ 0008h
TU16BCRT_CRT_LENGTH                      equ 0008h
TU16BCRT_CRT_MASK                        equ 00FFh
TU16BCRT_CRT0_POSN                       equ 0000h
TU16BCRT_CRT0_POSITION                   equ 0000h
TU16BCRT_CRT0_SIZE                       equ 0001h
TU16BCRT_CRT0_LENGTH                     equ 0001h
TU16BCRT_CRT0_MASK                       equ 0001h
TU16BCRT_CRT1_POSN                       equ 0001h
TU16BCRT_CRT1_POSITION                   equ 0001h
TU16BCRT_CRT1_SIZE                       equ 0001h
TU16BCRT_CRT1_LENGTH                     equ 0001h
TU16BCRT_CRT1_MASK                       equ 0002h
TU16BCRT_CRT2_POSN                       equ 0002h
TU16BCRT_CRT2_POSITION                   equ 0002h
TU16BCRT_CRT2_SIZE                       equ 0001h
TU16BCRT_CRT2_LENGTH                     equ 0001h
TU16BCRT_CRT2_MASK                       equ 0004h
TU16BCRT_CRT3_POSN                       equ 0003h
TU16BCRT_CRT3_POSITION                   equ 0003h
TU16BCRT_CRT3_SIZE                       equ 0001h
TU16BCRT_CRT3_LENGTH                     equ 0001h
TU16BCRT_CRT3_MASK                       equ 0008h
TU16BCRT_CRT4_POSN                       equ 0004h
TU16BCRT_CRT4_POSITION                   equ 0004h
TU16BCRT_CRT4_SIZE                       equ 0001h
TU16BCRT_CRT4_LENGTH                     equ 0001h
TU16BCRT_CRT4_MASK                       equ 0010h
TU16BCRT_CRT5_POSN                       equ 0005h
TU16BCRT_CRT5_POSITION                   equ 0005h
TU16BCRT_CRT5_SIZE                       equ 0001h
TU16BCRT_CRT5_LENGTH                     equ 0001h
TU16BCRT_CRT5_MASK                       equ 0020h
TU16BCRT_CRT6_POSN                       equ 0006h
TU16BCRT_CRT6_POSITION                   equ 0006h
TU16BCRT_CRT6_SIZE                       equ 0001h
TU16BCRT_CRT6_LENGTH                     equ 0001h
TU16BCRT_CRT6_MASK                       equ 0040h
TU16BCRT_CRT7_POSN                       equ 0007h
TU16BCRT_CRT7_POSITION                   equ 0007h
TU16BCRT_CRT7_SIZE                       equ 0001h
TU16BCRT_CRT7_LENGTH                     equ 0001h
TU16BCRT_CRT7_MASK                       equ 0080h
TU16BCRT_TU16BCRT0_POSN                  equ 0000h
TU16BCRT_TU16BCRT0_POSITION              equ 0000h
TU16BCRT_TU16BCRT0_SIZE                  equ 0001h
TU16BCRT_TU16BCRT0_LENGTH                equ 0001h
TU16BCRT_TU16BCRT0_MASK                  equ 0001h
TU16BCRT_TU16BCRT1_POSN                  equ 0001h
TU16BCRT_TU16BCRT1_POSITION              equ 0001h
TU16BCRT_TU16BCRT1_SIZE                  equ 0001h
TU16BCRT_TU16BCRT1_LENGTH                equ 0001h
TU16BCRT_TU16BCRT1_MASK                  equ 0002h
TU16BCRT_TU16BCRT2_POSN                  equ 0002h
TU16BCRT_TU16BCRT2_POSITION              equ 0002h
TU16BCRT_TU16BCRT2_SIZE                  equ 0001h
TU16BCRT_TU16BCRT2_LENGTH                equ 0001h
TU16BCRT_TU16BCRT2_MASK                  equ 0004h
TU16BCRT_TU16BCRT3_POSN                  equ 0003h
TU16BCRT_TU16BCRT3_POSITION              equ 0003h
TU16BCRT_TU16BCRT3_SIZE                  equ 0001h
TU16BCRT_TU16BCRT3_LENGTH                equ 0001h
TU16BCRT_TU16BCRT3_MASK                  equ 0008h
TU16BCRT_TU16BCRT4_POSN                  equ 0004h
TU16BCRT_TU16BCRT4_POSITION              equ 0004h
TU16BCRT_TU16BCRT4_SIZE                  equ 0001h
TU16BCRT_TU16BCRT4_LENGTH                equ 0001h
TU16BCRT_TU16BCRT4_MASK                  equ 0010h
TU16BCRT_TU16BCRT5_POSN                  equ 0005h
TU16BCRT_TU16BCRT5_POSITION              equ 0005h
TU16BCRT_TU16BCRT5_SIZE                  equ 0001h
TU16BCRT_TU16BCRT5_LENGTH                equ 0001h
TU16BCRT_TU16BCRT5_MASK                  equ 0020h
TU16BCRT_TU16BCRT6_POSN                  equ 0006h
TU16BCRT_TU16BCRT6_POSITION              equ 0006h
TU16BCRT_TU16BCRT6_SIZE                  equ 0001h
TU16BCRT_TU16BCRT6_LENGTH                equ 0001h
TU16BCRT_TU16BCRT6_MASK                  equ 0040h
TU16BCRT_TU16BCRT7_POSN                  equ 0007h
TU16BCRT_TU16BCRT7_POSITION              equ 0007h
TU16BCRT_TU16BCRT7_SIZE                  equ 0001h
TU16BCRT_TU16BCRT7_LENGTH                equ 0001h
TU16BCRT_TU16BCRT7_MASK                  equ 0080h
TU16BCRT_TU16BCR24_POSN                  equ 0000h
TU16BCRT_TU16BCR24_POSITION              equ 0000h
TU16BCRT_TU16BCR24_SIZE                  equ 0001h
TU16BCRT_TU16BCR24_LENGTH                equ 0001h
TU16BCRT_TU16BCR24_MASK                  equ 0001h
TU16BCRT_TU16BCR25_POSN                  equ 0001h
TU16BCRT_TU16BCR25_POSITION              equ 0001h
TU16BCRT_TU16BCR25_SIZE                  equ 0001h
TU16BCRT_TU16BCR25_LENGTH                equ 0001h
TU16BCRT_TU16BCR25_MASK                  equ 0002h
TU16BCRT_TU16BCR26_POSN                  equ 0002h
TU16BCRT_TU16BCR26_POSITION              equ 0002h
TU16BCRT_TU16BCR26_SIZE                  equ 0001h
TU16BCRT_TU16BCR26_LENGTH                equ 0001h
TU16BCRT_TU16BCR26_MASK                  equ 0004h
TU16BCRT_TU16BCR27_POSN                  equ 0003h
TU16BCRT_TU16BCR27_POSITION              equ 0003h
TU16BCRT_TU16BCR27_SIZE                  equ 0001h
TU16BCRT_TU16BCR27_LENGTH                equ 0001h
TU16BCRT_TU16BCR27_MASK                  equ 0008h
TU16BCRT_TU16BCR28_POSN                  equ 0004h
TU16BCRT_TU16BCR28_POSITION              equ 0004h
TU16BCRT_TU16BCR28_SIZE                  equ 0001h
TU16BCRT_TU16BCR28_LENGTH                equ 0001h
TU16BCRT_TU16BCR28_MASK                  equ 0010h
TU16BCRT_TU16BCR29_POSN                  equ 0005h
TU16BCRT_TU16BCR29_POSITION              equ 0005h
TU16BCRT_TU16BCR29_SIZE                  equ 0001h
TU16BCRT_TU16BCR29_LENGTH                equ 0001h
TU16BCRT_TU16BCR29_MASK                  equ 0020h
TU16BCRT_TU16BCR30_POSN                  equ 0006h
TU16BCRT_TU16BCR30_POSITION              equ 0006h
TU16BCRT_TU16BCR30_SIZE                  equ 0001h
TU16BCRT_TU16BCR30_LENGTH                equ 0001h
TU16BCRT_TU16BCR30_MASK                  equ 0040h
TU16BCRT_TU16BCR31_POSN                  equ 0007h
TU16BCRT_TU16BCR31_POSITION              equ 0007h
TU16BCRT_TU16BCR31_SIZE                  equ 0001h
TU16BCRT_TU16BCR31_LENGTH                equ 0001h
TU16BCRT_TU16BCR31_MASK                  equ 0080h

// Register: TU16BPR
#define TU16BPR TU16BPR
TU16BPR                                  equ 0142h

// Register: TU16BPRL
#define TU16BPRL TU16BPRL
TU16BPRL                                 equ 0142h
// bitfield definitions
TU16BPRL_PRL_POSN                        equ 0000h
TU16BPRL_PRL_POSITION                    equ 0000h
TU16BPRL_PRL_SIZE                        equ 0008h
TU16BPRL_PRL_LENGTH                      equ 0008h
TU16BPRL_PRL_MASK                        equ 00FFh
TU16BPRL_PRL0_POSN                       equ 0000h
TU16BPRL_PRL0_POSITION                   equ 0000h
TU16BPRL_PRL0_SIZE                       equ 0001h
TU16BPRL_PRL0_LENGTH                     equ 0001h
TU16BPRL_PRL0_MASK                       equ 0001h
TU16BPRL_PRL1_POSN                       equ 0001h
TU16BPRL_PRL1_POSITION                   equ 0001h
TU16BPRL_PRL1_SIZE                       equ 0001h
TU16BPRL_PRL1_LENGTH                     equ 0001h
TU16BPRL_PRL1_MASK                       equ 0002h
TU16BPRL_PRL2_POSN                       equ 0002h
TU16BPRL_PRL2_POSITION                   equ 0002h
TU16BPRL_PRL2_SIZE                       equ 0001h
TU16BPRL_PRL2_LENGTH                     equ 0001h
TU16BPRL_PRL2_MASK                       equ 0004h
TU16BPRL_PRL3_POSN                       equ 0003h
TU16BPRL_PRL3_POSITION                   equ 0003h
TU16BPRL_PRL3_SIZE                       equ 0001h
TU16BPRL_PRL3_LENGTH                     equ 0001h
TU16BPRL_PRL3_MASK                       equ 0008h
TU16BPRL_PRL4_POSN                       equ 0004h
TU16BPRL_PRL4_POSITION                   equ 0004h
TU16BPRL_PRL4_SIZE                       equ 0001h
TU16BPRL_PRL4_LENGTH                     equ 0001h
TU16BPRL_PRL4_MASK                       equ 0010h
TU16BPRL_PRL5_POSN                       equ 0005h
TU16BPRL_PRL5_POSITION                   equ 0005h
TU16BPRL_PRL5_SIZE                       equ 0001h
TU16BPRL_PRL5_LENGTH                     equ 0001h
TU16BPRL_PRL5_MASK                       equ 0020h
TU16BPRL_PRL6_POSN                       equ 0006h
TU16BPRL_PRL6_POSITION                   equ 0006h
TU16BPRL_PRL6_SIZE                       equ 0001h
TU16BPRL_PRL6_LENGTH                     equ 0001h
TU16BPRL_PRL6_MASK                       equ 0040h
TU16BPRL_PRL7_POSN                       equ 0007h
TU16BPRL_PRL7_POSITION                   equ 0007h
TU16BPRL_PRL7_SIZE                       equ 0001h
TU16BPRL_PRL7_LENGTH                     equ 0001h
TU16BPRL_PRL7_MASK                       equ 0080h
TU16BPRL_TU16BPRL0_POSN                  equ 0000h
TU16BPRL_TU16BPRL0_POSITION              equ 0000h
TU16BPRL_TU16BPRL0_SIZE                  equ 0001h
TU16BPRL_TU16BPRL0_LENGTH                equ 0001h
TU16BPRL_TU16BPRL0_MASK                  equ 0001h
TU16BPRL_TU16BPRL1_POSN                  equ 0001h
TU16BPRL_TU16BPRL1_POSITION              equ 0001h
TU16BPRL_TU16BPRL1_SIZE                  equ 0001h
TU16BPRL_TU16BPRL1_LENGTH                equ 0001h
TU16BPRL_TU16BPRL1_MASK                  equ 0002h
TU16BPRL_TU16BPRL2_POSN                  equ 0002h
TU16BPRL_TU16BPRL2_POSITION              equ 0002h
TU16BPRL_TU16BPRL2_SIZE                  equ 0001h
TU16BPRL_TU16BPRL2_LENGTH                equ 0001h
TU16BPRL_TU16BPRL2_MASK                  equ 0004h
TU16BPRL_TU16BPRL3_POSN                  equ 0003h
TU16BPRL_TU16BPRL3_POSITION              equ 0003h
TU16BPRL_TU16BPRL3_SIZE                  equ 0001h
TU16BPRL_TU16BPRL3_LENGTH                equ 0001h
TU16BPRL_TU16BPRL3_MASK                  equ 0008h
TU16BPRL_TU16BPRL4_POSN                  equ 0004h
TU16BPRL_TU16BPRL4_POSITION              equ 0004h
TU16BPRL_TU16BPRL4_SIZE                  equ 0001h
TU16BPRL_TU16BPRL4_LENGTH                equ 0001h
TU16BPRL_TU16BPRL4_MASK                  equ 0010h
TU16BPRL_TU16BPRL5_POSN                  equ 0005h
TU16BPRL_TU16BPRL5_POSITION              equ 0005h
TU16BPRL_TU16BPRL5_SIZE                  equ 0001h
TU16BPRL_TU16BPRL5_LENGTH                equ 0001h
TU16BPRL_TU16BPRL5_MASK                  equ 0020h
TU16BPRL_TU16BPRL6_POSN                  equ 0006h
TU16BPRL_TU16BPRL6_POSITION              equ 0006h
TU16BPRL_TU16BPRL6_SIZE                  equ 0001h
TU16BPRL_TU16BPRL6_LENGTH                equ 0001h
TU16BPRL_TU16BPRL6_MASK                  equ 0040h
TU16BPRL_TU16BPRL7_POSN                  equ 0007h
TU16BPRL_TU16BPRL7_POSITION              equ 0007h
TU16BPRL_TU16BPRL7_SIZE                  equ 0001h
TU16BPRL_TU16BPRL7_LENGTH                equ 0001h
TU16BPRL_TU16BPRL7_MASK                  equ 0080h
TU16BPRL_TU16BPR0_POSN                   equ 0000h
TU16BPRL_TU16BPR0_POSITION               equ 0000h
TU16BPRL_TU16BPR0_SIZE                   equ 0001h
TU16BPRL_TU16BPR0_LENGTH                 equ 0001h
TU16BPRL_TU16BPR0_MASK                   equ 0001h
TU16BPRL_TU16BPR1_POSN                   equ 0001h
TU16BPRL_TU16BPR1_POSITION               equ 0001h
TU16BPRL_TU16BPR1_SIZE                   equ 0001h
TU16BPRL_TU16BPR1_LENGTH                 equ 0001h
TU16BPRL_TU16BPR1_MASK                   equ 0002h
TU16BPRL_TU16BPR2_POSN                   equ 0002h
TU16BPRL_TU16BPR2_POSITION               equ 0002h
TU16BPRL_TU16BPR2_SIZE                   equ 0001h
TU16BPRL_TU16BPR2_LENGTH                 equ 0001h
TU16BPRL_TU16BPR2_MASK                   equ 0004h
TU16BPRL_TU16BPR3_POSN                   equ 0003h
TU16BPRL_TU16BPR3_POSITION               equ 0003h
TU16BPRL_TU16BPR3_SIZE                   equ 0001h
TU16BPRL_TU16BPR3_LENGTH                 equ 0001h
TU16BPRL_TU16BPR3_MASK                   equ 0008h
TU16BPRL_TU16BPR4_POSN                   equ 0004h
TU16BPRL_TU16BPR4_POSITION               equ 0004h
TU16BPRL_TU16BPR4_SIZE                   equ 0001h
TU16BPRL_TU16BPR4_LENGTH                 equ 0001h
TU16BPRL_TU16BPR4_MASK                   equ 0010h
TU16BPRL_TU16BPR5_POSN                   equ 0005h
TU16BPRL_TU16BPR5_POSITION               equ 0005h
TU16BPRL_TU16BPR5_SIZE                   equ 0001h
TU16BPRL_TU16BPR5_LENGTH                 equ 0001h
TU16BPRL_TU16BPR5_MASK                   equ 0020h
TU16BPRL_TU16BPR6_POSN                   equ 0006h
TU16BPRL_TU16BPR6_POSITION               equ 0006h
TU16BPRL_TU16BPR6_SIZE                   equ 0001h
TU16BPRL_TU16BPR6_LENGTH                 equ 0001h
TU16BPRL_TU16BPR6_MASK                   equ 0040h
TU16BPRL_TU16BPR7_POSN                   equ 0007h
TU16BPRL_TU16BPR7_POSITION               equ 0007h
TU16BPRL_TU16BPR7_SIZE                   equ 0001h
TU16BPRL_TU16BPR7_LENGTH                 equ 0001h
TU16BPRL_TU16BPR7_MASK                   equ 0080h

