garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: PWM2CLK
#define PWM2CLK PWM2CLK
PWM2CLK                                  equ 0163h
// bitfield definitions
PWM2CLK_CLK_POSN                         equ 0000h
PWM2CLK_CLK_POSITION                     equ 0000h
PWM2CLK_CLK_SIZE                         equ 0008h
PWM2CLK_CLK_LENGTH                       equ 0008h
PWM2CLK_CLK_MASK                         equ 00FFh
PWM2CLK_CLK0_POSN                        equ 0000h
PWM2CLK_CLK0_POSITION                    equ 0000h
PWM2CLK_CLK0_SIZE                        equ 0001h
PWM2CLK_CLK0_LENGTH                      equ 0001h
PWM2CLK_CLK0_MASK                        equ 0001h
PWM2CLK_CLK1_POSN                        equ 0001h
PWM2CLK_CLK1_POSITION                    equ 0001h
PWM2CLK_CLK1_SIZE                        equ 0001h
PWM2CLK_CLK1_LENGTH                      equ 0001h
PWM2CLK_CLK1_MASK                        equ 0002h
PWM2CLK_CLK2_POSN                        equ 0002h
PWM2CLK_CLK2_POSITION                    equ 0002h
PWM2CLK_CLK2_SIZE                        equ 0001h
PWM2CLK_CLK2_LENGTH                      equ 0001h
PWM2CLK_CLK2_MASK                        equ 0004h
PWM2CLK_CLK3_POSN                        equ 0003h
PWM2CLK_CLK3_POSITION                    equ 0003h
PWM2CLK_CLK3_SIZE                        equ 0001h
PWM2CLK_CLK3_LENGTH                      equ 0001h
PWM2CLK_CLK3_MASK                        equ 0008h

// Register: PWM2LDS
#define PWM2LDS PWM2LDS
PWM2LDS                                  equ 0164h
// bitfield definitions
PWM2LDS_LDS_POSN                         equ 0000h
PWM2LDS_LDS_POSITION                     equ 0000h
PWM2LDS_LDS_SIZE                         equ 0008h
PWM2LDS_LDS_LENGTH                       equ 0008h
PWM2LDS_LDS_MASK                         equ 00FFh
PWM2LDS_LDS0_POSN                        equ 0000h
PWM2LDS_LDS0_POSITION                    equ 0000h
PWM2LDS_LDS0_SIZE                        equ 0001h
PWM2LDS_LDS0_LENGTH                      equ 0001h
PWM2LDS_LDS0_MASK                        equ 0001h
PWM2LDS_LDS1_POSN                        equ 0001h
PWM2LDS_LDS1_POSITION                    equ 0001h
PWM2LDS_LDS1_SIZE                        equ 0001h
PWM2LDS_LDS1_LENGTH                      equ 0001h
PWM2LDS_LDS1_MASK                        equ 0002h
PWM2LDS_LDS2_POSN                        equ 0002h
PWM2LDS_LDS2_POSITION                    equ 0002h
PWM2LDS_LDS2_SIZE                        equ 0001h
PWM2LDS_LDS2_LENGTH                      equ 0001h
PWM2LDS_LDS2_MASK                        equ 0004h
PWM2LDS_LDS3_POSN                        equ 0003h
PWM2LDS_LDS3_POSITION                    equ 0003h
PWM2LDS_LDS3_SIZE                        equ 0001h
PWM2LDS_LDS3_LENGTH                      equ 0001h
PWM2LDS_LDS3_MASK                        equ 0008h

// Register: PWM2PR
#define PWM2PR PWM2PR
PWM2PR                                   equ 0165h

// Register: PWM2PRL
#define PWM2PRL PWM2PRL
PWM2PRL                                  equ 0165h
// bitfield definitions
PWM2PRL_PRL_POSN                         equ 0000h
PWM2PRL_PRL_POSITION                     equ 0000h
PWM2PRL_PRL_SIZE                         equ 0008h
PWM2PRL_PRL_LENGTH                       equ 0008h
PWM2PRL_PRL_MASK                         equ 00FFh

// Register: PWM2PRH
#define PWM2PRH PWM2PRH
PWM2PRH                                  equ 0166h
// bitfield definitions
PWM2PRH_PRH_POSN                         equ 0000h
PWM2PRH_PRH_POSITION                     equ 0000h
PWM2PRH_PRH_SIZE                         equ 0008h
PWM2PRH_PRH_LENGTH                       equ 0008h
PWM2PRH_PRH_MASK                         equ 00FFh

// Register: PWM2CPRE
#define PWM2CPRE PWM2CPRE
PWM2CPRE                                 equ 0167h
// bitfield definitions
PWM2CPRE_CPRE_POSN                       equ 0000h
PWM2CPRE_CPRE_POSITION                   equ 0000h
PWM2CPRE_CPRE_SIZE                       equ 0008h
PWM2CPRE_CPRE_LENGTH                     equ 0008h
PWM2CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM2PIPOS
#define PWM2PIPOS PWM2PIPOS
PWM2PIPOS                                equ 0168h
// bitfield definitions
PWM2PIPOS_PIPOS_POSN                     equ 0000h
PWM2PIPOS_PIPOS_POSITION                 equ 0000h
PWM2PIPOS_PIPOS_SIZE                     equ 0008h
PWM2PIPOS_PIPOS_LENGTH                   equ 0008h
PWM2PIPOS_PIPOS_MASK                     equ 00FFh

// Register: PWM2GIR
#define PWM2GIR PWM2GIR
PWM2GIR                                  equ 0169h
// bitfield definitions
PWM2GIR_S1P1IF_POSN                      equ 0000h
PWM2GIR_S1P1IF_POSITION                  equ 0000h
PWM2GIR_S1P1IF_SIZE                      equ 0001h
PWM2GIR_S1P1IF_LENGTH                    equ 0001h
PWM2GIR_S1P1IF_MASK                      equ 0001h
PWM2GIR_S1P2IF_POSN                      equ 0001h
PWM2GIR_S1P2IF_POSITION                  equ 0001h
PWM2GIR_S1P2IF_SIZE                      equ 0001h
PWM2GIR_S1P2IF_LENGTH                    equ 0001h
PWM2GIR_S1P2IF_MASK                      equ 0002h

// Register: PWM2GIE
#define PWM2GIE PWM2GIE
PWM2GIE                                  equ 016Ah
// bitfield definitions
PWM2GIE_S1P1IE_POSN                      equ 0000h
PWM2GIE_S1P1IE_POSITION                  equ 0000h
PWM2GIE_S1P1IE_SIZE                      equ 0001h
PWM2GIE_S1P1IE_LENGTH                    equ 0001h
PWM2GIE_S1P1IE_MASK                      equ 0001h
PWM2GIE_S1P2IE_POSN                      equ 0001h
PWM2GIE_S1P2IE_POSITION                  equ 0001h
PWM2GIE_S1P2IE_SIZE                      equ 0001h
PWM2GIE_S1P2IE_LENGTH                    equ 0001h
PWM2GIE_S1P2IE_MASK                      equ 0002h

// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 016Bh
// bitfield definitions
PWM2CON_ERSNOW_POSN                      equ 0000h
PWM2CON_ERSNOW_POSITION                  equ 0000h
PWM2CON_ERSNOW_SIZE                      equ 0001h
PWM2CON_ERSNOW_LENGTH                    equ 0001h
PWM2CON_ERSNOW_MASK                      equ 0001h
PWM2CON_ERSPOL_POSN                      equ 0001h
PWM2CON_ERSPOL_POSITION                  equ 0001h
PWM2CON_ERSPOL_SIZE                      equ 0001h
PWM2CON_ERSPOL_LENGTH                    equ 0001h
PWM2CON_ERSPOL_MASK                      equ 0002h
PWM2CON_LD_POSN                          equ 0002h
PWM2CON_LD_POSITION                      equ 0002h
PWM2CON_LD_SIZE                          equ 0001h
PWM2CON_LD_LENGTH                        equ 0001h
PWM2CON_LD_MASK                          equ 0004h
PWM2CON_EN_POSN                          equ 0007h
PWM2CON_EN_POSITION                      equ 0007h
PWM2CON_EN_SIZE                          equ 0001h
PWM2CON_EN_LENGTH                        equ 0001h
PWM2CON_EN_MASK                          equ 0080h

// Register: PWM2S1CFG
#define PWM2S1CFG PWM2S1CFG
PWM2S1CFG                                equ 016Ch
// bitfield definitions
PWM2S1CFG_MODE_POSN                      equ 0000h
PWM2S1CFG_MODE_POSITION                  equ 0000h
PWM2S1CFG_MODE_SIZE                      equ 0003h
PWM2S1CFG_MODE_LENGTH                    equ 0003h
PWM2S1CFG_MODE_MASK                      equ 0007h
PWM2S1CFG_PPEN_POSN                      equ 0003h
PWM2S1CFG_PPEN_POSITION                  equ 0003h
PWM2S1CFG_PPEN_SIZE                      equ 0001h
PWM2S1CFG_PPEN_LENGTH                    equ 0001h
PWM2S1CFG_PPEN_MASK                      equ 0008h
PWM2S1CFG_POL1_POSN                      equ 0006h
PWM2S1CFG_POL1_POSITION                  equ 0006h
PWM2S1CFG_POL1_SIZE                      equ 0001h
PWM2S1CFG_POL1_LENGTH                    equ 0001h
PWM2S1CFG_POL1_MASK                      equ 0040h
PWM2S1CFG_POL2_POSN                      equ 0007h
PWM2S1CFG_POL2_POSITION                  equ 0007h
PWM2S1CFG_POL2_SIZE                      equ 0001h
PWM2S1CFG_POL2_LENGTH                    equ 0001h
PWM2S1CFG_POL2_MASK                      equ 0080h
PWM2S1CFG_MODE0_POSN                     equ 0000h
PWM2S1CFG_MODE0_POSITION                 equ 0000h
PWM2S1CFG_MODE0_SIZE                     equ 0001h
PWM2S1CFG_MODE0_LENGTH                   equ 0001h
PWM2S1CFG_MODE0_MASK                     equ 0001h
PWM2S1CFG_MODE1_POSN                     equ 0001h
PWM2S1CFG_MODE1_POSITION                 equ 0001h
PWM2S1CFG_MODE1_SIZE                     equ 0001h
PWM2S1CFG_MODE1_LENGTH                   equ 0001h
PWM2S1CFG_MODE1_MASK                     equ 0002h
PWM2S1CFG_MODE2_POSN                     equ 0002h
PWM2S1CFG_MODE2_POSITION                 equ 0002h
PWM2S1CFG_MODE2_SIZE                     equ 0001h
PWM2S1CFG_MODE2_LENGTH                   equ 0001h
PWM2S1CFG_MODE2_MASK                     equ 0004h

// Register: PWM2S1P1
#define PWM2S1P1 PWM2S1P1
PWM2S1P1                                 equ 016Dh

// Register: PWM2S1P1L
#define PWM2S1P1L PWM2S1P1L
PWM2S1P1L                                equ 016Dh
// bitfield definitions
PWM2S1P1L_S1P1L_POSN                     equ 0000h
PWM2S1P1L_S1P1L_POSITION                 equ 0000h
PWM2S1P1L_S1P1L_SIZE                     equ 0008h
PWM2S1P1L_S1P1L_LENGTH                   equ 0008h
PWM2S1P1L_S1P1L_MASK                     equ 00FFh

// Register: PWM2S1P1H
#define PWM2S1P1H PWM2S1P1H
PWM2S1P1H                                equ 016Eh
// bitfield definitions
PWM2S1P1H_S1P1H_POSN                     equ 0000h
PWM2S1P1H_S1P1H_POSITION                 equ 0000h
PWM2S1P1H_S1P1H_SIZE                     equ 0008h
PWM2S1P1H_S1P1H_LENGTH                   equ 0008h
PWM2S1P1H_S1P1H_MASK                     equ 00FFh

