garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: U2ERRIR
#define U2ERRIR U2ERRIR
U2ERRIR                                  equ 01D5h
// bitfield definitions
U2ERRIR_RXFOIF_POSN                      equ 0001h
U2ERRIR_RXFOIF_POSITION                  equ 0001h
U2ERRIR_RXFOIF_SIZE                      equ 0001h
U2ERRIR_RXFOIF_LENGTH                    equ 0001h
U2ERRIR_RXFOIF_MASK                      equ 0002h
U2ERRIR_RXBKIF_POSN                      equ 0002h
U2ERRIR_RXBKIF_POSITION                  equ 0002h
U2ERRIR_RXBKIF_SIZE                      equ 0001h
U2ERRIR_RXBKIF_LENGTH                    equ 0001h
U2ERRIR_RXBKIF_MASK                      equ 0004h
U2ERRIR_FERIF_POSN                       equ 0003h
U2ERRIR_FERIF_POSITION                   equ 0003h
U2ERRIR_FERIF_SIZE                       equ 0001h
U2ERRIR_FERIF_LENGTH                     equ 0001h
U2ERRIR_FERIF_MASK                       equ 0008h
U2ERRIR_ABDOVF_POSN                      equ 0005h
U2ERRIR_ABDOVF_POSITION                  equ 0005h
U2ERRIR_ABDOVF_SIZE                      equ 0001h
U2ERRIR_ABDOVF_LENGTH                    equ 0001h
U2ERRIR_ABDOVF_MASK                      equ 0020h
U2ERRIR_PERIF_POSN                       equ 0006h
U2ERRIR_PERIF_POSITION                   equ 0006h
U2ERRIR_PERIF_SIZE                       equ 0001h
U2ERRIR_PERIF_LENGTH                     equ 0001h
U2ERRIR_PERIF_MASK                       equ 0040h
U2ERRIR_TXMTIF_POSN                      equ 0007h
U2ERRIR_TXMTIF_POSITION                  equ 0007h
U2ERRIR_TXMTIF_SIZE                      equ 0001h
U2ERRIR_TXMTIF_LENGTH                    equ 0001h
U2ERRIR_TXMTIF_MASK                      equ 0080h
U2ERRIR_U2RXFOIF_POSN                    equ 0001h
U2ERRIR_U2RXFOIF_POSITION                equ 0001h
U2ERRIR_U2RXFOIF_SIZE                    equ 0001h
U2ERRIR_U2RXFOIF_LENGTH                  equ 0001h
U2ERRIR_U2RXFOIF_MASK                    equ 0002h
U2ERRIR_U2RXBKIF_POSN                    equ 0002h
U2ERRIR_U2RXBKIF_POSITION                equ 0002h
U2ERRIR_U2RXBKIF_SIZE                    equ 0001h
U2ERRIR_U2RXBKIF_LENGTH                  equ 0001h
U2ERRIR_U2RXBKIF_MASK                    equ 0004h
U2ERRIR_U2FERIF_POSN                     equ 0003h
U2ERRIR_U2FERIF_POSITION                 equ 0003h
U2ERRIR_U2FERIF_SIZE                     equ 0001h
U2ERRIR_U2FERIF_LENGTH                   equ 0001h
U2ERRIR_U2FERIF_MASK                     equ 0008h
U2ERRIR_U2ABDOVF_POSN                    equ 0005h
U2ERRIR_U2ABDOVF_POSITION                equ 0005h
U2ERRIR_U2ABDOVF_SIZE                    equ 0001h
U2ERRIR_U2ABDOVF_LENGTH                  equ 0001h
U2ERRIR_U2ABDOVF_MASK                    equ 0020h
U2ERRIR_U2PERIF_POSN                     equ 0006h
U2ERRIR_U2PERIF_POSITION                 equ 0006h
U2ERRIR_U2PERIF_SIZE                     equ 0001h
U2ERRIR_U2PERIF_LENGTH                   equ 0001h
U2ERRIR_U2PERIF_MASK                     equ 0040h
U2ERRIR_U2TXMTIF_POSN                    equ 0007h
U2ERRIR_U2TXMTIF_POSITION                equ 0007h
U2ERRIR_U2TXMTIF_SIZE                    equ 0001h
U2ERRIR_U2TXMTIF_LENGTH                  equ 0001h
U2ERRIR_U2TXMTIF_MASK                    equ 0080h

// Register: U2ERRIE
#define U2ERRIE U2ERRIE
U2ERRIE                                  equ 01D6h
// bitfield definitions
U2ERRIE_RXFOIE_POSN                      equ 0001h
U2ERRIE_RXFOIE_POSITION                  equ 0001h
U2ERRIE_RXFOIE_SIZE                      equ 0001h
U2ERRIE_RXFOIE_LENGTH                    equ 0001h
U2ERRIE_RXFOIE_MASK                      equ 0002h
U2ERRIE_RXBKIE_POSN                      equ 0002h
U2ERRIE_RXBKIE_POSITION                  equ 0002h
U2ERRIE_RXBKIE_SIZE                      equ 0001h
U2ERRIE_RXBKIE_LENGTH                    equ 0001h
U2ERRIE_RXBKIE_MASK                      equ 0004h
U2ERRIE_FERIE_POSN                       equ 0003h
U2ERRIE_FERIE_POSITION                   equ 0003h
U2ERRIE_FERIE_SIZE                       equ 0001h
U2ERRIE_FERIE_LENGTH                     equ 0001h
U2ERRIE_FERIE_MASK                       equ 0008h
U2ERRIE_ABDOVE_POSN                      equ 0005h
U2ERRIE_ABDOVE_POSITION                  equ 0005h
U2ERRIE_ABDOVE_SIZE                      equ 0001h
U2ERRIE_ABDOVE_LENGTH                    equ 0001h
U2ERRIE_ABDOVE_MASK                      equ 0020h
U2ERRIE_PERIE_POSN                       equ 0006h
U2ERRIE_PERIE_POSITION                   equ 0006h
U2ERRIE_PERIE_SIZE                       equ 0001h
U2ERRIE_PERIE_LENGTH                     equ 0001h
U2ERRIE_PERIE_MASK                       equ 0040h
U2ERRIE_TXMTIE_POSN                      equ 0007h
U2ERRIE_TXMTIE_POSITION                  equ 0007h
U2ERRIE_TXMTIE_SIZE                      equ 0001h
U2ERRIE_TXMTIE_LENGTH                    equ 0001h
U2ERRIE_TXMTIE_MASK                      equ 0080h
U2ERRIE_U2RXFOIE_POSN                    equ 0001h
U2ERRIE_U2RXFOIE_POSITION                equ 0001h
U2ERRIE_U2RXFOIE_SIZE                    equ 0001h
U2ERRIE_U2RXFOIE_LENGTH                  equ 0001h
U2ERRIE_U2RXFOIE_MASK                    equ 0002h
U2ERRIE_U2RXBKIE_POSN                    equ 0002h
U2ERRIE_U2RXBKIE_POSITION                equ 0002h
U2ERRIE_U2RXBKIE_SIZE                    equ 0001h
U2ERRIE_U2RXBKIE_LENGTH                  equ 0001h
U2ERRIE_U2RXBKIE_MASK                    equ 0004h
U2ERRIE_U2FERIE_POSN                     equ 0003h
U2ERRIE_U2FERIE_POSITION                 equ 0003h
U2ERRIE_U2FERIE_SIZE                     equ 0001h
U2ERRIE_U2FERIE_LENGTH                   equ 0001h
U2ERRIE_U2FERIE_MASK                     equ 0008h
U2ERRIE_U2ABDOVE_POSN                    equ 0005h
U2ERRIE_U2ABDOVE_POSITION                equ 0005h
U2ERRIE_U2ABDOVE_SIZE                    equ 0001h
U2ERRIE_U2ABDOVE_LENGTH                  equ 0001h
U2ERRIE_U2ABDOVE_MASK                    equ 0020h
U2ERRIE_U2PERIE_POSN                     equ 0006h
U2ERRIE_U2PERIE_POSITION                 equ 0006h
U2ERRIE_U2PERIE_SIZE                     equ 0001h
U2ERRIE_U2PERIE_LENGTH                   equ 0001h
U2ERRIE_U2PERIE_MASK                     equ 0040h
U2ERRIE_U2TXMTIE_POSN                    equ 0007h
U2ERRIE_U2TXMTIE_POSITION                equ 0007h
U2ERRIE_U2TXMTIE_SIZE                    equ 0001h
U2ERRIE_U2TXMTIE_LENGTH                  equ 0001h
U2ERRIE_U2TXMTIE_MASK                    equ 0080h

// Register: SPI1RXB
#define SPI1RXB SPI1RXB
SPI1RXB                                  equ 01D7h
// bitfield definitions
SPI1RXB_RXB_POSN                         equ 0000h
SPI1RXB_RXB_POSITION                     equ 0000h
SPI1RXB_RXB_SIZE                         equ 0008h
SPI1RXB_RXB_LENGTH                       equ 0008h
SPI1RXB_RXB_MASK                         equ 00FFh
SPI1RXB_RXB0_POSN                        equ 0000h
SPI1RXB_RXB0_POSITION                    equ 0000h
SPI1RXB_RXB0_SIZE                        equ 0001h
SPI1RXB_RXB0_LENGTH                      equ 0001h
SPI1RXB_RXB0_MASK                        equ 0001h
SPI1RXB_RXB1_POSN                        equ 0001h
SPI1RXB_RXB1_POSITION                    equ 0001h
SPI1RXB_RXB1_SIZE                        equ 0001h
SPI1RXB_RXB1_LENGTH                      equ 0001h
SPI1RXB_RXB1_MASK                        equ 0002h
SPI1RXB_RXB2_POSN                        equ 0002h
SPI1RXB_RXB2_POSITION                    equ 0002h
SPI1RXB_RXB2_SIZE                        equ 0001h
SPI1RXB_RXB2_LENGTH                      equ 0001h
SPI1RXB_RXB2_MASK                        equ 0004h
SPI1RXB_RXB3_POSN                        equ 0003h
SPI1RXB_RXB3_POSITION                    equ 0003h
SPI1RXB_RXB3_SIZE                        equ 0001h
SPI1RXB_RXB3_LENGTH                      equ 0001h
SPI1RXB_RXB3_MASK                        equ 0008h
SPI1RXB_RXB4_POSN                        equ 0004h
SPI1RXB_RXB4_POSITION                    equ 0004h
SPI1RXB_RXB4_SIZE                        equ 0001h
SPI1RXB_RXB4_LENGTH                      equ 0001h
SPI1RXB_RXB4_MASK                        equ 0010h
SPI1RXB_RXB5_POSN                        equ 0005h
SPI1RXB_RXB5_POSITION                    equ 0005h
SPI1RXB_RXB5_SIZE                        equ 0001h
SPI1RXB_RXB5_LENGTH                      equ 0001h
SPI1RXB_RXB5_MASK                        equ 0020h
SPI1RXB_RXB6_POSN                        equ 0006h
SPI1RXB_RXB6_POSITION                    equ 0006h
SPI1RXB_RXB6_SIZE                        equ 0001h
SPI1RXB_RXB6_LENGTH                      equ 0001h
SPI1RXB_RXB6_MASK                        equ 0040h
SPI1RXB_RXB7_POSN                        equ 0007h
SPI1RXB_RXB7_POSITION                    equ 0007h
SPI1RXB_RXB7_SIZE                        equ 0001h
SPI1RXB_RXB7_LENGTH                      equ 0001h
SPI1RXB_RXB7_MASK                        equ 0080h

// Register: SPI1TXB
#define SPI1TXB SPI1TXB
SPI1TXB                                  equ 01D8h
// bitfield definitions
SPI1TXB_TXB_POSN                         equ 0000h
SPI1TXB_TXB_POSITION                     equ 0000h
SPI1TXB_TXB_SIZE                         equ 0008h
SPI1TXB_TXB_LENGTH                       equ 0008h
SPI1TXB_TXB_MASK                         equ 00FFh
SPI1TXB_TXB0_POSN                        equ 0000h
SPI1TXB_TXB0_POSITION                    equ 0000h
SPI1TXB_TXB0_SIZE                        equ 0001h
SPI1TXB_TXB0_LENGTH                      equ 0001h
SPI1TXB_TXB0_MASK                        equ 0001h
SPI1TXB_TXB1_POSN                        equ 0001h
SPI1TXB_TXB1_POSITION                    equ 0001h
SPI1TXB_TXB1_SIZE                        equ 0001h
SPI1TXB_TXB1_LENGTH                      equ 0001h
SPI1TXB_TXB1_MASK                        equ 0002h
SPI1TXB_TXB2_POSN                        equ 0002h
SPI1TXB_TXB2_POSITION                    equ 0002h
SPI1TXB_TXB2_SIZE                        equ 0001h
SPI1TXB_TXB2_LENGTH                      equ 0001h
SPI1TXB_TXB2_MASK                        equ 0004h
SPI1TXB_TXB3_POSN                        equ 0003h
SPI1TXB_TXB3_POSITION                    equ 0003h
SPI1TXB_TXB3_SIZE                        equ 0001h
SPI1TXB_TXB3_LENGTH                      equ 0001h
SPI1TXB_TXB3_MASK                        equ 0008h
SPI1TXB_TXB4_POSN                        equ 0004h
SPI1TXB_TXB4_POSITION                    equ 0004h
SPI1TXB_TXB4_SIZE                        equ 0001h
SPI1TXB_TXB4_LENGTH                      equ 0001h
SPI1TXB_TXB4_MASK                        equ 0010h
SPI1TXB_TXB5_POSN                        equ 0005h
SPI1TXB_TXB5_POSITION                    equ 0005h
SPI1TXB_TXB5_SIZE                        equ 0001h
SPI1TXB_TXB5_LENGTH                      equ 0001h
SPI1TXB_TXB5_MASK                        equ 0020h
SPI1TXB_TXB6_POSN                        equ 0006h
SPI1TXB_TXB6_POSITION                    equ 0006h
SPI1TXB_TXB6_SIZE                        equ 0001h
SPI1TXB_TXB6_LENGTH                      equ 0001h
SPI1TXB_TXB6_MASK                        equ 0040h
SPI1TXB_TXB7_POSN                        equ 0007h
SPI1TXB_TXB7_POSITION                    equ 0007h
SPI1TXB_TXB7_SIZE                        equ 0001h
SPI1TXB_TXB7_LENGTH                      equ 0001h
SPI1TXB_TXB7_MASK                        equ 0080h

// Register: SPI1TCNT
#define SPI1TCNT SPI1TCNT
SPI1TCNT                                 equ 01D9h

// Register: SPI1TCNTL
#define SPI1TCNTL SPI1TCNTL
SPI1TCNTL                                equ 01D9h
// bitfield definitions
SPI1TCNTL_TCNTL_POSN                     equ 0000h
SPI1TCNTL_TCNTL_POSITION                 equ 0000h
SPI1TCNTL_TCNTL_SIZE                     equ 0008h
SPI1TCNTL_TCNTL_LENGTH                   equ 0008h
SPI1TCNTL_TCNTL_MASK                     equ 00FFh

