garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: I2C1PIE
#define I2C1PIE I2C1PIE
I2C1PIE                                  equ 01EBh
// bitfield definitions
I2C1PIE_SCIE_POSN                        equ 0000h
I2C1PIE_SCIE_POSITION                    equ 0000h
I2C1PIE_SCIE_SIZE                        equ 0001h
I2C1PIE_SCIE_LENGTH                      equ 0001h
I2C1PIE_SCIE_MASK                        equ 0001h
I2C1PIE_RSCIE_POSN                       equ 0001h
I2C1PIE_RSCIE_POSITION                   equ 0001h
I2C1PIE_RSCIE_SIZE                       equ 0001h
I2C1PIE_RSCIE_LENGTH                     equ 0001h
I2C1PIE_RSCIE_MASK                       equ 0002h
I2C1PIE_PCIE_POSN                        equ 0002h
I2C1PIE_PCIE_POSITION                    equ 0002h
I2C1PIE_PCIE_SIZE                        equ 0001h
I2C1PIE_PCIE_LENGTH                      equ 0001h
I2C1PIE_PCIE_MASK                        equ 0004h
I2C1PIE_ADRIE_POSN                       equ 0003h
I2C1PIE_ADRIE_POSITION                   equ 0003h
I2C1PIE_ADRIE_SIZE                       equ 0001h
I2C1PIE_ADRIE_LENGTH                     equ 0001h
I2C1PIE_ADRIE_MASK                       equ 0008h
I2C1PIE_WRIE_POSN                        equ 0004h
I2C1PIE_WRIE_POSITION                    equ 0004h
I2C1PIE_WRIE_SIZE                        equ 0001h
I2C1PIE_WRIE_LENGTH                      equ 0001h
I2C1PIE_WRIE_MASK                        equ 0010h
I2C1PIE_ACKTIE_POSN                      equ 0006h
I2C1PIE_ACKTIE_POSITION                  equ 0006h
I2C1PIE_ACKTIE_SIZE                      equ 0001h
I2C1PIE_ACKTIE_LENGTH                    equ 0001h
I2C1PIE_ACKTIE_MASK                      equ 0040h
I2C1PIE_CNTIE_POSN                       equ 0007h
I2C1PIE_CNTIE_POSITION                   equ 0007h
I2C1PIE_CNTIE_SIZE                       equ 0001h
I2C1PIE_CNTIE_LENGTH                     equ 0001h
I2C1PIE_CNTIE_MASK                       equ 0080h
I2C1PIE_SC1IE_POSN                       equ 0000h
I2C1PIE_SC1IE_POSITION                   equ 0000h
I2C1PIE_SC1IE_SIZE                       equ 0001h
I2C1PIE_SC1IE_LENGTH                     equ 0001h
I2C1PIE_SC1IE_MASK                       equ 0001h
I2C1PIE_RSC1IE_POSN                      equ 0001h
I2C1PIE_RSC1IE_POSITION                  equ 0001h
I2C1PIE_RSC1IE_SIZE                      equ 0001h
I2C1PIE_RSC1IE_LENGTH                    equ 0001h
I2C1PIE_RSC1IE_MASK                      equ 0002h
I2C1PIE_PC1IE_POSN                       equ 0002h
I2C1PIE_PC1IE_POSITION                   equ 0002h
I2C1PIE_PC1IE_SIZE                       equ 0001h
I2C1PIE_PC1IE_LENGTH                     equ 0001h
I2C1PIE_PC1IE_MASK                       equ 0004h
I2C1PIE_ADR1IE_POSN                      equ 0003h
I2C1PIE_ADR1IE_POSITION                  equ 0003h
I2C1PIE_ADR1IE_SIZE                      equ 0001h
I2C1PIE_ADR1IE_LENGTH                    equ 0001h
I2C1PIE_ADR1IE_MASK                      equ 0008h
I2C1PIE_WR1IE_POSN                       equ 0004h
I2C1PIE_WR1IE_POSITION                   equ 0004h
I2C1PIE_WR1IE_SIZE                       equ 0001h
I2C1PIE_WR1IE_LENGTH                     equ 0001h
I2C1PIE_WR1IE_MASK                       equ 0010h
I2C1PIE_ACKT1IE_POSN                     equ 0006h
I2C1PIE_ACKT1IE_POSITION                 equ 0006h
I2C1PIE_ACKT1IE_SIZE                     equ 0001h
I2C1PIE_ACKT1IE_LENGTH                   equ 0001h
I2C1PIE_ACKT1IE_MASK                     equ 0040h
I2C1PIE_CNT1IE_POSN                      equ 0007h
I2C1PIE_CNT1IE_POSITION                  equ 0007h
I2C1PIE_CNT1IE_SIZE                      equ 0001h
I2C1PIE_CNT1IE_LENGTH                    equ 0001h
I2C1PIE_CNT1IE_MASK                      equ 0080h

// Register: I2C1ERR
#define I2C1ERR I2C1ERR
I2C1ERR                                  equ 01ECh
// bitfield definitions
I2C1ERR_NACKIE_POSN                      equ 0000h
I2C1ERR_NACKIE_POSITION                  equ 0000h
I2C1ERR_NACKIE_SIZE                      equ 0001h
I2C1ERR_NACKIE_LENGTH                    equ 0001h
I2C1ERR_NACKIE_MASK                      equ 0001h
I2C1ERR_BCLIE_POSN                       equ 0001h
I2C1ERR_BCLIE_POSITION                   equ 0001h
I2C1ERR_BCLIE_SIZE                       equ 0001h
I2C1ERR_BCLIE_LENGTH                     equ 0001h
I2C1ERR_BCLIE_MASK                       equ 0002h
I2C1ERR_BTOIE_POSN                       equ 0002h
I2C1ERR_BTOIE_POSITION                   equ 0002h
I2C1ERR_BTOIE_SIZE                       equ 0001h
I2C1ERR_BTOIE_LENGTH                     equ 0001h
I2C1ERR_BTOIE_MASK                       equ 0004h
I2C1ERR_NACKIF_POSN                      equ 0004h
I2C1ERR_NACKIF_POSITION                  equ 0004h
I2C1ERR_NACKIF_SIZE                      equ 0001h
I2C1ERR_NACKIF_LENGTH                    equ 0001h
I2C1ERR_NACKIF_MASK                      equ 0010h
I2C1ERR_BCLIF_POSN                       equ 0005h
I2C1ERR_BCLIF_POSITION                   equ 0005h
I2C1ERR_BCLIF_SIZE                       equ 0001h
I2C1ERR_BCLIF_LENGTH                     equ 0001h
I2C1ERR_BCLIF_MASK                       equ 0020h
I2C1ERR_BTOIF_POSN                       equ 0006h
I2C1ERR_BTOIF_POSITION                   equ 0006h
I2C1ERR_BTOIF_SIZE                       equ 0001h
I2C1ERR_BTOIF_LENGTH                     equ 0001h
I2C1ERR_BTOIF_MASK                       equ 0040h
I2C1ERR_NACK1IE_POSN                     equ 0000h
I2C1ERR_NACK1IE_POSITION                 equ 0000h
I2C1ERR_NACK1IE_SIZE                     equ 0001h
I2C1ERR_NACK1IE_LENGTH                   equ 0001h
I2C1ERR_NACK1IE_MASK                     equ 0001h
I2C1ERR_BCL1IE_POSN                      equ 0001h
I2C1ERR_BCL1IE_POSITION                  equ 0001h
I2C1ERR_BCL1IE_SIZE                      equ 0001h
I2C1ERR_BCL1IE_LENGTH                    equ 0001h
I2C1ERR_BCL1IE_MASK                      equ 0002h
I2C1ERR_BTO1IE_POSN                      equ 0002h
I2C1ERR_BTO1IE_POSITION                  equ 0002h
I2C1ERR_BTO1IE_SIZE                      equ 0001h
I2C1ERR_BTO1IE_LENGTH                    equ 0001h
I2C1ERR_BTO1IE_MASK                      equ 0004h
I2C1ERR_NACK1IF_POSN                     equ 0004h
I2C1ERR_NACK1IF_POSITION                 equ 0004h
I2C1ERR_NACK1IF_SIZE                     equ 0001h
I2C1ERR_NACK1IF_LENGTH                   equ 0001h
I2C1ERR_NACK1IF_MASK                     equ 0010h
I2C1ERR_BCL1IF_POSN                      equ 0005h
I2C1ERR_BCL1IF_POSITION                  equ 0005h
I2C1ERR_BCL1IF_SIZE                      equ 0001h
I2C1ERR_BCL1IF_LENGTH                    equ 0001h
I2C1ERR_BCL1IF_MASK                      equ 0020h
I2C1ERR_BTO1IF_POSN                      equ 0006h
I2C1ERR_BTO1IF_POSITION                  equ 0006h
I2C1ERR_BTO1IF_SIZE                      equ 0001h
I2C1ERR_BTO1IF_LENGTH                    equ 0001h
I2C1ERR_BTO1IF_MASK                      equ 0040h

