garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: I2C1CNT
#define I2C1CNT I2C1CNT
I2C1CNT                                  equ 01EDh

// Register: I2C1CNTL
#define I2C1CNTL I2C1CNTL
I2C1CNTL                                 equ 01EDh
// bitfield definitions
I2C1CNTL_CNT_POSN                        equ 0000h
I2C1CNTL_CNT_POSITION                    equ 0000h
I2C1CNTL_CNT_SIZE                        equ 0008h
I2C1CNTL_CNT_LENGTH                      equ 0008h
I2C1CNTL_CNT_MASK                        equ 00FFh
I2C1CNTL_CNT0_POSN                       equ 0000h
I2C1CNTL_CNT0_POSITION                   equ 0000h
I2C1CNTL_CNT0_SIZE                       equ 0001h
I2C1CNTL_CNT0_LENGTH                     equ 0001h
I2C1CNTL_CNT0_MASK                       equ 0001h
I2C1CNTL_CNT1_POSN                       equ 0001h
I2C1CNTL_CNT1_POSITION                   equ 0001h
I2C1CNTL_CNT1_SIZE                       equ 0001h
I2C1CNTL_CNT1_LENGTH                     equ 0001h
I2C1CNTL_CNT1_MASK                       equ 0002h
I2C1CNTL_CNT2_POSN                       equ 0002h
I2C1CNTL_CNT2_POSITION                   equ 0002h
I2C1CNTL_CNT2_SIZE                       equ 0001h
I2C1CNTL_CNT2_LENGTH                     equ 0001h
I2C1CNTL_CNT2_MASK                       equ 0004h
I2C1CNTL_CNT3_POSN                       equ 0003h
I2C1CNTL_CNT3_POSITION                   equ 0003h
I2C1CNTL_CNT3_SIZE                       equ 0001h
I2C1CNTL_CNT3_LENGTH                     equ 0001h
I2C1CNTL_CNT3_MASK                       equ 0008h
I2C1CNTL_CNT4_POSN                       equ 0004h
I2C1CNTL_CNT4_POSITION                   equ 0004h
I2C1CNTL_CNT4_SIZE                       equ 0001h
I2C1CNTL_CNT4_LENGTH                     equ 0001h
I2C1CNTL_CNT4_MASK                       equ 0010h
I2C1CNTL_CNT5_POSN                       equ 0005h
I2C1CNTL_CNT5_POSITION                   equ 0005h
I2C1CNTL_CNT5_SIZE                       equ 0001h
I2C1CNTL_CNT5_LENGTH                     equ 0001h
I2C1CNTL_CNT5_MASK                       equ 0020h
I2C1CNTL_CNT6_POSN                       equ 0006h
I2C1CNTL_CNT6_POSITION                   equ 0006h
I2C1CNTL_CNT6_SIZE                       equ 0001h
I2C1CNTL_CNT6_LENGTH                     equ 0001h
I2C1CNTL_CNT6_MASK                       equ 0040h
I2C1CNTL_CNT7_POSN                       equ 0007h
I2C1CNTL_CNT7_POSITION                   equ 0007h
I2C1CNTL_CNT7_SIZE                       equ 0001h
I2C1CNTL_CNT7_LENGTH                     equ 0001h
I2C1CNTL_CNT7_MASK                       equ 0080h
I2C1CNTL_I2C1CNT_POSN                    equ 0000h
I2C1CNTL_I2C1CNT_POSITION                equ 0000h
I2C1CNTL_I2C1CNT_SIZE                    equ 0008h
I2C1CNTL_I2C1CNT_LENGTH                  equ 0008h
I2C1CNTL_I2C1CNT_MASK                    equ 00FFh
I2C1CNTL_I2C1CNT0_POSN                   equ 0000h
I2C1CNTL_I2C1CNT0_POSITION               equ 0000h
I2C1CNTL_I2C1CNT0_SIZE                   equ 0001h
I2C1CNTL_I2C1CNT0_LENGTH                 equ 0001h
I2C1CNTL_I2C1CNT0_MASK                   equ 0001h
I2C1CNTL_I2C1CNT1_POSN                   equ 0001h
I2C1CNTL_I2C1CNT1_POSITION               equ 0001h
I2C1CNTL_I2C1CNT1_SIZE                   equ 0001h
I2C1CNTL_I2C1CNT1_LENGTH                 equ 0001h
I2C1CNTL_I2C1CNT1_MASK                   equ 0002h
I2C1CNTL_I2C1CNT2_POSN                   equ 0002h
I2C1CNTL_I2C1CNT2_POSITION               equ 0002h
I2C1CNTL_I2C1CNT2_SIZE                   equ 0001h
I2C1CNTL_I2C1CNT2_LENGTH                 equ 0001h
I2C1CNTL_I2C1CNT2_MASK                   equ 0004h
I2C1CNTL_I2C1CNT3_POSN                   equ 0003h
I2C1CNTL_I2C1CNT3_POSITION               equ 0003h
I2C1CNTL_I2C1CNT3_SIZE                   equ 0001h
I2C1CNTL_I2C1CNT3_LENGTH                 equ 0001h
I2C1CNTL_I2C1CNT3_MASK                   equ 0008h
I2C1CNTL_I2C1CNT4_POSN                   equ 0004h
I2C1CNTL_I2C1CNT4_POSITION               equ 0004h
I2C1CNTL_I2C1CNT4_SIZE                   equ 0001h
I2C1CNTL_I2C1CNT4_LENGTH                 equ 0001h
I2C1CNTL_I2C1CNT4_MASK                   equ 0010h
I2C1CNTL_I2C1CNT5_POSN                   equ 0005h
I2C1CNTL_I2C1CNT5_POSITION               equ 0005h
I2C1CNTL_I2C1CNT5_SIZE                   equ 0001h
I2C1CNTL_I2C1CNT5_LENGTH                 equ 0001h
I2C1CNTL_I2C1CNT5_MASK                   equ 0020h
I2C1CNTL_I2C1CNT6_POSN                   equ 0006h
I2C1CNTL_I2C1CNT6_POSITION               equ 0006h
I2C1CNTL_I2C1CNT6_SIZE                   equ 0001h
I2C1CNTL_I2C1CNT6_LENGTH                 equ 0001h
I2C1CNTL_I2C1CNT6_MASK                   equ 0040h
I2C1CNTL_I2C1CNT7_POSN                   equ 0007h
I2C1CNTL_I2C1CNT7_POSITION               equ 0007h
I2C1CNTL_I2C1CNT7_SIZE                   equ 0001h
I2C1CNTL_I2C1CNT7_LENGTH                 equ 0001h
I2C1CNTL_I2C1CNT7_MASK                   equ 0080h

// Register: I2C1CNTH
#define I2C1CNTH I2C1CNTH
I2C1CNTH                                 equ 01EEh
// bitfield definitions
I2C1CNTH_CNT_POSN                        equ 0000h
I2C1CNTH_CNT_POSITION                    equ 0000h
I2C1CNTH_CNT_SIZE                        equ 0008h
I2C1CNTH_CNT_LENGTH                      equ 0008h
I2C1CNTH_CNT_MASK                        equ 00FFh
I2C1CNTH_CNT8_POSN                       equ 0000h
I2C1CNTH_CNT8_POSITION                   equ 0000h
I2C1CNTH_CNT8_SIZE                       equ 0001h
I2C1CNTH_CNT8_LENGTH                     equ 0001h
I2C1CNTH_CNT8_MASK                       equ 0001h
I2C1CNTH_CNT9_POSN                       equ 0001h
I2C1CNTH_CNT9_POSITION                   equ 0001h
I2C1CNTH_CNT9_SIZE                       equ 0001h
I2C1CNTH_CNT9_LENGTH                     equ 0001h
I2C1CNTH_CNT9_MASK                       equ 0002h
I2C1CNTH_CNT10_POSN                      equ 0002h
I2C1CNTH_CNT10_POSITION                  equ 0002h
I2C1CNTH_CNT10_SIZE                      equ 0001h
I2C1CNTH_CNT10_LENGTH                    equ 0001h
I2C1CNTH_CNT10_MASK                      equ 0004h
I2C1CNTH_CNT11_POSN                      equ 0003h
I2C1CNTH_CNT11_POSITION                  equ 0003h
I2C1CNTH_CNT11_SIZE                      equ 0001h
I2C1CNTH_CNT11_LENGTH                    equ 0001h
I2C1CNTH_CNT11_MASK                      equ 0008h
I2C1CNTH_CNT12_POSN                      equ 0004h
I2C1CNTH_CNT12_POSITION                  equ 0004h
I2C1CNTH_CNT12_SIZE                      equ 0001h
I2C1CNTH_CNT12_LENGTH                    equ 0001h
I2C1CNTH_CNT12_MASK                      equ 0010h
I2C1CNTH_CNT13_POSN                      equ 0005h
I2C1CNTH_CNT13_POSITION                  equ 0005h
I2C1CNTH_CNT13_SIZE                      equ 0001h
I2C1CNTH_CNT13_LENGTH                    equ 0001h
I2C1CNTH_CNT13_MASK                      equ 0020h
I2C1CNTH_CNT14_POSN                      equ 0006h
I2C1CNTH_CNT14_POSITION                  equ 0006h
I2C1CNTH_CNT14_SIZE                      equ 0001h
I2C1CNTH_CNT14_LENGTH                    equ 0001h
I2C1CNTH_CNT14_MASK                      equ 0040h
I2C1CNTH_CNT15_POSN                      equ 0007h
I2C1CNTH_CNT15_POSITION                  equ 0007h
I2C1CNTH_CNT15_SIZE                      equ 0001h
I2C1CNTH_CNT15_LENGTH                    equ 0001h
I2C1CNTH_CNT15_MASK                      equ 0080h
I2C1CNTH_I2C1CNT_POSN                    equ 0000h
I2C1CNTH_I2C1CNT_POSITION                equ 0000h
I2C1CNTH_I2C1CNT_SIZE                    equ 0008h
I2C1CNTH_I2C1CNT_LENGTH                  equ 0008h
I2C1CNTH_I2C1CNT_MASK                    equ 00FFh
I2C1CNTH_I2C1CNT8_POSN                   equ 0000h
I2C1CNTH_I2C1CNT8_POSITION               equ 0000h
I2C1CNTH_I2C1CNT8_SIZE                   equ 0001h
I2C1CNTH_I2C1CNT8_LENGTH                 equ 0001h
I2C1CNTH_I2C1CNT8_MASK                   equ 0001h
I2C1CNTH_I2C1CNT9_POSN                   equ 0001h
I2C1CNTH_I2C1CNT9_POSITION               equ 0001h
I2C1CNTH_I2C1CNT9_SIZE                   equ 0001h
I2C1CNTH_I2C1CNT9_LENGTH                 equ 0001h
I2C1CNTH_I2C1CNT9_MASK                   equ 0002h
I2C1CNTH_I2C1CNT10_POSN                  equ 0002h
I2C1CNTH_I2C1CNT10_POSITION              equ 0002h
I2C1CNTH_I2C1CNT10_SIZE                  equ 0001h
I2C1CNTH_I2C1CNT10_LENGTH                equ 0001h
I2C1CNTH_I2C1CNT10_MASK                  equ 0004h
I2C1CNTH_I2C1CNT11_POSN                  equ 0003h
I2C1CNTH_I2C1CNT11_POSITION              equ 0003h
I2C1CNTH_I2C1CNT11_SIZE                  equ 0001h
I2C1CNTH_I2C1CNT11_LENGTH                equ 0001h
I2C1CNTH_I2C1CNT11_MASK                  equ 0008h
I2C1CNTH_I2C1CNT12_POSN                  equ 0004h
I2C1CNTH_I2C1CNT12_POSITION              equ 0004h
I2C1CNTH_I2C1CNT12_SIZE                  equ 0001h
I2C1CNTH_I2C1CNT12_LENGTH                equ 0001h
I2C1CNTH_I2C1CNT12_MASK                  equ 0010h
I2C1CNTH_I2C1CNT13_POSN                  equ 0005h
I2C1CNTH_I2C1CNT13_POSITION              equ 0005h
I2C1CNTH_I2C1CNT13_SIZE                  equ 0001h
I2C1CNTH_I2C1CNT13_LENGTH                equ 0001h
I2C1CNTH_I2C1CNT13_MASK                  equ 0020h
I2C1CNTH_I2C1CNT14_POSN                  equ 0006h
I2C1CNTH_I2C1CNT14_POSITION              equ 0006h
I2C1CNTH_I2C1CNT14_SIZE                  equ 0001h
I2C1CNTH_I2C1CNT14_LENGTH                equ 0001h
I2C1CNTH_I2C1CNT14_MASK                  equ 0040h
I2C1CNTH_I2C1CNT15_POSN                  equ 0007h
I2C1CNTH_I2C1CNT15_POSITION              equ 0007h
I2C1CNTH_I2C1CNT15_SIZE                  equ 0001h
I2C1CNTH_I2C1CNT15_LENGTH                equ 0001h
I2C1CNTH_I2C1CNT15_MASK                  equ 0080h

// Register: I2C1RXB
#define I2C1RXB I2C1RXB
I2C1RXB                                  equ 01EFh
// bitfield definitions
I2C1RXB_RXB_POSN                         equ 0000h
I2C1RXB_RXB_POSITION                     equ 0000h
I2C1RXB_RXB_SIZE                         equ 0008h
I2C1RXB_RXB_LENGTH                       equ 0008h
I2C1RXB_RXB_MASK                         equ 00FFh

// Register: I2C1TXB
#define I2C1TXB I2C1TXB
I2C1TXB                                  equ 01F0h
// bitfield definitions
I2C1TXB_TXB_POSN                         equ 0000h
I2C1TXB_TXB_POSITION                     equ 0000h
I2C1TXB_TXB_SIZE                         equ 0008h
I2C1TXB_TXB_LENGTH                       equ 0008h
I2C1TXB_TXB_MASK                         equ 00FFh

// Register: I2C1ADB0
#define I2C1ADB0 I2C1ADB0
I2C1ADB0                                 equ 01F1h
// bitfield definitions
I2C1ADB0_ADB_POSN                        equ 0000h
I2C1ADB0_ADB_POSITION                    equ 0000h
I2C1ADB0_ADB_SIZE                        equ 0008h
I2C1ADB0_ADB_LENGTH                      equ 0008h
I2C1ADB0_ADB_MASK                        equ 00FFh

