garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: ADCG1B
#define ADCG1B ADCG1B
ADCG1B                                   equ 0238h
// bitfield definitions
ADCG1B_CGB5_POSN                         equ 0005h
ADCG1B_CGB5_POSITION                     equ 0005h
ADCG1B_CGB5_SIZE                         equ 0001h
ADCG1B_CGB5_LENGTH                       equ 0001h
ADCG1B_CGB5_MASK                         equ 0020h
ADCG1B_CGB6_POSN                         equ 0006h
ADCG1B_CGB6_POSITION                     equ 0006h
ADCG1B_CGB6_SIZE                         equ 0001h
ADCG1B_CGB6_LENGTH                       equ 0001h
ADCG1B_CGB6_MASK                         equ 0040h
ADCG1B_CGB7_POSN                         equ 0007h
ADCG1B_CGB7_POSITION                     equ 0007h
ADCG1B_CGB7_SIZE                         equ 0001h
ADCG1B_CGB7_LENGTH                       equ 0001h
ADCG1B_CGB7_MASK                         equ 0080h

// Register: ADCG1C
#define ADCG1C ADCG1C
ADCG1C                                   equ 0239h
// bitfield definitions
ADCG1C_CGC0_POSN                         equ 0000h
ADCG1C_CGC0_POSITION                     equ 0000h
ADCG1C_CGC0_SIZE                         equ 0001h
ADCG1C_CGC0_LENGTH                       equ 0001h
ADCG1C_CGC0_MASK                         equ 0001h
ADCG1C_CGC1_POSN                         equ 0001h
ADCG1C_CGC1_POSITION                     equ 0001h
ADCG1C_CGC1_SIZE                         equ 0001h
ADCG1C_CGC1_LENGTH                       equ 0001h
ADCG1C_CGC1_MASK                         equ 0002h
ADCG1C_CGC3_POSN                         equ 0003h
ADCG1C_CGC3_POSITION                     equ 0003h
ADCG1C_CGC3_SIZE                         equ 0001h
ADCG1C_CGC3_LENGTH                       equ 0001h
ADCG1C_CGC3_MASK                         equ 0008h
ADCG1C_CGC4_POSN                         equ 0004h
ADCG1C_CGC4_POSITION                     equ 0004h
ADCG1C_CGC4_SIZE                         equ 0001h
ADCG1C_CGC4_LENGTH                       equ 0001h
ADCG1C_CGC4_MASK                         equ 0010h
ADCG1C_CGC5_POSN                         equ 0005h
ADCG1C_CGC5_POSITION                     equ 0005h
ADCG1C_CGC5_SIZE                         equ 0001h
ADCG1C_CGC5_LENGTH                       equ 0001h
ADCG1C_CGC5_MASK                         equ 0020h
ADCG1C_CGC6_POSN                         equ 0006h
ADCG1C_CGC6_POSITION                     equ 0006h
ADCG1C_CGC6_SIZE                         equ 0001h
ADCG1C_CGC6_LENGTH                       equ 0001h
ADCG1C_CGC6_MASK                         equ 0040h
ADCG1C_CGC7_POSN                         equ 0007h
ADCG1C_CGC7_POSITION                     equ 0007h
ADCG1C_CGC7_SIZE                         equ 0001h
ADCG1C_CGC7_LENGTH                       equ 0001h
ADCG1C_CGC7_MASK                         equ 0080h

// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0300h
// bitfield definitions
PMD0_DMA1MD_POSN                         equ 0000h
PMD0_DMA1MD_POSITION                     equ 0000h
PMD0_DMA1MD_SIZE                         equ 0001h
PMD0_DMA1MD_LENGTH                       equ 0001h
PMD0_DMA1MD_MASK                         equ 0001h
PMD0_DMA2MD_POSN                         equ 0001h
PMD0_DMA2MD_POSITION                     equ 0001h
PMD0_DMA2MD_SIZE                         equ 0001h
PMD0_DMA2MD_LENGTH                       equ 0001h
PMD0_DMA2MD_MASK                         equ 0002h
PMD0_DMA3MD_POSN                         equ 0002h
PMD0_DMA3MD_POSITION                     equ 0002h
PMD0_DMA3MD_SIZE                         equ 0001h
PMD0_DMA3MD_LENGTH                       equ 0001h
PMD0_DMA3MD_MASK                         equ 0004h
PMD0_DMA4MD_POSN                         equ 0003h
PMD0_DMA4MD_POSITION                     equ 0003h
PMD0_DMA4MD_SIZE                         equ 0001h
PMD0_DMA4MD_LENGTH                       equ 0001h
PMD0_DMA4MD_MASK                         equ 0008h
PMD0_CRCMD_POSN                          equ 0005h
PMD0_CRCMD_POSITION                      equ 0005h
PMD0_CRCMD_SIZE                          equ 0001h
PMD0_CRCMD_LENGTH                        equ 0001h
PMD0_CRCMD_MASK                          equ 0020h
PMD0_SCANMD_POSN                         equ 0006h
PMD0_SCANMD_POSITION                     equ 0006h
PMD0_SCANMD_SIZE                         equ 0001h
PMD0_SCANMD_LENGTH                       equ 0001h
PMD0_SCANMD_MASK                         equ 0040h
PMD0_SYSCMD_POSN                         equ 0007h
PMD0_SYSCMD_POSITION                     equ 0007h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0301h
// bitfield definitions
PMD1_ACTMD_POSN                          equ 0000h
PMD1_ACTMD_POSITION                      equ 0000h
PMD1_ACTMD_SIZE                          equ 0001h
PMD1_ACTMD_LENGTH                        equ 0001h
PMD1_ACTMD_MASK                          equ 0001h
PMD1_PORTWMD_POSN                        equ 0001h
PMD1_PORTWMD_POSITION                    equ 0001h
PMD1_PORTWMD_SIZE                        equ 0001h
PMD1_PORTWMD_LENGTH                      equ 0001h
PMD1_PORTWMD_MASK                        equ 0002h
PMD1_IOCMD_POSN                          equ 0002h
PMD1_IOCMD_POSITION                      equ 0002h
PMD1_IOCMD_SIZE                          equ 0001h
PMD1_IOCMD_LENGTH                        equ 0001h
PMD1_IOCMD_MASK                          equ 0004h
PMD1_CLKRMD_POSN                         equ 0003h
PMD1_CLKRMD_POSITION                     equ 0003h
PMD1_CLKRMD_SIZE                         equ 0001h
PMD1_CLKRMD_LENGTH                       equ 0001h
PMD1_CLKRMD_MASK                         equ 0008h
PMD1_TMR0MD_POSN                         equ 0004h
PMD1_TMR0MD_POSITION                     equ 0004h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0010h
PMD1_TMR1MD_POSN                         equ 0005h
PMD1_TMR1MD_POSITION                     equ 0005h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0020h
PMD1_TMR2MD_POSN                         equ 0006h
PMD1_TMR2MD_POSITION                     equ 0006h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0040h
PMD1_TMR4MD_POSN                         equ 0007h
PMD1_TMR4MD_POSITION                     equ 0007h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0080h

