garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 0477h
// bitfield definitions
PIE4_TMR2IE_POSN                         equ 0000h
PIE4_TMR2IE_POSITION                     equ 0000h
PIE4_TMR2IE_SIZE                         equ 0001h
PIE4_TMR2IE_LENGTH                       equ 0001h
PIE4_TMR2IE_MASK                         equ 0001h
PIE4_TMR4IE_POSN                         equ 0001h
PIE4_TMR4IE_POSITION                     equ 0001h
PIE4_TMR4IE_SIZE                         equ 0001h
PIE4_TMR4IE_LENGTH                       equ 0001h
PIE4_TMR4IE_MASK                         equ 0002h
PIE4_TU16AIE_POSN                        equ 0002h
PIE4_TU16AIE_POSITION                    equ 0002h
PIE4_TU16AIE_SIZE                        equ 0001h
PIE4_TU16AIE_LENGTH                      equ 0001h
PIE4_TU16AIE_MASK                        equ 0004h
PIE4_TU16BIE_POSN                        equ 0003h
PIE4_TU16BIE_POSITION                    equ 0003h
PIE4_TU16BIE_SIZE                        equ 0001h
PIE4_TU16BIE_LENGTH                      equ 0001h
PIE4_TU16BIE_MASK                        equ 0008h
PIE4_CCP1IE_POSN                         equ 0004h
PIE4_CCP1IE_POSITION                     equ 0004h
PIE4_CCP1IE_SIZE                         equ 0001h
PIE4_CCP1IE_LENGTH                       equ 0001h
PIE4_CCP1IE_MASK                         equ 0010h
PIE4_CCP2IE_POSN                         equ 0005h
PIE4_CCP2IE_POSITION                     equ 0005h
PIE4_CCP2IE_SIZE                         equ 0001h
PIE4_CCP2IE_LENGTH                       equ 0001h
PIE4_CCP2IE_MASK                         equ 0020h
PIE4_PWM1PIE_POSN                        equ 0006h
PIE4_PWM1PIE_POSITION                    equ 0006h
PIE4_PWM1PIE_SIZE                        equ 0001h
PIE4_PWM1PIE_LENGTH                      equ 0001h
PIE4_PWM1PIE_MASK                        equ 0040h
PIE4_PWM1IE_POSN                         equ 0007h
PIE4_PWM1IE_POSITION                     equ 0007h
PIE4_PWM1IE_SIZE                         equ 0001h
PIE4_PWM1IE_LENGTH                       equ 0001h
PIE4_PWM1IE_MASK                         equ 0080h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 0478h
// bitfield definitions
PIE5_PWM2PIE_POSN                        equ 0000h
PIE5_PWM2PIE_POSITION                    equ 0000h
PIE5_PWM2PIE_SIZE                        equ 0001h
PIE5_PWM2PIE_LENGTH                      equ 0001h
PIE5_PWM2PIE_MASK                        equ 0001h
PIE5_PWM2IE_POSN                         equ 0001h
PIE5_PWM2IE_POSITION                     equ 0001h
PIE5_PWM2IE_SIZE                         equ 0001h
PIE5_PWM2IE_LENGTH                       equ 0001h
PIE5_PWM2IE_MASK                         equ 0002h
PIE5_CWG1IE_POSN                         equ 0002h
PIE5_CWG1IE_POSITION                     equ 0002h
PIE5_CWG1IE_SIZE                         equ 0001h
PIE5_CWG1IE_LENGTH                       equ 0001h
PIE5_CWG1IE_MASK                         equ 0004h
PIE5_CLC1IE_POSN                         equ 0003h
PIE5_CLC1IE_POSITION                     equ 0003h
PIE5_CLC1IE_SIZE                         equ 0001h
PIE5_CLC1IE_LENGTH                       equ 0001h
PIE5_CLC1IE_MASK                         equ 0008h
PIE5_CLC2IE_POSN                         equ 0004h
PIE5_CLC2IE_POSITION                     equ 0004h
PIE5_CLC2IE_SIZE                         equ 0001h
PIE5_CLC2IE_LENGTH                       equ 0001h
PIE5_CLC2IE_MASK                         equ 0010h
PIE5_CLC3IE_POSN                         equ 0005h
PIE5_CLC3IE_POSITION                     equ 0005h
PIE5_CLC3IE_SIZE                         equ 0001h
PIE5_CLC3IE_LENGTH                       equ 0001h
PIE5_CLC3IE_MASK                         equ 0020h
PIE5_CLC4IE_POSN                         equ 0006h
PIE5_CLC4IE_POSITION                     equ 0006h
PIE5_CLC4IE_SIZE                         equ 0001h
PIE5_CLC4IE_LENGTH                       equ 0001h
PIE5_CLC4IE_MASK                         equ 0040h
PIE5_IOCSRIE_POSN                        equ 0007h
PIE5_IOCSRIE_POSITION                    equ 0007h
PIE5_IOCSRIE_SIZE                        equ 0001h
PIE5_IOCSRIE_LENGTH                      equ 0001h
PIE5_IOCSRIE_MASK                        equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 0479h
// bitfield definitions
PIE6_U1RXIE_POSN                         equ 0000h
PIE6_U1RXIE_POSITION                     equ 0000h
PIE6_U1RXIE_SIZE                         equ 0001h
PIE6_U1RXIE_LENGTH                       equ 0001h
PIE6_U1RXIE_MASK                         equ 0001h
PIE6_U1TXIE_POSN                         equ 0001h
PIE6_U1TXIE_POSITION                     equ 0001h
PIE6_U1TXIE_SIZE                         equ 0001h
PIE6_U1TXIE_LENGTH                       equ 0001h
PIE6_U1TXIE_MASK                         equ 0002h
PIE6_U1IE_POSN                           equ 0002h
PIE6_U1IE_POSITION                       equ 0002h
PIE6_U1IE_SIZE                           equ 0001h
PIE6_U1IE_LENGTH                         equ 0001h
PIE6_U1IE_MASK                           equ 0004h
PIE6_U1EIE_POSN                          equ 0003h
PIE6_U1EIE_POSITION                      equ 0003h
PIE6_U1EIE_SIZE                          equ 0001h
PIE6_U1EIE_LENGTH                        equ 0001h
PIE6_U1EIE_MASK                          equ 0008h
PIE6_U2RXIE_POSN                         equ 0004h
PIE6_U2RXIE_POSITION                     equ 0004h
PIE6_U2RXIE_SIZE                         equ 0001h
PIE6_U2RXIE_LENGTH                       equ 0001h
PIE6_U2RXIE_MASK                         equ 0010h
PIE6_U2TXIE_POSN                         equ 0005h
PIE6_U2TXIE_POSITION                     equ 0005h
PIE6_U2TXIE_SIZE                         equ 0001h
PIE6_U2TXIE_LENGTH                       equ 0001h
PIE6_U2TXIE_MASK                         equ 0020h
PIE6_U2IE_POSN                           equ 0006h
PIE6_U2IE_POSITION                       equ 0006h
PIE6_U2IE_SIZE                           equ 0001h
PIE6_U2IE_LENGTH                         equ 0001h
PIE6_U2IE_MASK                           equ 0040h
PIE6_U2EIE_POSN                          equ 0007h
PIE6_U2EIE_POSITION                      equ 0007h
PIE6_U2EIE_SIZE                          equ 0001h
PIE6_U2EIE_LENGTH                        equ 0001h
PIE6_U2EIE_MASK                          equ 0080h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 047Ah
// bitfield definitions
PIE7_SPI1RXIE_POSN                       equ 0000h
PIE7_SPI1RXIE_POSITION                   equ 0000h
PIE7_SPI1RXIE_SIZE                       equ 0001h
PIE7_SPI1RXIE_LENGTH                     equ 0001h
PIE7_SPI1RXIE_MASK                       equ 0001h
PIE7_SPI1TXIE_POSN                       equ 0001h
PIE7_SPI1TXIE_POSITION                   equ 0001h
PIE7_SPI1TXIE_SIZE                       equ 0001h
PIE7_SPI1TXIE_LENGTH                     equ 0001h
PIE7_SPI1TXIE_MASK                       equ 0002h
PIE7_SPI1IE_POSN                         equ 0002h
PIE7_SPI1IE_POSITION                     equ 0002h
PIE7_SPI1IE_SIZE                         equ 0001h
PIE7_SPI1IE_LENGTH                       equ 0001h
PIE7_SPI1IE_MASK                         equ 0004h
PIE7_I2C1RXIE_POSN                       equ 0003h
PIE7_I2C1RXIE_POSITION                   equ 0003h
PIE7_I2C1RXIE_SIZE                       equ 0001h
PIE7_I2C1RXIE_LENGTH                     equ 0001h
PIE7_I2C1RXIE_MASK                       equ 0008h
PIE7_I2C1TXIE_POSN                       equ 0004h
PIE7_I2C1TXIE_POSITION                   equ 0004h
PIE7_I2C1TXIE_SIZE                       equ 0001h
PIE7_I2C1TXIE_LENGTH                     equ 0001h
PIE7_I2C1TXIE_MASK                       equ 0010h
PIE7_I2C1IE_POSN                         equ 0005h
PIE7_I2C1IE_POSITION                     equ 0005h
PIE7_I2C1IE_SIZE                         equ 0001h
PIE7_I2C1IE_LENGTH                       equ 0001h
PIE7_I2C1IE_MASK                         equ 0020h
PIE7_I2C1EIE_POSN                        equ 0006h
PIE7_I2C1EIE_POSITION                    equ 0006h
PIE7_I2C1EIE_SIZE                        equ 0001h
PIE7_I2C1EIE_LENGTH                      equ 0001h
PIE7_I2C1EIE_MASK                        equ 0040h

// Register: PIE8
#define PIE8 PIE8
PIE8                                     equ 047Bh
// bitfield definitions
PIE8_I3C1RXIE_POSN                       equ 0000h
PIE8_I3C1RXIE_POSITION                   equ 0000h
PIE8_I3C1RXIE_SIZE                       equ 0001h
PIE8_I3C1RXIE_LENGTH                     equ 0001h
PIE8_I3C1RXIE_MASK                       equ 0001h
PIE8_I3C1TXIE_POSN                       equ 0001h
PIE8_I3C1TXIE_POSITION                   equ 0001h
PIE8_I3C1TXIE_SIZE                       equ 0001h
PIE8_I3C1TXIE_LENGTH                     equ 0001h
PIE8_I3C1TXIE_MASK                       equ 0002h
PIE8_I3C1IE_POSN                         equ 0002h
PIE8_I3C1IE_POSITION                     equ 0002h
PIE8_I3C1IE_SIZE                         equ 0001h
PIE8_I3C1IE_LENGTH                       equ 0001h
PIE8_I3C1IE_MASK                         equ 0004h
PIE8_I3C1EIE_POSN                        equ 0003h
PIE8_I3C1EIE_POSITION                    equ 0003h
PIE8_I3C1EIE_SIZE                        equ 0001h
PIE8_I3C1EIE_LENGTH                      equ 0001h
PIE8_I3C1EIE_MASK                        equ 0008h
PIE8_I3C1RIE_POSN                        equ 0004h
PIE8_I3C1RIE_POSITION                    equ 0004h
PIE8_I3C1RIE_SIZE                        equ 0001h
PIE8_I3C1RIE_LENGTH                      equ 0001h
PIE8_I3C1RIE_MASK                        equ 0010h

// Register: PIE9
#define PIE9 PIE9
PIE9                                     equ 047Ch
// bitfield definitions
PIE9_I3C2RXIE_POSN                       equ 0000h
PIE9_I3C2RXIE_POSITION                   equ 0000h
PIE9_I3C2RXIE_SIZE                       equ 0001h
PIE9_I3C2RXIE_LENGTH                     equ 0001h
PIE9_I3C2RXIE_MASK                       equ 0001h
PIE9_I3C2TXIE_POSN                       equ 0001h
PIE9_I3C2TXIE_POSITION                   equ 0001h
PIE9_I3C2TXIE_SIZE                       equ 0001h
PIE9_I3C2TXIE_LENGTH                     equ 0001h
PIE9_I3C2TXIE_MASK                       equ 0002h
PIE9_I3C2IE_POSN                         equ 0002h
PIE9_I3C2IE_POSITION                     equ 0002h
PIE9_I3C2IE_SIZE                         equ 0001h
PIE9_I3C2IE_LENGTH                       equ 0001h
PIE9_I3C2IE_MASK                         equ 0004h
PIE9_I3C2EIE_POSN                        equ 0003h
PIE9_I3C2EIE_POSITION                    equ 0003h
PIE9_I3C2EIE_SIZE                        equ 0001h
PIE9_I3C2EIE_LENGTH                      equ 0001h
PIE9_I3C2EIE_MASK                        equ 0008h
PIE9_I3C2RIE_POSN                        equ 0004h
PIE9_I3C2RIE_POSITION                    equ 0004h
PIE9_I3C2RIE_SIZE                        equ 0001h
PIE9_I3C2RIE_LENGTH                      equ 0001h
PIE9_I3C2RIE_MASK                        equ 0010h
PIE9_HLVDIE_POSN                         equ 0005h
PIE9_HLVDIE_POSITION                     equ 0005h
PIE9_HLVDIE_SIZE                         equ 0001h
PIE9_HLVDIE_LENGTH                       equ 0001h
PIE9_HLVDIE_MASK                         equ 0020h
PIE9_ADIE_POSN                           equ 0006h
PIE9_ADIE_POSITION                       equ 0006h
PIE9_ADIE_SIZE                           equ 0001h
PIE9_ADIE_LENGTH                         equ 0001h
PIE9_ADIE_MASK                           equ 0040h
PIE9_ADTIE_POSN                          equ 0007h
PIE9_ADTIE_POSITION                      equ 0007h
PIE9_ADTIE_SIZE                          equ 0001h
PIE9_ADTIE_LENGTH                        equ 0001h
PIE9_ADTIE_MASK                          equ 0080h

// Register: IPR0
#define IPR0 IPR0
IPR0                                     equ 047Dh
// bitfield definitions
IPR0_SWIP_POSN                           equ 0000h
IPR0_SWIP_POSITION                       equ 0000h
IPR0_SWIP_SIZE                           equ 0001h
IPR0_SWIP_LENGTH                         equ 0001h
IPR0_SWIP_MASK                           equ 0001h
IPR0_INT0IP_POSN                         equ 0001h
IPR0_INT0IP_POSITION                     equ 0001h
IPR0_INT0IP_SIZE                         equ 0001h
IPR0_INT0IP_LENGTH                       equ 0001h
IPR0_INT0IP_MASK                         equ 0002h
IPR0_INT1IP_POSN                         equ 0002h
IPR0_INT1IP_POSITION                     equ 0002h
IPR0_INT1IP_SIZE                         equ 0001h
IPR0_INT1IP_LENGTH                       equ 0001h
IPR0_INT1IP_MASK                         equ 0004h
IPR0_INT2IP_POSN                         equ 0003h
IPR0_INT2IP_POSITION                     equ 0003h
IPR0_INT2IP_SIZE                         equ 0001h
IPR0_INT2IP_LENGTH                       equ 0001h
IPR0_INT2IP_MASK                         equ 0008h
IPR0_DMA1SCNTIP_POSN                     equ 0004h
IPR0_DMA1SCNTIP_POSITION                 equ 0004h
IPR0_DMA1SCNTIP_SIZE                     equ 0001h
IPR0_DMA1SCNTIP_LENGTH                   equ 0001h
IPR0_DMA1SCNTIP_MASK                     equ 0010h
IPR0_DMA1DCNTIP_POSN                     equ 0005h
IPR0_DMA1DCNTIP_POSITION                 equ 0005h
IPR0_DMA1DCNTIP_SIZE                     equ 0001h
IPR0_DMA1DCNTIP_LENGTH                   equ 0001h
IPR0_DMA1DCNTIP_MASK                     equ 0020h
IPR0_DMA1ORIP_POSN                       equ 0006h
IPR0_DMA1ORIP_POSITION                   equ 0006h
IPR0_DMA1ORIP_SIZE                       equ 0001h
IPR0_DMA1ORIP_LENGTH                     equ 0001h
IPR0_DMA1ORIP_MASK                       equ 0040h
IPR0_DMA1AIP_POSN                        equ 0007h
IPR0_DMA1AIP_POSITION                    equ 0007h
IPR0_DMA1AIP_SIZE                        equ 0001h
IPR0_DMA1AIP_LENGTH                      equ 0001h
IPR0_DMA1AIP_MASK                        equ 0080h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 047Eh
// bitfield definitions
IPR1_DMA2SCNTIP_POSN                     equ 0000h
IPR1_DMA2SCNTIP_POSITION                 equ 0000h
IPR1_DMA2SCNTIP_SIZE                     equ 0001h
IPR1_DMA2SCNTIP_LENGTH                   equ 0001h
IPR1_DMA2SCNTIP_MASK                     equ 0001h
IPR1_DMA2DCNTIP_POSN                     equ 0001h
IPR1_DMA2DCNTIP_POSITION                 equ 0001h
IPR1_DMA2DCNTIP_SIZE                     equ 0001h
IPR1_DMA2DCNTIP_LENGTH                   equ 0001h
IPR1_DMA2DCNTIP_MASK                     equ 0002h
IPR1_DMA2ORIP_POSN                       equ 0002h
IPR1_DMA2ORIP_POSITION                   equ 0002h
IPR1_DMA2ORIP_SIZE                       equ 0001h
IPR1_DMA2ORIP_LENGTH                     equ 0001h
IPR1_DMA2ORIP_MASK                       equ 0004h
IPR1_DMA2AIP_POSN                        equ 0003h
IPR1_DMA2AIP_POSITION                    equ 0003h
IPR1_DMA2AIP_SIZE                        equ 0001h
IPR1_DMA2AIP_LENGTH                      equ 0001h
IPR1_DMA2AIP_MASK                        equ 0008h
IPR1_DMA3SCNTIP_POSN                     equ 0004h
IPR1_DMA3SCNTIP_POSITION                 equ 0004h
IPR1_DMA3SCNTIP_SIZE                     equ 0001h
IPR1_DMA3SCNTIP_LENGTH                   equ 0001h
IPR1_DMA3SCNTIP_MASK                     equ 0010h
IPR1_DMA3DCNTIP_POSN                     equ 0005h
IPR1_DMA3DCNTIP_POSITION                 equ 0005h
IPR1_DMA3DCNTIP_SIZE                     equ 0001h
IPR1_DMA3DCNTIP_LENGTH                   equ 0001h
IPR1_DMA3DCNTIP_MASK                     equ 0020h
IPR1_DMA3ORIP_POSN                       equ 0006h
IPR1_DMA3ORIP_POSITION                   equ 0006h
IPR1_DMA3ORIP_SIZE                       equ 0001h
IPR1_DMA3ORIP_LENGTH                     equ 0001h
IPR1_DMA3ORIP_MASK                       equ 0040h
IPR1_DMA3AIP_POSN                        equ 0007h
IPR1_DMA3AIP_POSITION                    equ 0007h
IPR1_DMA3AIP_SIZE                        equ 0001h
IPR1_DMA3AIP_LENGTH                      equ 0001h
IPR1_DMA3AIP_MASK                        equ 0080h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 047Fh
// bitfield definitions
IPR2_DMA4SCNTIP_POSN                     equ 0000h
IPR2_DMA4SCNTIP_POSITION                 equ 0000h
IPR2_DMA4SCNTIP_SIZE                     equ 0001h
IPR2_DMA4SCNTIP_LENGTH                   equ 0001h
IPR2_DMA4SCNTIP_MASK                     equ 0001h
IPR2_DMA4DCNTIP_POSN                     equ 0001h
IPR2_DMA4DCNTIP_POSITION                 equ 0001h
IPR2_DMA4DCNTIP_SIZE                     equ 0001h
IPR2_DMA4DCNTIP_LENGTH                   equ 0001h
IPR2_DMA4DCNTIP_MASK                     equ 0002h
IPR2_DMA4ORIP_POSN                       equ 0002h
IPR2_DMA4ORIP_POSITION                   equ 0002h
IPR2_DMA4ORIP_SIZE                       equ 0001h
IPR2_DMA4ORIP_LENGTH                     equ 0001h
IPR2_DMA4ORIP_MASK                       equ 0004h
IPR2_DMA4AIP_POSN                        equ 0003h
IPR2_DMA4AIP_POSITION                    equ 0003h
IPR2_DMA4AIP_SIZE                        equ 0001h
IPR2_DMA4AIP_LENGTH                      equ 0001h
IPR2_DMA4AIP_MASK                        equ 0008h
IPR2_NVMIP_POSN                          equ 0004h
IPR2_NVMIP_POSITION                      equ 0004h
IPR2_NVMIP_SIZE                          equ 0001h
IPR2_NVMIP_LENGTH                        equ 0001h
IPR2_NVMIP_MASK                          equ 0010h
IPR2_CRCIP_POSN                          equ 0005h
IPR2_CRCIP_POSITION                      equ 0005h
IPR2_CRCIP_SIZE                          equ 0001h
IPR2_CRCIP_LENGTH                        equ 0001h
IPR2_CRCIP_MASK                          equ 0020h
IPR2_SCANIP_POSN                         equ 0006h
IPR2_SCANIP_POSITION                     equ 0006h
IPR2_SCANIP_SIZE                         equ 0001h
IPR2_SCANIP_LENGTH                       equ 0001h
IPR2_SCANIP_MASK                         equ 0040h
IPR2_ACTIP_POSN                          equ 0007h
IPR2_ACTIP_POSITION                      equ 0007h
IPR2_ACTIP_SIZE                          equ 0001h
IPR2_ACTIP_LENGTH                        equ 0001h
IPR2_ACTIP_MASK                          equ 0080h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0480h
// bitfield definitions
IPR3_CSWIP_POSN                          equ 0000h
IPR3_CSWIP_POSITION                      equ 0000h
IPR3_CSWIP_SIZE                          equ 0001h
IPR3_CSWIP_LENGTH                        equ 0001h
IPR3_CSWIP_MASK                          equ 0001h
IPR3_OSFIP_POSN                          equ 0001h
IPR3_OSFIP_POSITION                      equ 0001h
IPR3_OSFIP_SIZE                          equ 0001h
IPR3_OSFIP_LENGTH                        equ 0001h
IPR3_OSFIP_MASK                          equ 0002h
IPR3_VDDIO2IP_POSN                       equ 0002h
IPR3_VDDIO2IP_POSITION                   equ 0002h
IPR3_VDDIO2IP_SIZE                       equ 0001h
IPR3_VDDIO2IP_LENGTH                     equ 0001h
IPR3_VDDIO2IP_MASK                       equ 0004h
IPR3_VDDIO3IP_POSN                       equ 0003h
IPR3_VDDIO3IP_POSITION                   equ 0003h
IPR3_VDDIO3IP_SIZE                       equ 0001h
IPR3_VDDIO3IP_LENGTH                     equ 0001h
IPR3_VDDIO3IP_MASK                       equ 0008h
IPR3_IOCIP_POSN                          equ 0004h
IPR3_IOCIP_POSITION                      equ 0004h
IPR3_IOCIP_SIZE                          equ 0001h
IPR3_IOCIP_LENGTH                        equ 0001h
IPR3_IOCIP_MASK                          equ 0010h
IPR3_TMR0IP_POSN                         equ 0005h
IPR3_TMR0IP_POSITION                     equ 0005h
IPR3_TMR0IP_SIZE                         equ 0001h
IPR3_TMR0IP_LENGTH                       equ 0001h
IPR3_TMR0IP_MASK                         equ 0020h
IPR3_TMR1IP_POSN                         equ 0006h
IPR3_TMR1IP_POSITION                     equ 0006h
IPR3_TMR1IP_SIZE                         equ 0001h
IPR3_TMR1IP_LENGTH                       equ 0001h
IPR3_TMR1IP_MASK                         equ 0040h
IPR3_TMR1GIP_POSN                        equ 0007h
IPR3_TMR1GIP_POSITION                    equ 0007h
IPR3_TMR1GIP_SIZE                        equ 0001h
IPR3_TMR1GIP_LENGTH                      equ 0001h
IPR3_TMR1GIP_MASK                        equ 0080h

