garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 0481h
// bitfield definitions
IPR4_TMR2IP_POSN                         equ 0000h
IPR4_TMR2IP_POSITION                     equ 0000h
IPR4_TMR2IP_SIZE                         equ 0001h
IPR4_TMR2IP_LENGTH                       equ 0001h
IPR4_TMR2IP_MASK                         equ 0001h
IPR4_TMR4IP_POSN                         equ 0001h
IPR4_TMR4IP_POSITION                     equ 0001h
IPR4_TMR4IP_SIZE                         equ 0001h
IPR4_TMR4IP_LENGTH                       equ 0001h
IPR4_TMR4IP_MASK                         equ 0002h
IPR4_TU16AIP_POSN                        equ 0002h
IPR4_TU16AIP_POSITION                    equ 0002h
IPR4_TU16AIP_SIZE                        equ 0001h
IPR4_TU16AIP_LENGTH                      equ 0001h
IPR4_TU16AIP_MASK                        equ 0004h
IPR4_TU16BIP_POSN                        equ 0003h
IPR4_TU16BIP_POSITION                    equ 0003h
IPR4_TU16BIP_SIZE                        equ 0001h
IPR4_TU16BIP_LENGTH                      equ 0001h
IPR4_TU16BIP_MASK                        equ 0008h
IPR4_CCP1IP_POSN                         equ 0004h
IPR4_CCP1IP_POSITION                     equ 0004h
IPR4_CCP1IP_SIZE                         equ 0001h
IPR4_CCP1IP_LENGTH                       equ 0001h
IPR4_CCP1IP_MASK                         equ 0010h
IPR4_CCP2IP_POSN                         equ 0005h
IPR4_CCP2IP_POSITION                     equ 0005h
IPR4_CCP2IP_SIZE                         equ 0001h
IPR4_CCP2IP_LENGTH                       equ 0001h
IPR4_CCP2IP_MASK                         equ 0020h
IPR4_PWM1PIP_POSN                        equ 0006h
IPR4_PWM1PIP_POSITION                    equ 0006h
IPR4_PWM1PIP_SIZE                        equ 0001h
IPR4_PWM1PIP_LENGTH                      equ 0001h
IPR4_PWM1PIP_MASK                        equ 0040h
IPR4_PWM1IP_POSN                         equ 0007h
IPR4_PWM1IP_POSITION                     equ 0007h
IPR4_PWM1IP_SIZE                         equ 0001h
IPR4_PWM1IP_LENGTH                       equ 0001h
IPR4_PWM1IP_MASK                         equ 0080h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 0482h
// bitfield definitions
IPR5_PWM2PIP_POSN                        equ 0000h
IPR5_PWM2PIP_POSITION                    equ 0000h
IPR5_PWM2PIP_SIZE                        equ 0001h
IPR5_PWM2PIP_LENGTH                      equ 0001h
IPR5_PWM2PIP_MASK                        equ 0001h
IPR5_PWM2IP_POSN                         equ 0001h
IPR5_PWM2IP_POSITION                     equ 0001h
IPR5_PWM2IP_SIZE                         equ 0001h
IPR5_PWM2IP_LENGTH                       equ 0001h
IPR5_PWM2IP_MASK                         equ 0002h
IPR5_CWG1IP_POSN                         equ 0002h
IPR5_CWG1IP_POSITION                     equ 0002h
IPR5_CWG1IP_SIZE                         equ 0001h
IPR5_CWG1IP_LENGTH                       equ 0001h
IPR5_CWG1IP_MASK                         equ 0004h
IPR5_CLC1IP_POSN                         equ 0003h
IPR5_CLC1IP_POSITION                     equ 0003h
IPR5_CLC1IP_SIZE                         equ 0001h
IPR5_CLC1IP_LENGTH                       equ 0001h
IPR5_CLC1IP_MASK                         equ 0008h
IPR5_CLC2IP_POSN                         equ 0004h
IPR5_CLC2IP_POSITION                     equ 0004h
IPR5_CLC2IP_SIZE                         equ 0001h
IPR5_CLC2IP_LENGTH                       equ 0001h
IPR5_CLC2IP_MASK                         equ 0010h
IPR5_CLC3IP_POSN                         equ 0005h
IPR5_CLC3IP_POSITION                     equ 0005h
IPR5_CLC3IP_SIZE                         equ 0001h
IPR5_CLC3IP_LENGTH                       equ 0001h
IPR5_CLC3IP_MASK                         equ 0020h
IPR5_CLC4IP_POSN                         equ 0006h
IPR5_CLC4IP_POSITION                     equ 0006h
IPR5_CLC4IP_SIZE                         equ 0001h
IPR5_CLC4IP_LENGTH                       equ 0001h
IPR5_CLC4IP_MASK                         equ 0040h
IPR5_IOCSRIP_POSN                        equ 0007h
IPR5_IOCSRIP_POSITION                    equ 0007h
IPR5_IOCSRIP_SIZE                        equ 0001h
IPR5_IOCSRIP_LENGTH                      equ 0001h
IPR5_IOCSRIP_MASK                        equ 0080h

// Register: IPR6
#define IPR6 IPR6
IPR6                                     equ 0483h
// bitfield definitions
IPR6_U1RXIP_POSN                         equ 0000h
IPR6_U1RXIP_POSITION                     equ 0000h
IPR6_U1RXIP_SIZE                         equ 0001h
IPR6_U1RXIP_LENGTH                       equ 0001h
IPR6_U1RXIP_MASK                         equ 0001h
IPR6_U1TXIP_POSN                         equ 0001h
IPR6_U1TXIP_POSITION                     equ 0001h
IPR6_U1TXIP_SIZE                         equ 0001h
IPR6_U1TXIP_LENGTH                       equ 0001h
IPR6_U1TXIP_MASK                         equ 0002h
IPR6_U1IP_POSN                           equ 0002h
IPR6_U1IP_POSITION                       equ 0002h
IPR6_U1IP_SIZE                           equ 0001h
IPR6_U1IP_LENGTH                         equ 0001h
IPR6_U1IP_MASK                           equ 0004h
IPR6_U1EIP_POSN                          equ 0003h
IPR6_U1EIP_POSITION                      equ 0003h
IPR6_U1EIP_SIZE                          equ 0001h
IPR6_U1EIP_LENGTH                        equ 0001h
IPR6_U1EIP_MASK                          equ 0008h
IPR6_U2RXIP_POSN                         equ 0004h
IPR6_U2RXIP_POSITION                     equ 0004h
IPR6_U2RXIP_SIZE                         equ 0001h
IPR6_U2RXIP_LENGTH                       equ 0001h
IPR6_U2RXIP_MASK                         equ 0010h
IPR6_U2TXIP_POSN                         equ 0005h
IPR6_U2TXIP_POSITION                     equ 0005h
IPR6_U2TXIP_SIZE                         equ 0001h
IPR6_U2TXIP_LENGTH                       equ 0001h
IPR6_U2TXIP_MASK                         equ 0020h
IPR6_U2IP_POSN                           equ 0006h
IPR6_U2IP_POSITION                       equ 0006h
IPR6_U2IP_SIZE                           equ 0001h
IPR6_U2IP_LENGTH                         equ 0001h
IPR6_U2IP_MASK                           equ 0040h
IPR6_U2EIP_POSN                          equ 0007h
IPR6_U2EIP_POSITION                      equ 0007h
IPR6_U2EIP_SIZE                          equ 0001h
IPR6_U2EIP_LENGTH                        equ 0001h
IPR6_U2EIP_MASK                          equ 0080h

// Register: IPR7
#define IPR7 IPR7
IPR7                                     equ 0484h
// bitfield definitions
IPR7_SPI1RXIP_POSN                       equ 0000h
IPR7_SPI1RXIP_POSITION                   equ 0000h
IPR7_SPI1RXIP_SIZE                       equ 0001h
IPR7_SPI1RXIP_LENGTH                     equ 0001h
IPR7_SPI1RXIP_MASK                       equ 0001h
IPR7_SPI1TXIP_POSN                       equ 0001h
IPR7_SPI1TXIP_POSITION                   equ 0001h
IPR7_SPI1TXIP_SIZE                       equ 0001h
IPR7_SPI1TXIP_LENGTH                     equ 0001h
IPR7_SPI1TXIP_MASK                       equ 0002h
IPR7_SPI1IP_POSN                         equ 0002h
IPR7_SPI1IP_POSITION                     equ 0002h
IPR7_SPI1IP_SIZE                         equ 0001h
IPR7_SPI1IP_LENGTH                       equ 0001h
IPR7_SPI1IP_MASK                         equ 0004h
IPR7_I2C1RXIP_POSN                       equ 0003h
IPR7_I2C1RXIP_POSITION                   equ 0003h
IPR7_I2C1RXIP_SIZE                       equ 0001h
IPR7_I2C1RXIP_LENGTH                     equ 0001h
IPR7_I2C1RXIP_MASK                       equ 0008h
IPR7_I2C1TXIP_POSN                       equ 0004h
IPR7_I2C1TXIP_POSITION                   equ 0004h
IPR7_I2C1TXIP_SIZE                       equ 0001h
IPR7_I2C1TXIP_LENGTH                     equ 0001h
IPR7_I2C1TXIP_MASK                       equ 0010h
IPR7_I2C1IP_POSN                         equ 0005h
IPR7_I2C1IP_POSITION                     equ 0005h
IPR7_I2C1IP_SIZE                         equ 0001h
IPR7_I2C1IP_LENGTH                       equ 0001h
IPR7_I2C1IP_MASK                         equ 0020h
IPR7_I2C1EIP_POSN                        equ 0006h
IPR7_I2C1EIP_POSITION                    equ 0006h
IPR7_I2C1EIP_SIZE                        equ 0001h
IPR7_I2C1EIP_LENGTH                      equ 0001h
IPR7_I2C1EIP_MASK                        equ 0040h

// Register: IPR8
#define IPR8 IPR8
IPR8                                     equ 0485h
// bitfield definitions
IPR8_I3C1RXIP_POSN                       equ 0000h
IPR8_I3C1RXIP_POSITION                   equ 0000h
IPR8_I3C1RXIP_SIZE                       equ 0001h
IPR8_I3C1RXIP_LENGTH                     equ 0001h
IPR8_I3C1RXIP_MASK                       equ 0001h
IPR8_I3C1TXIP_POSN                       equ 0001h
IPR8_I3C1TXIP_POSITION                   equ 0001h
IPR8_I3C1TXIP_SIZE                       equ 0001h
IPR8_I3C1TXIP_LENGTH                     equ 0001h
IPR8_I3C1TXIP_MASK                       equ 0002h
IPR8_I3C1IP_POSN                         equ 0002h
IPR8_I3C1IP_POSITION                     equ 0002h
IPR8_I3C1IP_SIZE                         equ 0001h
IPR8_I3C1IP_LENGTH                       equ 0001h
IPR8_I3C1IP_MASK                         equ 0004h
IPR8_I3C1EIP_POSN                        equ 0003h
IPR8_I3C1EIP_POSITION                    equ 0003h
IPR8_I3C1EIP_SIZE                        equ 0001h
IPR8_I3C1EIP_LENGTH                      equ 0001h
IPR8_I3C1EIP_MASK                        equ 0008h
IPR8_I3C1RIP_POSN                        equ 0004h
IPR8_I3C1RIP_POSITION                    equ 0004h
IPR8_I3C1RIP_SIZE                        equ 0001h
IPR8_I3C1RIP_LENGTH                      equ 0001h
IPR8_I3C1RIP_MASK                        equ 0010h

// Register: IPR9
#define IPR9 IPR9
IPR9                                     equ 0486h
// bitfield definitions
IPR9_I3C2RXIP_POSN                       equ 0000h
IPR9_I3C2RXIP_POSITION                   equ 0000h
IPR9_I3C2RXIP_SIZE                       equ 0001h
IPR9_I3C2RXIP_LENGTH                     equ 0001h
IPR9_I3C2RXIP_MASK                       equ 0001h
IPR9_I3C2TXIP_POSN                       equ 0001h
IPR9_I3C2TXIP_POSITION                   equ 0001h
IPR9_I3C2TXIP_SIZE                       equ 0001h
IPR9_I3C2TXIP_LENGTH                     equ 0001h
IPR9_I3C2TXIP_MASK                       equ 0002h
IPR9_I3C2IP_POSN                         equ 0002h
IPR9_I3C2IP_POSITION                     equ 0002h
IPR9_I3C2IP_SIZE                         equ 0001h
IPR9_I3C2IP_LENGTH                       equ 0001h
IPR9_I3C2IP_MASK                         equ 0004h
IPR9_I3C2EIP_POSN                        equ 0003h
IPR9_I3C2EIP_POSITION                    equ 0003h
IPR9_I3C2EIP_SIZE                        equ 0001h
IPR9_I3C2EIP_LENGTH                      equ 0001h
IPR9_I3C2EIP_MASK                        equ 0008h
IPR9_I3C2RIP_POSN                        equ 0004h
IPR9_I3C2RIP_POSITION                    equ 0004h
IPR9_I3C2RIP_SIZE                        equ 0001h
IPR9_I3C2RIP_LENGTH                      equ 0001h
IPR9_I3C2RIP_MASK                        equ 0010h
IPR9_HLVDIP_POSN                         equ 0005h
IPR9_HLVDIP_POSITION                     equ 0005h
IPR9_HLVDIP_SIZE                         equ 0001h
IPR9_HLVDIP_LENGTH                       equ 0001h
IPR9_HLVDIP_MASK                         equ 0020h
IPR9_ADIP_POSN                           equ 0006h
IPR9_ADIP_POSITION                       equ 0006h
IPR9_ADIP_SIZE                           equ 0001h
IPR9_ADIP_LENGTH                         equ 0001h
IPR9_ADIP_MASK                           equ 0040h
IPR9_ADTIP_POSN                          equ 0007h
IPR9_ADTIP_POSITION                      equ 0007h
IPR9_ADTIP_SIZE                          equ 0001h
IPR9_ADTIP_LENGTH                        equ 0001h
IPR9_ADTIP_MASK                          equ 0080h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0487h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0488h
// bitfield definitions
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h

// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 0489h
// bitfield definitions
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC3_POSN                           equ 0003h
PORTC_RC3_POSITION                       equ 0003h
PORTC_RC3_SIZE                           equ 0001h
PORTC_RC3_LENGTH                         equ 0001h
PORTC_RC3_MASK                           equ 0008h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_RC6_POSN                           equ 0006h
PORTC_RC6_POSITION                       equ 0006h
PORTC_RC6_SIZE                           equ 0001h
PORTC_RC6_LENGTH                         equ 0001h
PORTC_RC6_MASK                           equ 0040h
PORTC_RC7_POSN                           equ 0007h
PORTC_RC7_POSITION                       equ 0007h
PORTC_RC7_SIZE                           equ 0001h
PORTC_RC7_LENGTH                         equ 0001h
PORTC_RC7_MASK                           equ 0080h

// Register: TRISA
#define TRISA TRISA
TRISA                                    equ 048Dh
// bitfield definitions
TRISA_TRISA0_POSN                        equ 0000h
TRISA_TRISA0_POSITION                    equ 0000h
TRISA_TRISA0_SIZE                        equ 0001h
TRISA_TRISA0_LENGTH                      equ 0001h
TRISA_TRISA0_MASK                        equ 0001h
TRISA_TRISA1_POSN                        equ 0001h
TRISA_TRISA1_POSITION                    equ 0001h
TRISA_TRISA1_SIZE                        equ 0001h
TRISA_TRISA1_LENGTH                      equ 0001h
TRISA_TRISA1_MASK                        equ 0002h
TRISA_TRISA2_POSN                        equ 0002h
TRISA_TRISA2_POSITION                    equ 0002h
TRISA_TRISA2_SIZE                        equ 0001h
TRISA_TRISA2_LENGTH                      equ 0001h
TRISA_TRISA2_MASK                        equ 0004h
TRISA_TRISA4_POSN                        equ 0004h
TRISA_TRISA4_POSITION                    equ 0004h
TRISA_TRISA4_SIZE                        equ 0001h
TRISA_TRISA4_LENGTH                      equ 0001h
TRISA_TRISA4_MASK                        equ 0010h
TRISA_TRISA5_POSN                        equ 0005h
TRISA_TRISA5_POSITION                    equ 0005h
TRISA_TRISA5_SIZE                        equ 0001h
TRISA_TRISA5_LENGTH                      equ 0001h
TRISA_TRISA5_MASK                        equ 0020h

// Register: TRISB
#define TRISB TRISB
TRISB                                    equ 048Eh
// bitfield definitions
TRISB_TRISB5_POSN                        equ 0005h
TRISB_TRISB5_POSITION                    equ 0005h
TRISB_TRISB5_SIZE                        equ 0001h
TRISB_TRISB5_LENGTH                      equ 0001h
TRISB_TRISB5_MASK                        equ 0020h
TRISB_TRISB6_POSN                        equ 0006h
TRISB_TRISB6_POSITION                    equ 0006h
TRISB_TRISB6_SIZE                        equ 0001h
TRISB_TRISB6_LENGTH                      equ 0001h
TRISB_TRISB6_MASK                        equ 0040h
TRISB_TRISB7_POSN                        equ 0007h
TRISB_TRISB7_POSITION                    equ 0007h
TRISB_TRISB7_SIZE                        equ 0001h
TRISB_TRISB7_LENGTH                      equ 0001h
TRISB_TRISB7_MASK                        equ 0080h

// Register: TRISC
#define TRISC TRISC
TRISC                                    equ 048Fh
// bitfield definitions
TRISC_TRISC0_POSN                        equ 0000h
TRISC_TRISC0_POSITION                    equ 0000h
TRISC_TRISC0_SIZE                        equ 0001h
TRISC_TRISC0_LENGTH                      equ 0001h
TRISC_TRISC0_MASK                        equ 0001h
TRISC_TRISC1_POSN                        equ 0001h
TRISC_TRISC1_POSITION                    equ 0001h
TRISC_TRISC1_SIZE                        equ 0001h
TRISC_TRISC1_LENGTH                      equ 0001h
TRISC_TRISC1_MASK                        equ 0002h
TRISC_TRISC3_POSN                        equ 0003h
TRISC_TRISC3_POSITION                    equ 0003h
TRISC_TRISC3_SIZE                        equ 0001h
TRISC_TRISC3_LENGTH                      equ 0001h
TRISC_TRISC3_MASK                        equ 0008h
TRISC_TRISC4_POSN                        equ 0004h
TRISC_TRISC4_POSITION                    equ 0004h
TRISC_TRISC4_SIZE                        equ 0001h
TRISC_TRISC4_LENGTH                      equ 0001h
TRISC_TRISC4_MASK                        equ 0010h
TRISC_TRISC5_POSN                        equ 0005h
TRISC_TRISC5_POSITION                    equ 0005h
TRISC_TRISC5_SIZE                        equ 0001h
TRISC_TRISC5_LENGTH                      equ 0001h
TRISC_TRISC5_MASK                        equ 0020h
TRISC_TRISC6_POSN                        equ 0006h
TRISC_TRISC6_POSITION                    equ 0006h
TRISC_TRISC6_SIZE                        equ 0001h
TRISC_TRISC6_LENGTH                      equ 0001h
TRISC_TRISC6_MASK                        equ 0040h
TRISC_TRISC7_POSN                        equ 0007h
TRISC_TRISC7_POSITION                    equ 0007h
TRISC_TRISC7_SIZE                        equ 0001h
TRISC_TRISC7_LENGTH                      equ 0001h
TRISC_TRISC7_MASK                        equ 0080h

